; ModuleID = 'build//system/startup_time/bootloader/bootloader.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-i8:8:32-i16:16:32-i64:64-n32"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (i32)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque
%struct._mprec = type { %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint** }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%struct._rand48 = type { [3 x i16], [3 x i16], i16, i64 }
%struct.__tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args* }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, %struct._reent*, i8*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i32, %struct.__lock*, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct.__lock = type { [23 x i32] }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!170 = !DILocalVariable(name: "block_bytes", scope: !163, file: !155, line: 86, type: !36)
!171 = !DILocalVariable(name: "pad_bytes", scope: !163, file: !155, line: 87, type: !36)
!172 = !DILocalVariable(name: "bit_count", scope: !163, file: !155, line: 101, type: !39)
!173 = !DILocalVariable(name: "digest_words", scope: !163, file: !155, line: 110, type: !133)
!174 = !DILocalVariable(name: "sha_text_reg", scope: !163, file: !155, line: 111, type: !133)
!175 = !DILocalVariable(name: "i", scope: !176, file: !155, line: 112, type: !157)
!176 = distinct !DILexicalBlock(scope: !163, file: !155, line: 112, column: 5)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 512, elements: !179)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!179 = !{!180}
!180 = !DISubrange(count: 64)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!182 = distinct !DIGlobalVariable(name: "DIGEST_WORDS", scope: !147, file: !155, line: 21, type: !156, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!184 = distinct !DIGlobalVariable(name: "mapped", scope: !185, file: !199, line: 152, type: !84, isLocal: true, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !187, retainedTypes: !194, globals: !195, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!187 = !{!188}
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 43, baseType: !17, size: 32, elements: !190)
!189 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_spiflash.h", directory: "/home/mjshen/RTOSExploration/esp")
!190 = !{!191, !192, !193}
!191 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_OK", value: 0)
!192 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_ERR", value: 1)
!193 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_TIMEOUT", value: 2)
!194 = !{!35, !134, !133}
!195 = !{!196, !197, !200}
!196 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "TAG", scope: !185, file: !199, line: 124, type: !81, isLocal: true, isDefinition: true)
!199 = !DIFile(filename: "esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp")
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "current_read_mapping", scope: !185, file: !199, line: 155, type: !39, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "bootloader_flash_qe_support_list", scope: !204, file: !224, line: 35, type: !225, isLocal: false, isDefinition: true)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, globals: !221, splitDebugInlining: false, nameTableKind: None)
!205 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/flash_qio_mode.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!206 = !{!188, !207}
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 19, baseType: !17, size: 32, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!209 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QIO_MODE", value: 0)
!210 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QOUT_MODE", value: 1)
!211 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DIO_MODE", value: 2)
!212 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DOUT_MODE", value: 3)
!213 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_FASTRD_MODE", value: 4)
!214 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_SLOWRD_MODE", value: 5)
!215 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_STR_MODE", value: 6)
!216 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_DTR_MODE", value: 7)
!217 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OOUT_MODE", value: 8)
!218 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_STR_MODE", value: 9)
!219 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_DTR_MODE", value: 10)
!220 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QPI_MODE", value: 11)
!221 = !{!202, !222}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "TAG", scope: !204, file: !224, line: 21, type: !81, isLocal: true, isDefinition: true)
!224 = !DIFile(filename: "esp-idf/components/bootloader_support/bootloader_flash/src/flash_qio_mode.c", directory: "/home/mjshen/RTOSExploration/esp")
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 1008, elements: !248)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_qio_info_t", file: !228, line: 28, baseType: !229)
!228 = !DIFile(filename: "esp-idf/components/bootloader_support/bootloader_flash/include/bootloader_flash_override.h", directory: "/home/mjshen/RTOSExploration/esp")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 19, size: 144, elements: !230)
!230 = !{!231, !232, !233, !236, !237, !242, !247}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "manufacturer", scope: !229, file: !228, line: 21, baseType: !81, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mfg_id", scope: !229, file: !228, line: 22, baseType: !44, size: 8, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flash_id", scope: !229, file: !228, line: 23, baseType: !234, size: 16, offset: 40)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !40, line: 36, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !42, line: 57, baseType: !7)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "id_mask", scope: !229, file: !228, line: 24, baseType: !234, size: 16, offset: 56)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "read_status_fn", scope: !229, file: !228, line: 25, baseType: !238, size: 32, offset: 72)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_flash_read_status_fn_t", file: !228, line: 16, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DISubroutineType(types: !241)
!241 = !{!17}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "write_status_fn", scope: !229, file: !228, line: 26, baseType: !243, size: 32, offset: 104)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_flash_write_status_fn_t", file: !228, line: 17, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !17}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "status_qio_bit", scope: !229, file: !228, line: 27, baseType: !44, size: 8, offset: 136)
!248 = !{!249}
!249 = !DISubrange(count: 7)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "bootloader_image_hdr", scope: !252, file: !281, line: 25, type: !282, isLocal: false, isDefinition: true, align: 32)
!252 = distinct !DICompileUnit(language: DW_LANG_C99, file: !253, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !254, retainedTypes: !274, globals: !278, splitDebugInlining: false, nameTableKind: None)
!253 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!254 = !{!127, !5, !255, !261, !267}
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !256, line: 21, baseType: !17, size: 32, elements: !257)
!256 = !DIFile(filename: "esp-idf/components/hal/include/hal/wdt_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!257 = !{!258, !259, !260}
!258 = !DIEnumerator(name: "WDT_RWDT", value: 0)
!259 = !DIEnumerator(name: "WDT_MWDT0", value: 1)
!260 = !DIEnumerator(name: "WDT_MWDT1", value: 2)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !256, line: 30, baseType: !17, size: 32, elements: !262)
!262 = !{!263, !264, !265, !266}
!263 = !DIEnumerator(name: "WDT_STAGE0", value: 0)
!264 = !DIEnumerator(name: "WDT_STAGE1", value: 1)
!265 = !DIEnumerator(name: "WDT_STAGE2", value: 2)
!266 = !DIEnumerator(name: "WDT_STAGE3", value: 3)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !256, line: 43, baseType: !17, size: 32, elements: !268)
!268 = !{!269, !270, !271, !272, !273}
!269 = !DIEnumerator(name: "WDT_STAGE_ACTION_OFF", value: 0)
!270 = !DIEnumerator(name: "WDT_STAGE_ACTION_INT", value: 1)
!271 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_CPU", value: 2)
!272 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_SYSTEM", value: 3)
!273 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_RTC", value: 4)
!274 = !{!39, !275}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !40, line: 60, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !42, line: 105, baseType: !277)
!277 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!278 = !{!250, !279}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "TAG", scope: !252, file: !281, line: 23, type: !81, isLocal: true, isDefinition: true)
!281 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_image_header_t", file: !6, line: 93, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 74, size: 192, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !296, !298, !299, !303}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !283, file: !6, line: 75, baseType: !44, size: 8)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !283, file: !6, line: 76, baseType: !44, size: 8, offset: 8)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "spi_mode", scope: !283, file: !6, line: 77, baseType: !44, size: 8, offset: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "spi_speed", scope: !283, file: !6, line: 78, baseType: !44, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 24)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "spi_size", scope: !283, file: !6, line: 79, baseType: !44, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 24)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "entry_addr", scope: !283, file: !6, line: 80, baseType: !39, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "wp_pin", scope: !283, file: !6, line: 81, baseType: !44, size: 8, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "spi_pin_drv", scope: !283, file: !6, line: 84, baseType: !293, size: 24, offset: 72)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 3)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "chip_id", scope: !283, file: !6, line: 85, baseType: !297, size: 16, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_chip_id_t", file: !6, line: 26, baseType: !5)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "min_chip_rev", scope: !283, file: !6, line: 86, baseType: !44, size: 8, offset: 112)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !283, file: !6, line: 87, baseType: !300, size: 64, offset: 120)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 8)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "hash_appended", scope: !283, file: !6, line: 88, baseType: !44, size: 8, offset: 184)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "intr_desc_table", scope: !306, file: !330, line: 164, type: !331, isLocal: true, isDefinition: true)
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, retainedTypes: !327, globals: !329, splitDebugInlining: false, nameTableKind: None)
!307 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!308 = !{!309, !315, !322}
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 37, baseType: !17, size: 32, elements: !311)
!310 = !DIFile(filename: "esp-idf/components/esp_hw_support/include/esp_cpu.h", directory: "/home/mjshen/RTOSExploration/esp")
!311 = !{!312, !313, !314}
!312 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_LEVEL", value: 0)
!313 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_EDGE", value: 1)
!314 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_NA", value: 2)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !316, line: 23, baseType: !17, size: 32, elements: !317)
!316 = !DIFile(filename: "esp-idf/components/hal/include/hal/mpu_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!317 = !{!318, !319, !320, !321}
!318 = !DIEnumerator(name: "MPU_REGION_ILLEGAL", value: 0)
!319 = !DIEnumerator(name: "MPU_REGION_RW", value: 1)
!320 = !DIEnumerator(name: "MPU_REGION_X", value: 2)
!321 = !DIEnumerator(name: "MPU_REGION_RWX", value: 3)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 70, baseType: !17, size: 32, elements: !323)
!323 = !{!324, !325, !326}
!324 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_LOAD", value: 0)
!325 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_STORE", value: 1)
!326 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_ACCESS", value: 2)
!327 = !{!39, !37, !328}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !42, line: 184, baseType: !17)
!329 = !{!304}
!330 = !DIFile(filename: "esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp")
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 4096, elements: !340)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "intr_desc_t", file: !330, line: 160, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 156, size: 128, elements: !335)
!335 = !{!336, !337, !339}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !334, file: !330, line: 157, baseType: !36, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !330, line: 158, baseType: !338, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_intr_type_t", file: !310, line: 41, baseType: !309)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !334, file: !330, line: 159, baseType: !142, size: 64, offset: 64)
!340 = !{!341}
!341 = !DISubrange(count: 32)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "s_cur_pll_freq", scope: !344, file: !388, line: 35, type: !328, isLocal: true, isDefinition: true)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !345, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !346, retainedTypes: !380, globals: !385, splitDebugInlining: false, nameTableKind: None)
!345 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!346 = !{!347, !353, !361, !368, !374}
!347 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !348, line: 77, baseType: !17, size: 32, elements: !349)
!348 = !DIFile(filename: "esp-idf/components/hal/esp32/include/hal/clk_tree_ll.h", directory: "/home/mjshen/RTOSExploration/esp")
!349 = !{!350, !351, !352}
!350 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_CRYSTAL", value: 0)
!351 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_EXTERNAL", value: 1)
!352 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_BOOTSTRAP", value: 2)
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 64, baseType: !17, size: 32, elements: !355)
!354 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/clk_tree_defs.h", directory: "/home/mjshen/RTOSExploration/esp")
!355 = !{!356, !357, !358, !359, !360}
!356 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_XTAL", value: 0)
!357 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_PLL", value: 1)
!358 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_RC_FAST", value: 2)
!359 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_APLL", value: 3)
!360 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_INVALID", value: 4)
!361 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !362, line: 82, baseType: !17, size: 32, elements: !363)
!362 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/rtc.h", directory: "/home/mjshen/RTOSExploration/esp")
!363 = !{!364, !365, !366, !367}
!364 = !DIEnumerator(name: "RTC_XTAL_FREQ_AUTO", value: 0)
!365 = !DIEnumerator(name: "RTC_XTAL_FREQ_40M", value: 40)
!366 = !DIEnumerator(name: "RTC_XTAL_FREQ_26M", value: 26)
!367 = !DIEnumerator(name: "RTC_XTAL_FREQ_24M", value: 24)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 76, baseType: !17, size: 32, elements: !369)
!369 = !{!370, !371, !372, !373}
!370 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_SLOW", value: 0)
!371 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_XTAL32K", value: 1)
!372 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_FAST_D256", value: 2)
!373 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_INVALID", value: 3)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 87, baseType: !17, size: 32, elements: !375)
!375 = !{!376, !377, !378, !379}
!376 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_D4", value: 0)
!377 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_DIV", value: 0)
!378 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_RC_FAST", value: 1)
!379 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_INVALID", value: 2)
!380 = !{!328, !381, !36, !383, !384}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !328)
!383 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtc_xtal_freq_t", file: !362, line: 87, baseType: !361)
!385 = !{!342, !386}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "TAG", scope: !344, file: !388, line: 37, type: !81, isLocal: true, isDefinition: true)
!388 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp")
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!390 = distinct !DIGlobalVariable(name: "s_lock", scope: !391, file: !397, line: 12, type: !36, isLocal: true, isDefinition: true)
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !393, globals: !395, splitDebugInlining: false, nameTableKind: None)
!392 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_cycle_count_t", file: !310, line: 32, baseType: !39)
!395 = !{!396}
!396 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!397 = !DIFile(filename: "esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp")
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !400, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/soc/esp32/./dport_access.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!400 = !{!73}
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !403, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!403 = !{!134, !84}
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader/subproject/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!406 = !{!97}
!407 = !{!408}
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "TAG", scope: !404, file: !410, line: 14, type: !81, isLocal: true, isDefinition: true)
!410 = !DIFile(filename: "esp-idf/components/bootloader/subproject/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp")
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !413, retainedTypes: !434, globals: !435, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!413 = !{!414, !428}
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !415, line: 19, baseType: !17, size: 32, elements: !416)
!415 = !DIFile(filename: "esp-idf/components/efuse/esp32/include/esp_efuse_chip.h", directory: "/home/mjshen/RTOSExploration/esp")
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427}
!417 = !DIEnumerator(name: "EFUSE_BLK0", value: 0)
!418 = !DIEnumerator(name: "EFUSE_BLK1", value: 1)
!419 = !DIEnumerator(name: "EFUSE_BLK_KEY0", value: 1)
!420 = !DIEnumerator(name: "EFUSE_BLK_ENCRYPT_FLASH", value: 1)
!421 = !DIEnumerator(name: "EFUSE_BLK2", value: 2)
!422 = !DIEnumerator(name: "EFUSE_BLK_KEY1", value: 2)
!423 = !DIEnumerator(name: "EFUSE_BLK_SECURE_BOOT", value: 2)
!424 = !DIEnumerator(name: "EFUSE_BLK3", value: 3)
!425 = !DIEnumerator(name: "EFUSE_BLK_KEY2", value: 3)
!426 = !DIEnumerator(name: "EFUSE_BLK_KEY_MAX", value: 4)
!427 = !DIEnumerator(name: "EFUSE_BLK_MAX", value: 4)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !429, line: 23, baseType: !17, size: 32, elements: !430)
!429 = !DIFile(filename: "esp-idf/components/bootloader_support/include/esp_flash_encrypt.h", directory: "/home/mjshen/RTOSExploration/esp")
!430 = !{!431, !432, !433}
!431 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DISABLED", value: 0)
!432 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DEVELOPMENT", value: 1)
!433 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_RELEASE", value: 2)
!434 = !{!37}
!435 = !{!436}
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "TAG", scope: !411, file: !438, line: 23, type: !81, isLocal: true, isDefinition: true)
!438 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp")
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !441, globals: !443, splitDebugInlining: false, nameTableKind: None)
!440 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!441 = !{!442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!443 = !{!444}
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "TAG", scope: !439, file: !446, line: 12, type: !81, isLocal: true, isDefinition: true)
!446 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp")
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!448 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!450 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_soc.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !453, retainedTypes: !454, globals: !455, splitDebugInlining: false, nameTableKind: None)
!452 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!453 = !{!5, !188, !97}
!454 = !{!39, !37}
!455 = !{!456}
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "TAG", scope: !451, file: !458, line: 40, type: !81, isLocal: true, isDefinition: true)
!458 = !DIFile(filename: "esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp")
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !461, retainedTypes: !467, globals: !469, splitDebugInlining: false, nameTableKind: None)
!460 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!461 = !{!462, !5}
!462 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 16, baseType: !36, size: 32, elements: !463)
!463 = !{!464, !465, !466}
!464 = !DIEnumerator(name: "GPIO_LONG_HOLD", value: 1)
!465 = !DIEnumerator(name: "GPIO_SHORT_HOLD", value: -1)
!466 = !DIEnumerator(name: "GPIO_NOT_HOLD", value: 0)
!467 = !{!39, !37, !35, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!469 = !{!470}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "TAG", scope: !459, file: !472, line: 30, type: !81, isLocal: true, isDefinition: true)
!472 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp")
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !475, retainedTypes: !476, globals: !477, splitDebugInlining: false, nameTableKind: None)
!474 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!475 = !{!15, !5, !127}
!476 = !{!43, !35}
!477 = !{!478}
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "TAG", scope: !473, file: !480, line: 29, type: !81, isLocal: true, isDefinition: true)
!480 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp")
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !483, retainedTypes: !484, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_clock_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!483 = !{!97, !361, !374, !368}
!484 = !{!381}
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!486 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_mem.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !489, splitDebugInlining: false, nameTableKind: None)
!488 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!489 = !{!43, !35, !37, !394}
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !492, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!492 = !{!328, !381}
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !494, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !495, retainedTypes: !454, splitDebugInlining: false, nameTableKind: None)
!494 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash_config_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!495 = !{!5, !188, !496}
!496 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 47, baseType: !17, size: 32, elements: !497)
!497 = !{!498, !499, !500, !501}
!498 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_2", value: 0)
!499 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_3", value: 1)
!500 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_4", value: 2)
!501 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_1", value: 15)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !434, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_efuse.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !508, retainedTypes: !514, globals: !515, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!508 = !{!361, !374, !368, !353, !509}
!509 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !362, line: 102, baseType: !17, size: 32, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIEnumerator(name: "RTC_CAL_RTC_MUX", value: 0)
!512 = !DIEnumerator(name: "RTC_CAL_8MD256", value: 1)
!513 = !DIEnumerator(name: "RTC_CAL_32K_XTAL", value: 2)
!514 = !{!37, !275, !39, !394}
!515 = !{!516}
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "TAG", scope: !506, file: !518, line: 31, type: !81, isLocal: true, isDefinition: true)
!518 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !492, splitDebugInlining: false, nameTableKind: None)
!520 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !523, retainedTypes: !524, globals: !526, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!523 = !{!509, !361, !368}
!524 = !{!328, !525, !381}
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !42, line: 202, baseType: !277)
!526 = !{!527}
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "TAG", scope: !521, file: !529, line: 14, type: !81, isLocal: true, isDefinition: true)
!529 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp")
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_sys.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!532 = distinct !DICompileUnit(language: DW_LANG_C99, file: !533, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!533 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_uart.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !536, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_spiflash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!536 = !{!381, !328, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !540, splitDebugInlining: false, nameTableKind: None)
!539 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mpu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!540 = !{!315}
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !543, splitDebugInlining: false, nameTableKind: None)
!542 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!543 = !{!544, !545, !546, !73}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !76, line: 207, baseType: !7)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !400, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/esp32/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !454, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mmu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !553, splitDebugInlining: false, nameTableKind: None)
!552 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/wdt_hal_iram.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/startup_time/bootloader")
!553 = !{!255, !261, !554, !267}
!554 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !256, line: 57, baseType: !17, size: 32, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563}
!556 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_100ns", value: 0)
!557 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_200ns", value: 1)
!558 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_300ns", value: 2)
!559 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_400ns", value: 3)
!560 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_500ns", value: 4)
!561 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_800ns", value: 5)
!562 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_1_6us", value: 6)
!563 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_3_2us", value: 7)
!564 = !{!"clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)"}
!565 = !{i32 7, !"Dwarf Version", i32 4}
!566 = !{i32 2, !"Debug Info Version", i32 3}
!567 = !{i32 1, !"wchar_size", i32 1}
!568 = distinct !DISubprogram(name: "esp_dport_access_reg_read", scope: !569, file: !569, line: 13, type: !570, scopeLine: 14, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !398, retainedNodes: !572)
!569 = !DIFile(filename: "esp-idf/components/soc/esp32/dport_access.c", directory: "/home/mjshen/RTOSExploration/esp")
!570 = !DISubroutineType(types: !571)
!571 = !{!75, !75}
!572 = !{!573}
!573 = !DILocalVariable(name: "reg", arg: 1, scope: !568, file: !569, line: 13, type: !75)
!574 = !DILocation(line: 0, scope: !568)
!575 = !DILocation(line: 16, column: 12, scope: !568)
!576 = !{!577, !577, i64 0}
!577 = !{!"int", !578, i64 0}
!578 = !{!"omnipotent char", !579, i64 0}
!579 = !{!"Simple C/C++ TBAA"}
!580 = !DILocation(line: 16, column: 5, scope: !568)
!581 = distinct !DISubprogram(name: "esp_dport_access_sequence_reg_read", scope: !569, file: !569, line: 35, type: !570, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !398, retainedNodes: !582)
!582 = !{!583}
!583 = !DILocalVariable(name: "reg", arg: 1, scope: !581, file: !569, line: 35, type: !75)
!584 = !DILocation(line: 0, scope: !581)
!585 = !DILocation(line: 38, column: 12, scope: !581)
!586 = !DILocation(line: 38, column: 5, scope: !581)
!587 = distinct !DISubprogram(name: "__assert_func", scope: !588, file: !588, line: 13, type: !589, scopeLine: 14, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !401, retainedNodes: !591)
!588 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp")
!589 = !DISubroutineType(types: !590)
!590 = !{null, !81, !36, !81, !81}
!591 = !{!592, !593, !594, !595}
!592 = !DILocalVariable(name: "file", arg: 1, scope: !587, file: !588, line: 13, type: !81)
!593 = !DILocalVariable(name: "line", arg: 2, scope: !587, file: !588, line: 13, type: !36)
!594 = !DILocalVariable(name: "func", arg: 3, scope: !587, file: !588, line: 13, type: !81)
!595 = !DILocalVariable(name: "expr", arg: 4, scope: !587, file: !588, line: 13, type: !81)
!596 = !DILocation(line: 0, scope: !587)
!597 = !DILocation(line: 17, column: 5, scope: !587)
!598 = !DILocation(line: 20, column: 5, scope: !587)
!599 = distinct !{!599, !598, !600}
!600 = !DILocation(line: 21, column: 5, scope: !587)
!601 = !DISubprogram(name: "esp_rom_printf", scope: !602, file: !602, line: 24, type: !603, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !605)
!602 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_sys.h", directory: "/home/mjshen/RTOSExploration/esp")
!603 = !DISubroutineType(types: !604)
!604 = !{!36, !81, null}
!605 = !{}
!606 = distinct !DISubprogram(name: "abort", scope: !588, file: !588, line: 24, type: !71, scopeLine: 25, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !401, retainedNodes: !605)
!607 = !DILocation(line: 27, column: 69, scope: !606)
!608 = !DILocation(line: 27, column: 59, scope: !606)
!609 = !DILocation(line: 27, column: 97, scope: !606)
!610 = !DILocation(line: 27, column: 5, scope: !606)
!611 = !DILocalVariable(name: "dcr", scope: !612, file: !613, line: 189, type: !328)
!612 = distinct !DISubprogram(name: "xt_utils_dbgr_is_attached", scope: !613, file: !613, line: 187, type: !614, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !401, retainedNodes: !616)
!613 = !DIFile(filename: "esp-idf/components/xtensa/include/xt_utils.h", directory: "/home/mjshen/RTOSExploration/esp")
!614 = !DISubroutineType(types: !615)
!615 = !{!84}
!616 = !{!611, !617}
!617 = !DILocalVariable(name: "reg", scope: !612, file: !613, line: 190, type: !328)
!618 = !DILocation(line: 0, scope: !612, inlinedAt: !619)
!619 = distinct !DILocation(line: 497, column: 12, scope: !620, inlinedAt: !621)
!620 = distinct !DISubprogram(name: "esp_cpu_dbgr_is_attached", scope: !310, file: !310, line: 494, type: !614, scopeLine: 495, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !401, retainedNodes: !605)
!621 = distinct !DILocation(line: 29, column: 9, scope: !622)
!622 = distinct !DILexicalBlock(scope: !606, file: !588, line: 29, column: 9)
!623 = !DILocation(line: 191, column: 5, scope: !612, inlinedAt: !619)
!624 = !{i64 2148037527}
!625 = !DILocation(line: 192, column: 23, scope: !612, inlinedAt: !619)
!626 = !DILocation(line: 192, column: 12, scope: !612, inlinedAt: !619)
!627 = !DILocation(line: 29, column: 9, scope: !606)
!628 = !DILocation(line: 197, column: 5, scope: !629, inlinedAt: !630)
!629 = distinct !DISubprogram(name: "xt_utils_dbgr_break", scope: !613, file: !613, line: 195, type: !71, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !401, retainedNodes: !605)
!630 = distinct !DILocation(line: 509, column: 5, scope: !631, inlinedAt: !632)
!631 = distinct !DISubprogram(name: "esp_cpu_dbgr_break", scope: !310, file: !310, line: 506, type: !71, scopeLine: 507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !401, retainedNodes: !605)
!632 = distinct !DILocation(line: 30, column: 9, scope: !633)
!633 = distinct !DILexicalBlock(scope: !622, file: !588, line: 29, column: 37)
!634 = !{i64 513380}
!635 = !DILocation(line: 31, column: 5, scope: !633)
!636 = !DILocation(line: 32, column: 5, scope: !606)
!637 = distinct !{!637, !636, !638}
!638 = !DILocation(line: 33, column: 5, scope: !606)
!639 = distinct !DISubprogram(name: "call_start_cpu0", scope: !410, file: !410, line: 24, type: !71, scopeLine: 25, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !404, retainedNodes: !640)
!640 = !{!641, !660}
!641 = !DILocalVariable(name: "bs", scope: !639, file: !410, line: 50, type: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !643, line: 32, baseType: !644)
!643 = !DIFile(filename: "esp-idf/components/bootloader_support/private_include/bootloader_config.h", directory: "/home/mjshen/RTOSExploration/esp")
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !643, line: 25, size: 1280, elements: !645)
!645 = !{!646, !652, !653, !654, !658, !659}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !644, file: !643, line: 26, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !16, line: 71, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 68, size: 64, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !648, file: !16, line: 69, baseType: !39, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !648, file: !16, line: 70, baseType: !39, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !644, file: !643, line: 27, baseType: !647, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !644, file: !643, line: 28, baseType: !647, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !644, file: !643, line: 29, baseType: !655, size: 1024, offset: 192)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 1024, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 16)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !644, file: !643, line: 30, baseType: !39, size: 32, offset: 1216)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !644, file: !643, line: 31, baseType: !39, size: 32, offset: 1248)
!660 = !DILocalVariable(name: "boot_index", scope: !639, file: !410, line: 51, type: !36)
!661 = !DILocation(line: 27, column: 9, scope: !639)
!662 = !DILocation(line: 28, column: 9, scope: !663)
!663 = distinct !DILexicalBlock(scope: !664, file: !410, line: 27, column: 33)
!664 = distinct !DILexicalBlock(scope: !639, file: !410, line: 27, column: 9)
!665 = !DILocation(line: 29, column: 5, scope: !663)
!666 = !DILocation(line: 32, column: 9, scope: !667)
!667 = distinct !DILexicalBlock(scope: !639, file: !410, line: 32, column: 9)
!668 = !DILocation(line: 32, column: 27, scope: !667)
!669 = !DILocation(line: 32, column: 9, scope: !639)
!670 = !DILocation(line: 33, column: 9, scope: !671)
!671 = distinct !DILexicalBlock(scope: !667, file: !410, line: 32, column: 38)
!672 = !DILocation(line: 37, column: 9, scope: !639)
!673 = !DILocation(line: 38, column: 9, scope: !674)
!674 = distinct !DILexicalBlock(scope: !675, file: !410, line: 37, column: 32)
!675 = distinct !DILexicalBlock(scope: !639, file: !410, line: 37, column: 9)
!676 = !DILocation(line: 39, column: 5, scope: !674)
!677 = !DILocation(line: 50, column: 5, scope: !639)
!678 = !DILocation(line: 50, column: 24, scope: !639)
!679 = !DILocation(line: 51, column: 22, scope: !639)
!680 = !DILocalVariable(name: "bs", arg: 1, scope: !681, file: !410, line: 61, type: !684)
!681 = distinct !DISubprogram(name: "select_partition_number", scope: !410, file: !410, line: 61, type: !682, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !404, retainedNodes: !685)
!682 = !DISubroutineType(types: !683)
!683 = !{!36, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!685 = !{!680}
!686 = !DILocation(line: 0, scope: !681, inlinedAt: !687)
!687 = distinct !DILocation(line: 51, column: 22, scope: !639)
!688 = !DILocation(line: 64, column: 10, scope: !689, inlinedAt: !687)
!689 = distinct !DILexicalBlock(scope: !681, file: !410, line: 64, column: 9)
!690 = !DILocation(line: 64, column: 9, scope: !681, inlinedAt: !687)
!691 = !DILocation(line: 65, column: 9, scope: !692, inlinedAt: !687)
!692 = distinct !DILexicalBlock(scope: !693, file: !410, line: 65, column: 9)
!693 = distinct !DILexicalBlock(scope: !694, file: !410, line: 65, column: 9)
!694 = distinct !DILexicalBlock(scope: !695, file: !410, line: 65, column: 9)
!695 = distinct !DILexicalBlock(scope: !689, file: !410, line: 64, column: 55)
!696 = !DILocation(line: 66, column: 9, scope: !695, inlinedAt: !687)
!697 = !DILocalVariable(name: "bs", arg: 1, scope: !698, file: !410, line: 77, type: !701)
!698 = distinct !DISubprogram(name: "selected_boot_partition", scope: !410, file: !410, line: 77, type: !699, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !404, retainedNodes: !703)
!699 = !DISubroutineType(types: !700)
!700 = !{!36, !701}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!703 = !{!697, !704}
!704 = !DILocalVariable(name: "boot_index", scope: !698, file: !410, line: 79, type: !36)
!705 = !DILocation(line: 0, scope: !698, inlinedAt: !706)
!706 = distinct !DILocation(line: 70, column: 12, scope: !681, inlinedAt: !687)
!707 = !DILocation(line: 79, column: 22, scope: !698, inlinedAt: !706)
!708 = !DILocation(line: 80, column: 20, scope: !709, inlinedAt: !706)
!709 = distinct !DILexicalBlock(scope: !698, file: !410, line: 80, column: 9)
!710 = !DILocation(line: 80, column: 9, scope: !698, inlinedAt: !706)
!711 = !DILocation(line: 0, scope: !639)
!712 = !DILocation(line: 53, column: 9, scope: !713)
!713 = distinct !DILexicalBlock(scope: !714, file: !410, line: 52, column: 38)
!714 = distinct !DILexicalBlock(scope: !639, file: !410, line: 52, column: 9)
!715 = !DILocation(line: 83, column: 9, scope: !716, inlinedAt: !706)
!716 = distinct !DILexicalBlock(scope: !698, file: !410, line: 83, column: 9)
!717 = !DILocation(line: 57, column: 5, scope: !639)
!718 = !DISubprogram(name: "bootloader_before_init", scope: !719, file: !719, line: 30, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !605)
!719 = !DIFile(filename: "esp-idf/components/bootloader/subproject/main/bootloader_hooks.h", directory: "/home/mjshen/RTOSExploration/esp")
!720 = !DISubprogram(name: "bootloader_after_init", scope: !719, file: !719, line: 36, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !605)
!721 = !DISubprogram(name: "esp_rom_get_reset_reason", scope: !602, file: !602, line: 53, type: !722, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !605)
!722 = !DISubroutineType(types: !723)
!723 = !{!724, !36}
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "soc_reset_reason_t", file: !98, line: 54, baseType: !97)
!725 = distinct !DISubprogram(name: "__getreent", scope: !410, file: !410, line: 130, type: !726, scopeLine: 131, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !404, retainedNodes: !605)
!726 = !DISubroutineType(types: !727)
!727 = !{!728}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !730, line: 377, size: 1920, elements: !731)
!730 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/reent.h", directory: "/home/mjshen/RTOSExploration/esp")
!731 = !{!732, !733, !811, !812, !813, !814, !815, !816, !817, !821, !842, !846, !847, !848, !849, !858, !871, !872, !877, !894, !895, !902, !903, !919}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !729, file: !730, line: 381, baseType: !36, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !729, file: !730, line: 386, baseType: !734, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !730, line: 292, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !730, line: 186, size: 832, elements: !737)
!737 = !{!738, !739, !740, !741, !743, !744, !749, !750, !751, !752, !756, !760, !766, !770, !771, !772, !773, !775, !779, !780, !781, !783, !795, !810}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !736, file: !730, line: 187, baseType: !442, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !736, file: !730, line: 188, baseType: !36, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !736, file: !730, line: 189, baseType: !36, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !736, file: !730, line: 190, baseType: !742, size: 16, offset: 96)
!742 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !736, file: !730, line: 191, baseType: !742, size: 16, offset: 112)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !736, file: !730, line: 192, baseType: !745, size: 64, offset: 128)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !730, line: 122, size: 64, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !745, file: !730, line: 123, baseType: !442, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !745, file: !730, line: 124, baseType: !36, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !736, file: !730, line: 193, baseType: !36, size: 32, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !736, file: !730, line: 196, baseType: !728, size: 32, offset: 224)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !736, file: !730, line: 200, baseType: !35, size: 32, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !736, file: !730, line: 202, baseType: !753, size: 32, offset: 288)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DISubroutineType(types: !755)
!755 = !{!36, !728, !35, !468, !36}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !736, file: !730, line: 204, baseType: !757, size: 32, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DISubroutineType(types: !759)
!759 = !{!36, !728, !35, !81, !36}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !736, file: !730, line: 207, baseType: !761, size: 32, offset: 352)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DISubroutineType(types: !763)
!763 = !{!764, !728, !35, !764, !36}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !160, line: 116, baseType: !765)
!765 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !736, file: !730, line: 208, baseType: !767, size: 32, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = !DISubroutineType(types: !769)
!769 = !{!36, !728, !35}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !736, file: !730, line: 211, baseType: !745, size: 64, offset: 416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !736, file: !730, line: 212, baseType: !442, size: 32, offset: 480)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !736, file: !730, line: 213, baseType: !36, size: 32, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !736, file: !730, line: 216, baseType: !774, size: 24, offset: 544)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 24, elements: !294)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !736, file: !730, line: 217, baseType: !776, size: 8, offset: 568)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 1)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !736, file: !730, line: 220, baseType: !745, size: 64, offset: 576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !736, file: !730, line: 223, baseType: !36, size: 32, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !736, file: !730, line: 224, baseType: !782, size: 32, offset: 672)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !160, line: 46, baseType: !765)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !736, file: !730, line: 231, baseType: !784, size: 32, offset: 704)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !730, line: 35, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !786, line: 34, baseType: !787)
!786 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !789, line: 23, size: 736, elements: !790)
!789 = !DIFile(filename: "esp-idf/components/newlib/platform_include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !788, file: !789, line: 24, baseType: !792, size: 736)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 736, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 23)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !736, file: !730, line: 233, baseType: !796, size: 64, offset: 736)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !160, line: 170, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 162, size: 64, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !797, file: !160, line: 164, baseType: !36, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !797, file: !160, line: 169, baseType: !801, size: 32, offset: 32)
!801 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !797, file: !160, line: 165, size: 32, elements: !802)
!802 = !{!803, !806}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !801, file: !160, line: 167, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !805, line: 116, baseType: !17)
!805 = !DIFile(filename: "xtensa-esp32-elf-clang/lib/clang/14.0.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/esp")
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !801, file: !160, line: 168, baseType: !807, size: 32)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 4)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !736, file: !730, line: 234, baseType: !36, size: 32, offset: 800)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !729, file: !730, line: 386, baseType: !734, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !729, file: !730, line: 386, baseType: !734, size: 32, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !729, file: !730, line: 388, baseType: !36, size: 32, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !729, file: !730, line: 390, baseType: !468, size: 32, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !729, file: !730, line: 392, baseType: !36, size: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !729, file: !730, line: 394, baseType: !36, size: 32, offset: 224)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !729, file: !730, line: 395, baseType: !818, size: 32, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !820, line: 9, flags: DIFlagFwdDecl)
!820 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/_locale.h", directory: "/home/mjshen/RTOSExploration/esp")
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !729, file: !730, line: 397, baseType: !822, size: 32, offset: 288)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !730, line: 349, size: 128, elements: !824)
!824 = !{!825, !838, !839, !840}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !823, file: !730, line: 352, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !730, line: 52, size: 192, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !834}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !827, file: !730, line: 54, baseType: !826, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !827, file: !730, line: 55, baseType: !36, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !827, file: !730, line: 55, baseType: !36, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !827, file: !730, line: 55, baseType: !36, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !827, file: !730, line: 55, baseType: !36, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !827, file: !730, line: 56, baseType: !835, size: 32, offset: 160)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 32, elements: !777)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !730, line: 22, baseType: !837)
!837 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !823, file: !730, line: 353, baseType: !36, size: 32, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !823, file: !730, line: 354, baseType: !826, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !823, file: !730, line: 355, baseType: !841, size: 32, offset: 96)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !729, file: !730, line: 399, baseType: !843, size: 32, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{null, !728}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !729, file: !730, line: 401, baseType: !36, size: 32, offset: 352)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !729, file: !730, line: 404, baseType: !36, size: 32, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !729, file: !730, line: 405, baseType: !468, size: 32, offset: 416)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !729, file: !730, line: 407, baseType: !850, size: 32, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !730, line: 324, size: 192, elements: !852)
!852 = !{!853, !855, !856, !857}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !851, file: !730, line: 325, baseType: !854, size: 48)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !294)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !851, file: !730, line: 326, baseType: !854, size: 48, offset: 48)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !851, file: !730, line: 327, baseType: !7, size: 16, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !851, file: !730, line: 330, baseType: !277, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !729, file: !730, line: 408, baseType: !859, size: 32, offset: 480)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !730, line: 60, size: 288, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !860, file: !730, line: 62, baseType: !36, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !860, file: !730, line: 63, baseType: !36, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !860, file: !730, line: 64, baseType: !36, size: 32, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !860, file: !730, line: 65, baseType: !36, size: 32, offset: 96)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !860, file: !730, line: 66, baseType: !36, size: 32, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !860, file: !730, line: 67, baseType: !36, size: 32, offset: 160)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !860, file: !730, line: 68, baseType: !36, size: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !860, file: !730, line: 69, baseType: !36, size: 32, offset: 224)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !860, file: !730, line: 70, baseType: !36, size: 32, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !729, file: !730, line: 409, baseType: !468, size: 32, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !729, file: !730, line: 412, baseType: !873, size: 32, offset: 544)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !36}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !729, file: !730, line: 416, baseType: !878, size: 32, offset: 576)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !730, line: 90, size: 1120, elements: !880)
!880 = !{!881, !882, !883, !885}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !879, file: !730, line: 91, baseType: !878, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !879, file: !730, line: 92, baseType: !36, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !879, file: !730, line: 93, baseType: !884, size: 1024, offset: 64)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1024, elements: !340)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !879, file: !730, line: 94, baseType: !886, size: 32, offset: 1088)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !730, line: 79, size: 2112, elements: !888)
!888 = !{!889, !891, !892, !893}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !887, file: !730, line: 80, baseType: !890, size: 1024)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1024, elements: !340)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !887, file: !730, line: 81, baseType: !890, size: 1024, offset: 1024)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !887, file: !730, line: 83, baseType: !836, size: 32, offset: 2048)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !887, file: !730, line: 86, baseType: !836, size: 32, offset: 2080)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !729, file: !730, line: 417, baseType: !879, size: 1120, offset: 608)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !729, file: !730, line: 420, baseType: !896, size: 96, offset: 1728)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !730, line: 296, size: 96, elements: !897)
!897 = !{!898, !900, !901}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !896, file: !730, line: 298, baseType: !899, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !896, file: !730, line: 299, baseType: !36, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !896, file: !730, line: 300, baseType: !734, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !729, file: !730, line: 421, baseType: !734, size: 32, offset: 1824)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !729, file: !730, line: 422, baseType: !904, size: 32, offset: 1856)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !730, line: 359, size: 640, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !913, !914, !915, !916, !917, !918}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !905, file: !730, line: 362, baseType: !468, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !905, file: !730, line: 363, baseType: !796, size: 64, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !905, file: !730, line: 364, baseType: !796, size: 64, offset: 96)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !905, file: !730, line: 365, baseType: !796, size: 64, offset: 160)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !905, file: !730, line: 366, baseType: !912, size: 64, offset: 224)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !301)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !905, file: !730, line: 367, baseType: !36, size: 32, offset: 288)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !905, file: !730, line: 368, baseType: !796, size: 64, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !905, file: !730, line: 369, baseType: !796, size: 64, offset: 384)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !905, file: !730, line: 370, baseType: !796, size: 64, offset: 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !905, file: !730, line: 371, baseType: !796, size: 64, offset: 512)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !905, file: !730, line: 372, baseType: !796, size: 64, offset: 576)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !729, file: !730, line: 423, baseType: !468, size: 32, offset: 1888)
!920 = !DILocation(line: 132, column: 12, scope: !725)
!921 = !{!922, !922, i64 0}
!922 = !{!"any pointer", !578, i64 0}
!923 = !DILocation(line: 132, column: 5, scope: !725)
!924 = distinct !DISubprogram(name: "bootloader_common_get_partition_description", scope: !48, file: !48, line: 123, type: !925, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !957)
!925 = !DISubroutineType(types: !926)
!926 = !{!927, !929, !936}
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_err_t", file: !928, line: 19, baseType: !36)
!928 = !DIFile(filename: "esp-idf/components/esp_common/include/esp_err.h", directory: "/home/mjshen/RTOSExploration/esp")
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !16, line: 71, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 68, size: 64, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !932, file: !16, line: 69, baseType: !39, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !932, file: !16, line: 70, baseType: !39, size: 32, offset: 32)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_app_desc_t", file: !938, line: 35, baseType: !939)
!938 = !DIFile(filename: "esp-idf/components/esp_app_format/include/esp_app_desc.h", directory: "/home/mjshen/RTOSExploration/esp")
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !938, line: 24, size: 2048, elements: !940)
!940 = !{!941, !942, !943, !944, !946, !947, !949, !950, !951, !953}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "magic_word", scope: !939, file: !938, line: 25, baseType: !39, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "secure_version", scope: !939, file: !938, line: 26, baseType: !39, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "reserv1", scope: !939, file: !938, line: 27, baseType: !142, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !939, file: !938, line: 28, baseType: !945, size: 256, offset: 128)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, elements: !340)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "project_name", scope: !939, file: !938, line: 29, baseType: !945, size: 256, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !939, file: !938, line: 30, baseType: !948, size: 128, offset: 640)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, elements: !656)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !939, file: !938, line: 31, baseType: !948, size: 128, offset: 768)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "idf_ver", scope: !939, file: !938, line: 32, baseType: !945, size: 256, offset: 896)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "app_elf_sha256", scope: !939, file: !938, line: 33, baseType: !952, size: 256, offset: 1152)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 256, elements: !340)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "reserv2", scope: !939, file: !938, line: 34, baseType: !954, size: 640, offset: 1408)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 640, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 20)
!957 = !{!958, !959, !960, !961, !962}
!958 = !DILocalVariable(name: "partition", arg: 1, scope: !924, file: !48, line: 123, type: !929)
!959 = !DILocalVariable(name: "app_desc", arg: 2, scope: !924, file: !48, line: 123, type: !936)
!960 = !DILocalVariable(name: "app_desc_offset", scope: !924, file: !48, line: 129, type: !137)
!961 = !DILocalVariable(name: "mmap_size", scope: !924, file: !48, line: 130, type: !137)
!962 = !DILocalVariable(name: "image", scope: !924, file: !48, line: 131, type: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!964 = !DILocation(line: 0, scope: !924)
!965 = !DILocation(line: 125, column: 19, scope: !966)
!966 = distinct !DILexicalBlock(scope: !924, file: !48, line: 125, column: 9)
!967 = !DILocation(line: 125, column: 27, scope: !966)
!968 = !DILocation(line: 125, column: 61, scope: !966)
!969 = !{!970, !577, i64 0}
!970 = !{!"", !577, i64 0, !577, i64 4}
!971 = !DILocation(line: 125, column: 68, scope: !966)
!972 = !DILocation(line: 125, column: 9, scope: !924)
!973 = !DILocation(line: 131, column: 28, scope: !924)
!974 = !DILocation(line: 132, column: 15, scope: !975)
!975 = distinct !DILexicalBlock(scope: !924, file: !48, line: 132, column: 9)
!976 = !DILocation(line: 132, column: 9, scope: !924)
!977 = !DILocation(line: 133, column: 9, scope: !978)
!978 = distinct !DILexicalBlock(scope: !979, file: !48, line: 133, column: 9)
!979 = distinct !DILexicalBlock(scope: !980, file: !48, line: 133, column: 9)
!980 = distinct !DILexicalBlock(scope: !981, file: !48, line: 133, column: 9)
!981 = distinct !DILexicalBlock(scope: !975, file: !48, line: 132, column: 24)
!982 = !DILocation(line: 134, column: 9, scope: !981)
!983 = !DILocation(line: 137, column: 28, scope: !924)
!984 = !DILocation(line: 137, column: 5, scope: !924)
!985 = !DILocation(line: 138, column: 5, scope: !924)
!986 = !DILocation(line: 140, column: 19, scope: !987)
!987 = distinct !DILexicalBlock(scope: !924, file: !48, line: 140, column: 9)
!988 = !{!989, !577, i64 0}
!989 = !{!"", !577, i64 0, !577, i64 4, !578, i64 8, !578, i64 16, !578, i64 48, !578, i64 80, !578, i64 96, !578, i64 112, !578, i64 144, !578, i64 176}
!990 = !DILocation(line: 140, column: 30, scope: !987)
!991 = !DILocation(line: 145, column: 1, scope: !924)
!992 = !DISubprogram(name: "memcpy", scope: !993, file: !993, line: 31, type: !994, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !605)
!993 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/string.h", directory: "/home/mjshen/RTOSExploration/esp")
!994 = !DISubroutineType(types: !995)
!995 = !{!35, !996, !997, !157}
!996 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !35)
!997 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1000 = distinct !DISubprogram(name: "bootloader_utility_load_partition_table", scope: !48, file: !48, line: 148, type: !1001, scopeLine: 149, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1014)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!84, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !643, line: 32, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !643, line: 25, size: 1280, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1012, !1013}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !1005, file: !643, line: 26, baseType: !931, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !1005, file: !643, line: 27, baseType: !931, size: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !1005, file: !643, line: 28, baseType: !931, size: 64, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !1005, file: !643, line: 29, baseType: !1011, size: 1024, offset: 192)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 1024, elements: !656)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !1005, file: !643, line: 30, baseType: !39, size: 32, offset: 1216)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !1005, file: !643, line: 31, baseType: !39, size: 32, offset: 1248)
!1014 = !{!1015, !1016, !1029, !1030, !1031, !1032, !1034}
!1015 = !DILocalVariable(name: "bs", arg: 1, scope: !1000, file: !48, line: 148, type: !1003)
!1016 = !DILocalVariable(name: "partitions", scope: !1000, file: !48, line: 150, type: !1017)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_info_t", file: !16, line: 83, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 76, size: 256, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1028}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1020, file: !16, line: 77, baseType: !234, size: 16)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1020, file: !16, line: 78, baseType: !44, size: 8, offset: 16)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1020, file: !16, line: 79, baseType: !44, size: 8, offset: 24)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1020, file: !16, line: 80, baseType: !931, size: 64, offset: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1020, file: !16, line: 81, baseType: !1027, size: 128, offset: 96)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, elements: !656)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1020, file: !16, line: 82, baseType: !39, size: 32, offset: 224)
!1029 = !DILocalVariable(name: "partition_usage", scope: !1000, file: !48, line: 151, type: !81)
!1030 = !DILocalVariable(name: "err", scope: !1000, file: !48, line: 152, type: !927)
!1031 = !DILocalVariable(name: "num_partitions", scope: !1000, file: !48, line: 153, type: !36)
!1032 = !DILocalVariable(name: "i", scope: !1033, file: !48, line: 171, type: !36)
!1033 = distinct !DILexicalBlock(scope: !1000, file: !48, line: 171, column: 5)
!1034 = !DILocalVariable(name: "partition", scope: !1035, file: !48, line: 172, type: !1017)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !48, line: 171, column: 46)
!1036 = distinct !DILexicalBlock(scope: !1033, file: !48, line: 171, column: 5)
!1037 = !DILocation(line: 0, scope: !1000)
!1038 = !DILocation(line: 153, column: 5, scope: !1000)
!1039 = !DILocation(line: 155, column: 18, scope: !1000)
!1040 = !DILocation(line: 156, column: 10, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1000, file: !48, line: 156, column: 9)
!1042 = !DILocation(line: 156, column: 9, scope: !1000)
!1043 = !DILocation(line: 157, column: 9, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !48, line: 157, column: 9)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !48, line: 157, column: 9)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !48, line: 157, column: 9)
!1047 = distinct !DILexicalBlock(scope: !1041, file: !48, line: 156, column: 22)
!1048 = !DILocation(line: 158, column: 9, scope: !1047)
!1049 = !DILocation(line: 162, column: 11, scope: !1000)
!1050 = !DILocation(line: 163, column: 13, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1000, file: !48, line: 163, column: 9)
!1052 = !DILocation(line: 163, column: 9, scope: !1000)
!1053 = !DILocation(line: 0, scope: !1033)
!1054 = !DILocation(line: 171, column: 23, scope: !1036)
!1055 = !DILocation(line: 171, column: 5, scope: !1033)
!1056 = !DILocation(line: 164, column: 9, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !48, line: 164, column: 9)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !48, line: 164, column: 9)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !48, line: 164, column: 9)
!1060 = distinct !DILexicalBlock(scope: !1051, file: !48, line: 163, column: 24)
!1061 = !DILocation(line: 165, column: 9, scope: !1060)
!1062 = !DILocation(line: 237, column: 5, scope: !1000)
!1063 = !DILocation(line: 240, column: 5, scope: !1000)
!1064 = !DILocation(line: 0, scope: !1035)
!1065 = !DILocation(line: 178, column: 28, scope: !1035)
!1066 = !{!1067, !578, i64 2}
!1067 = !{!"", !1068, i64 0, !578, i64 2, !578, i64 3, !970, i64 4, !578, i64 12, !577, i64 28}
!1068 = !{!"short", !578, i64 0}
!1069 = !DILocation(line: 178, column: 9, scope: !1035)
!1070 = !DILocation(line: 180, column: 32, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1035, file: !48, line: 178, column: 34)
!1072 = !{!1067, !578, i64 3}
!1073 = !DILocation(line: 180, column: 21, scope: !1071)
!1074 = !DILocation(line: 180, column: 13, scope: !1071)
!1075 = !DILocation(line: 182, column: 42, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1071, file: !48, line: 180, column: 41)
!1077 = !DILocation(line: 184, column: 17, scope: !1076)
!1078 = !DILocation(line: 186, column: 39, scope: !1076)
!1079 = !DILocation(line: 188, column: 17, scope: !1076)
!1080 = !DILocation(line: 191, column: 41, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1076, file: !48, line: 191, column: 21)
!1082 = !DILocation(line: 191, column: 67, scope: !1081)
!1083 = !DILocation(line: 191, column: 21, scope: !1076)
!1084 = !DILocation(line: 192, column: 48, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1081, file: !48, line: 191, column: 93)
!1086 = !DILocation(line: 192, column: 21, scope: !1085)
!1087 = !DILocation(line: 192, column: 86, scope: !1085)
!1088 = !DILocation(line: 193, column: 21, scope: !1085)
!1089 = !{!1090, !577, i64 152}
!1090 = !{!"", !970, i64 0, !970, i64 8, !970, i64 16, !578, i64 24, !577, i64 152, !577, i64 156}
!1091 = !DILocation(line: 195, column: 17, scope: !1085)
!1092 = !DILocation(line: 202, column: 32, scope: !1071)
!1093 = !DILocation(line: 202, column: 13, scope: !1071)
!1094 = !DILocation(line: 204, column: 43, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1071, file: !48, line: 202, column: 41)
!1096 = !DILocation(line: 206, column: 17, scope: !1095)
!1097 = !DILocation(line: 171, column: 42, scope: !1036)
!1098 = distinct !{!1098, !1055, !1099, !1100}
!1099 = !DILocation(line: 235, column: 5, scope: !1033)
!1100 = !{!"llvm.loop.mustprogress"}
!1101 = !DILocation(line: 241, column: 1, scope: !1000)
!1102 = distinct !DISubprogram(name: "bootloader_utility_get_selected_boot_partition", scope: !48, file: !48, line: 347, type: !1103, scopeLine: 348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1107)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!36, !1105}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1107 = !{!1108, !1109, !1119, !1120, !1123}
!1108 = !DILocalVariable(name: "bs", arg: 1, scope: !1102, file: !48, line: 347, type: !1105)
!1109 = !DILocalVariable(name: "otadata", scope: !1102, file: !48, line: 349, type: !1110)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 512, elements: !143)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_ota_select_entry_t", file: !16, line: 65, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 60, size: 256, elements: !1113)
!1113 = !{!1114, !1115, !1117, !1118}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ota_seq", scope: !1112, file: !16, line: 61, baseType: !39, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "seq_label", scope: !1112, file: !16, line: 62, baseType: !1116, size: 160, offset: 32)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !955)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ota_state", scope: !1112, file: !16, line: 63, baseType: !39, size: 32, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !1112, file: !16, line: 64, baseType: !39, size: 32, offset: 224)
!1119 = !DILocalVariable(name: "boot_index", scope: !1102, file: !48, line: 350, type: !36)
!1120 = !DILocalVariable(name: "active_otadata", scope: !1121, file: !48, line: 395, type: !36)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !48, line: 394, column: 12)
!1122 = distinct !DILexicalBlock(scope: !1102, file: !48, line: 376, column: 9)
!1123 = !DILocalVariable(name: "ota_seq", scope: !1124, file: !48, line: 411, type: !39)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !48, line: 409, column: 35)
!1125 = distinct !DILexicalBlock(scope: !1121, file: !48, line: 409, column: 13)
!1126 = !DILocation(line: 0, scope: !1102)
!1127 = !DILocation(line: 349, column: 5, scope: !1102)
!1128 = !DILocation(line: 349, column: 28, scope: !1102)
!1129 = !DILocation(line: 352, column: 22, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1102, file: !48, line: 352, column: 9)
!1131 = !{!1090, !577, i64 0}
!1132 = !DILocation(line: 352, column: 29, scope: !1130)
!1133 = !DILocation(line: 352, column: 9, scope: !1102)
!1134 = !DILocation(line: 356, column: 9, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1102, file: !48, line: 356, column: 9)
!1136 = !DILocalVariable(name: "ota_info", arg: 1, scope: !1137, file: !48, line: 96, type: !929)
!1137 = distinct !DISubprogram(name: "read_otadata", scope: !48, file: !48, line: 96, type: !1138, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1141)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!927, !929, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 32)
!1141 = !{!1136, !1142, !1143}
!1142 = !DILocalVariable(name: "two_otadata", arg: 2, scope: !1137, file: !48, line: 96, type: !1140)
!1143 = !DILocalVariable(name: "ota_select_map", scope: !1137, file: !48, line: 98, type: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 32)
!1145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1146 = !DILocation(line: 0, scope: !1137, inlinedAt: !1147)
!1147 = distinct !DILocation(line: 356, column: 9, scope: !1135)
!1148 = !DILocation(line: 99, column: 19, scope: !1149, inlinedAt: !1147)
!1149 = distinct !DILexicalBlock(scope: !1137, file: !48, line: 99, column: 9)
!1150 = !DILocation(line: 99, column: 26, scope: !1149, inlinedAt: !1147)
!1151 = !DILocation(line: 99, column: 9, scope: !1137, inlinedAt: !1147)
!1152 = !DILocation(line: 104, column: 19, scope: !1153, inlinedAt: !1147)
!1153 = distinct !DILexicalBlock(scope: !1137, file: !48, line: 104, column: 9)
!1154 = !{!970, !577, i64 4}
!1155 = !DILocation(line: 104, column: 24, scope: !1153, inlinedAt: !1147)
!1156 = !DILocation(line: 104, column: 9, scope: !1137, inlinedAt: !1147)
!1157 = !DILocation(line: 105, column: 9, scope: !1158, inlinedAt: !1147)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !48, line: 105, column: 9)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !48, line: 105, column: 9)
!1160 = distinct !DILexicalBlock(scope: !1161, file: !48, line: 105, column: 9)
!1161 = distinct !DILexicalBlock(scope: !1153, file: !48, line: 104, column: 44)
!1162 = !DILocation(line: 106, column: 9, scope: !1161, inlinedAt: !1147)
!1163 = !DILocation(line: 110, column: 22, scope: !1137, inlinedAt: !1147)
!1164 = !DILocation(line: 111, column: 10, scope: !1165, inlinedAt: !1147)
!1165 = distinct !DILexicalBlock(scope: !1137, file: !48, line: 111, column: 9)
!1166 = !DILocation(line: 111, column: 9, scope: !1137, inlinedAt: !1147)
!1167 = !DILocation(line: 112, column: 9, scope: !1168, inlinedAt: !1147)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !48, line: 112, column: 9)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !48, line: 112, column: 9)
!1170 = distinct !DILexicalBlock(scope: !1171, file: !48, line: 112, column: 9)
!1171 = distinct !DILexicalBlock(scope: !1165, file: !48, line: 111, column: 26)
!1172 = !DILocation(line: 113, column: 9, scope: !1171, inlinedAt: !1147)
!1173 = !DILocation(line: 116, column: 5, scope: !1137, inlinedAt: !1147)
!1174 = !DILocation(line: 117, column: 13, scope: !1137, inlinedAt: !1147)
!1175 = !DILocation(line: 117, column: 55, scope: !1137, inlinedAt: !1147)
!1176 = !DILocation(line: 117, column: 5, scope: !1137, inlinedAt: !1147)
!1177 = !DILocation(line: 118, column: 5, scope: !1137, inlinedAt: !1147)
!1178 = !DILocation(line: 359, column: 30, scope: !1102)
!1179 = !DILocation(line: 376, column: 10, scope: !1122)
!1180 = !DILocation(line: 376, column: 60, scope: !1122)
!1181 = !DILocation(line: 377, column: 13, scope: !1122)
!1182 = !DILocation(line: 377, column: 64, scope: !1122)
!1183 = !DILocation(line: 378, column: 17, scope: !1122)
!1184 = !DILocation(line: 378, column: 27, scope: !1122)
!1185 = !DILocation(line: 376, column: 9, scope: !1102)
!1186 = !DILocation(line: 380, column: 25, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1188, file: !48, line: 380, column: 13)
!1188 = distinct !DILexicalBlock(scope: !1122, file: !48, line: 378, column: 33)
!1189 = !{!1090, !577, i64 8}
!1190 = !DILocation(line: 380, column: 32, scope: !1187)
!1191 = !DILocation(line: 380, column: 13, scope: !1188)
!1192 = !DILocation(line: 387, column: 29, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !48, line: 387, column: 17)
