; ModuleID = 'build//system/ulp_riscv/gpio_interrupt/bootloader/bootloader.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-i8:8:32-i16:16:32-i64:64-n32"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (i32)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque
%struct._mprec = type { %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint** }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%struct._rand48 = type { [3 x i16], [3 x i16], i16, i64 }
%struct.__tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args* }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, %struct._reent*, i8*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i32, %struct.__lock*, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct.__lock = type { [23 x i32] }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!173 = !DILocalVariable(name: "digest_words", scope: !163, file: !155, line: 110, type: !133)
!174 = !DILocalVariable(name: "sha_text_reg", scope: !163, file: !155, line: 111, type: !133)
!175 = !DILocalVariable(name: "i", scope: !176, file: !155, line: 112, type: !157)
!176 = distinct !DILexicalBlock(scope: !163, file: !155, line: 112, column: 5)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 512, elements: !179)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!179 = !{!180}
!180 = !DISubrange(count: 64)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!182 = distinct !DIGlobalVariable(name: "DIGEST_WORDS", scope: !147, file: !155, line: 21, type: !156, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!184 = distinct !DIGlobalVariable(name: "mapped", scope: !185, file: !199, line: 152, type: !84, isLocal: true, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !187, retainedTypes: !194, globals: !195, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!187 = !{!188}
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 43, baseType: !17, size: 32, elements: !190)
!189 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_spiflash.h", directory: "/home/mjshen/RTOSExploration/esp")
!190 = !{!191, !192, !193}
!191 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_OK", value: 0)
!192 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_ERR", value: 1)
!193 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_TIMEOUT", value: 2)
!194 = !{!35, !134, !133}
!195 = !{!196, !197, !200}
!196 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "TAG", scope: !185, file: !199, line: 124, type: !81, isLocal: true, isDefinition: true)
!199 = !DIFile(filename: "esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp")
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "current_read_mapping", scope: !185, file: !199, line: 155, type: !39, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "bootloader_image_hdr", scope: !204, file: !233, line: 25, type: !234, isLocal: false, isDefinition: true, align: 32)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !226, globals: !230, splitDebugInlining: false, nameTableKind: None)
!205 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!206 = !{!127, !5, !207, !213, !219}
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 21, baseType: !17, size: 32, elements: !209)
!208 = !DIFile(filename: "esp-idf/components/hal/include/hal/wdt_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!209 = !{!210, !211, !212}
!210 = !DIEnumerator(name: "WDT_RWDT", value: 0)
!211 = !DIEnumerator(name: "WDT_MWDT0", value: 1)
!212 = !DIEnumerator(name: "WDT_MWDT1", value: 2)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 30, baseType: !17, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218}
!215 = !DIEnumerator(name: "WDT_STAGE0", value: 0)
!216 = !DIEnumerator(name: "WDT_STAGE1", value: 1)
!217 = !DIEnumerator(name: "WDT_STAGE2", value: 2)
!218 = !DIEnumerator(name: "WDT_STAGE3", value: 3)
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 43, baseType: !17, size: 32, elements: !220)
!220 = !{!221, !222, !223, !224, !225}
!221 = !DIEnumerator(name: "WDT_STAGE_ACTION_OFF", value: 0)
!222 = !DIEnumerator(name: "WDT_STAGE_ACTION_INT", value: 1)
!223 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_CPU", value: 2)
!224 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_SYSTEM", value: 3)
!225 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_RTC", value: 4)
!226 = !{!39, !227}
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !40, line: 60, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !42, line: 105, baseType: !229)
!229 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!230 = !{!202, !231}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "TAG", scope: !204, file: !233, line: 23, type: !81, isLocal: true, isDefinition: true)
!233 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_image_header_t", file: !6, line: 93, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 74, size: 192, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !248, !250, !251, !255}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !235, file: !6, line: 75, baseType: !44, size: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !235, file: !6, line: 76, baseType: !44, size: 8, offset: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "spi_mode", scope: !235, file: !6, line: 77, baseType: !44, size: 8, offset: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "spi_speed", scope: !235, file: !6, line: 78, baseType: !44, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 24)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "spi_size", scope: !235, file: !6, line: 79, baseType: !44, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 24)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "entry_addr", scope: !235, file: !6, line: 80, baseType: !39, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "wp_pin", scope: !235, file: !6, line: 81, baseType: !44, size: 8, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "spi_pin_drv", scope: !235, file: !6, line: 84, baseType: !245, size: 24, offset: 72)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 3)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "chip_id", scope: !235, file: !6, line: 85, baseType: !249, size: 16, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_chip_id_t", file: !6, line: 26, baseType: !5)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "min_chip_rev", scope: !235, file: !6, line: 86, baseType: !44, size: 8, offset: 112)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !235, file: !6, line: 87, baseType: !252, size: 64, offset: 120)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "hash_appended", scope: !235, file: !6, line: 88, baseType: !44, size: 8, offset: 184)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "intr_desc_table", scope: !258, file: !282, line: 164, type: !283, isLocal: true, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !260, retainedTypes: !279, globals: !281, splitDebugInlining: false, nameTableKind: None)
!259 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!260 = !{!261, !267, !274}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 37, baseType: !17, size: 32, elements: !263)
!262 = !DIFile(filename: "esp-idf/components/esp_hw_support/include/esp_cpu.h", directory: "/home/mjshen/RTOSExploration/esp")
!263 = !{!264, !265, !266}
!264 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_LEVEL", value: 0)
!265 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_EDGE", value: 1)
!266 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_NA", value: 2)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !268, line: 23, baseType: !17, size: 32, elements: !269)
!268 = !DIFile(filename: "esp-idf/components/hal/include/hal/mpu_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!269 = !{!270, !271, !272, !273}
!270 = !DIEnumerator(name: "MPU_REGION_ILLEGAL", value: 0)
!271 = !DIEnumerator(name: "MPU_REGION_RW", value: 1)
!272 = !DIEnumerator(name: "MPU_REGION_X", value: 2)
!273 = !DIEnumerator(name: "MPU_REGION_RWX", value: 3)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 70, baseType: !17, size: 32, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_LOAD", value: 0)
!277 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_STORE", value: 1)
!278 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_ACCESS", value: 2)
!279 = !{!39, !37, !280}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !42, line: 184, baseType: !17)
!281 = !{!256}
!282 = !DIFile(filename: "esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp")
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 4096, elements: !292)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "intr_desc_t", file: !282, line: 160, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !282, line: 156, size: 128, elements: !287)
!287 = !{!288, !289, !291}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !286, file: !282, line: 157, baseType: !36, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !282, line: 158, baseType: !290, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_intr_type_t", file: !262, line: 41, baseType: !261)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !286, file: !282, line: 159, baseType: !142, size: 64, offset: 64)
!292 = !{!293}
!293 = !DISubrange(count: 32)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "s_cur_pll_freq", scope: !296, file: !340, line: 35, type: !280, isLocal: true, isDefinition: true)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !332, globals: !337, splitDebugInlining: false, nameTableKind: None)
!297 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!298 = !{!299, !305, !313, !320, !326}
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !300, line: 77, baseType: !17, size: 32, elements: !301)
!300 = !DIFile(filename: "esp-idf/components/hal/esp32/include/hal/clk_tree_ll.h", directory: "/home/mjshen/RTOSExploration/esp")
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_CRYSTAL", value: 0)
!303 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_EXTERNAL", value: 1)
!304 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_BOOTSTRAP", value: 2)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 64, baseType: !17, size: 32, elements: !307)
!306 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/clk_tree_defs.h", directory: "/home/mjshen/RTOSExploration/esp")
!307 = !{!308, !309, !310, !311, !312}
!308 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_XTAL", value: 0)
!309 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_PLL", value: 1)
!310 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_RC_FAST", value: 2)
!311 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_APLL", value: 3)
!312 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_INVALID", value: 4)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 82, baseType: !17, size: 32, elements: !315)
!314 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/rtc.h", directory: "/home/mjshen/RTOSExploration/esp")
!315 = !{!316, !317, !318, !319}
!316 = !DIEnumerator(name: "RTC_XTAL_FREQ_AUTO", value: 0)
!317 = !DIEnumerator(name: "RTC_XTAL_FREQ_40M", value: 40)
!318 = !DIEnumerator(name: "RTC_XTAL_FREQ_26M", value: 26)
!319 = !DIEnumerator(name: "RTC_XTAL_FREQ_24M", value: 24)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 76, baseType: !17, size: 32, elements: !321)
!321 = !{!322, !323, !324, !325}
!322 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_SLOW", value: 0)
!323 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_XTAL32K", value: 1)
!324 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_FAST_D256", value: 2)
!325 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_INVALID", value: 3)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 87, baseType: !17, size: 32, elements: !327)
!327 = !{!328, !329, !330, !331}
!328 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_D4", value: 0)
!329 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_DIV", value: 0)
!330 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_RC_FAST", value: 1)
!331 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_INVALID", value: 2)
!332 = !{!280, !333, !36, !335, !336}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !280)
!335 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtc_xtal_freq_t", file: !314, line: 87, baseType: !313)
!337 = !{!294, !338}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "TAG", scope: !296, file: !340, line: 37, type: !81, isLocal: true, isDefinition: true)
!340 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp")
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!342 = distinct !DIGlobalVariable(name: "s_lock", scope: !343, file: !349, line: 12, type: !36, isLocal: true, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !345, globals: !347, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_cycle_count_t", file: !262, line: 32, baseType: !39)
!347 = !{!348}
!348 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!349 = !DIFile(filename: "esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp")
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !352, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/soc/esp32/./dport_access.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!352 = !{!73}
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !355, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!355 = !{!134, !84}
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !358, globals: !359, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader/subproject/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!358 = !{!108}
!359 = !{!360}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "TAG", scope: !356, file: !362, line: 14, type: !81, isLocal: true, isDefinition: true)
!362 = !DIFile(filename: "esp-idf/components/bootloader/subproject/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp")
!363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !364, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !365, retainedTypes: !386, globals: !387, splitDebugInlining: false, nameTableKind: None)
!364 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!365 = !{!366, !380}
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !367, line: 19, baseType: !17, size: 32, elements: !368)
!367 = !DIFile(filename: "esp-idf/components/efuse/esp32/include/esp_efuse_chip.h", directory: "/home/mjshen/RTOSExploration/esp")
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!369 = !DIEnumerator(name: "EFUSE_BLK0", value: 0)
!370 = !DIEnumerator(name: "EFUSE_BLK1", value: 1)
!371 = !DIEnumerator(name: "EFUSE_BLK_KEY0", value: 1)
!372 = !DIEnumerator(name: "EFUSE_BLK_ENCRYPT_FLASH", value: 1)
!373 = !DIEnumerator(name: "EFUSE_BLK2", value: 2)
!374 = !DIEnumerator(name: "EFUSE_BLK_KEY1", value: 2)
!375 = !DIEnumerator(name: "EFUSE_BLK_SECURE_BOOT", value: 2)
!376 = !DIEnumerator(name: "EFUSE_BLK3", value: 3)
!377 = !DIEnumerator(name: "EFUSE_BLK_KEY2", value: 3)
!378 = !DIEnumerator(name: "EFUSE_BLK_KEY_MAX", value: 4)
!379 = !DIEnumerator(name: "EFUSE_BLK_MAX", value: 4)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !381, line: 23, baseType: !17, size: 32, elements: !382)
!381 = !DIFile(filename: "esp-idf/components/bootloader_support/include/esp_flash_encrypt.h", directory: "/home/mjshen/RTOSExploration/esp")
!382 = !{!383, !384, !385}
!383 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DISABLED", value: 0)
!384 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DEVELOPMENT", value: 1)
!385 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_RELEASE", value: 2)
!386 = !{!37}
!387 = !{!388}
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "TAG", scope: !363, file: !390, line: 23, type: !81, isLocal: true, isDefinition: true)
!390 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp")
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !393, globals: !395, splitDebugInlining: false, nameTableKind: None)
!392 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!395 = !{!396}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "TAG", scope: !391, file: !398, line: 12, type: !81, isLocal: true, isDefinition: true)
!398 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp")
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_soc.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!405 = !{!5, !188, !108}
!406 = !{!39, !37}
!407 = !{!408}
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "TAG", scope: !403, file: !410, line: 40, type: !81, isLocal: true, isDefinition: true)
!410 = !DIFile(filename: "esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp")
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !413, retainedTypes: !419, globals: !421, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!413 = !{!414, !5}
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 16, baseType: !36, size: 32, elements: !415)
!415 = !{!416, !417, !418}
!416 = !DIEnumerator(name: "GPIO_LONG_HOLD", value: 1)
!417 = !DIEnumerator(name: "GPIO_SHORT_HOLD", value: -1)
!418 = !DIEnumerator(name: "GPIO_NOT_HOLD", value: 0)
!419 = !{!39, !37, !35, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!421 = !{!422}
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "TAG", scope: !411, file: !424, line: 30, type: !81, isLocal: true, isDefinition: true)
!424 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp")
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !428, globals: !429, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!427 = !{!15, !5, !127}
!428 = !{!43, !35}
!429 = !{!430}
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "TAG", scope: !425, file: !432, line: 29, type: !81, isLocal: true, isDefinition: true)
!432 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp")
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !435, retainedTypes: !436, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_clock_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!435 = !{!108, !313, !326, !320}
!436 = !{!333}
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_mem.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !441, splitDebugInlining: false, nameTableKind: None)
!440 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!441 = !{!43, !35, !37, !346}
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !444, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!444 = !{!280, !333}
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, retainedTypes: !406, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash_config_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!447 = !{!5, !188, !448}
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 47, baseType: !17, size: 32, elements: !449)
!449 = !{!450, !451, !452, !453}
!450 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_2", value: 0)
!451 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_3", value: 1)
!452 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_4", value: 2)
!453 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_1", value: 15)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !386, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_efuse.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !460, retainedTypes: !466, globals: !467, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!460 = !{!313, !326, !320, !305, !461}
!461 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 102, baseType: !17, size: 32, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIEnumerator(name: "RTC_CAL_RTC_MUX", value: 0)
!464 = !DIEnumerator(name: "RTC_CAL_8MD256", value: 1)
!465 = !DIEnumerator(name: "RTC_CAL_32K_XTAL", value: 2)
!466 = !{!37, !227, !39, !346}
!467 = !{!468}
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "TAG", scope: !458, file: !470, line: 31, type: !81, isLocal: true, isDefinition: true)
!470 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !444, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !475, retainedTypes: !476, globals: !478, splitDebugInlining: false, nameTableKind: None)
!474 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!475 = !{!461, !313, !320}
!476 = !{!280, !477, !333}
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !42, line: 202, baseType: !229)
!478 = !{!479}
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "TAG", scope: !473, file: !481, line: 14, type: !81, isLocal: true, isDefinition: true)
!481 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp")
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!483 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_sys.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!485 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_uart.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !488, retainedTypes: !503, splitDebugInlining: false, nameTableKind: None)
!487 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_spiflash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!488 = !{!188, !489}
!489 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 19, baseType: !17, size: 32, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!491 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QIO_MODE", value: 0)
!492 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QOUT_MODE", value: 1)
!493 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DIO_MODE", value: 2)
!494 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DOUT_MODE", value: 3)
!495 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_FASTRD_MODE", value: 4)
!496 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_SLOWRD_MODE", value: 5)
!497 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_STR_MODE", value: 6)
!498 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_DTR_MODE", value: 7)
!499 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OOUT_MODE", value: 8)
!500 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_STR_MODE", value: 9)
!501 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_DTR_MODE", value: 10)
!502 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QPI_MODE", value: 11)
!503 = !{!333, !280, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !507, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mpu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!507 = !{!267}
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !510, splitDebugInlining: false, nameTableKind: None)
!509 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!510 = !{!511, !512, !513, !73}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !76, line: 207, baseType: !7)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !352, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/esp32/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !406, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mmu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !520, splitDebugInlining: false, nameTableKind: None)
!519 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/wdt_hal_iram.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/ulp_riscv/gpio_interrupt/bootloader")
!520 = !{!207, !213, !521, !219}
!521 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 57, baseType: !17, size: 32, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530}
!523 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_100ns", value: 0)
!524 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_200ns", value: 1)
!525 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_300ns", value: 2)
!526 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_400ns", value: 3)
!527 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_500ns", value: 4)
!528 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_800ns", value: 5)
!529 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_1_6us", value: 6)
!530 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_3_2us", value: 7)
!531 = !{!"clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)"}
!532 = !{i32 7, !"Dwarf Version", i32 4}
!533 = !{i32 2, !"Debug Info Version", i32 3}
!534 = !{i32 1, !"wchar_size", i32 1}
!535 = distinct !DISubprogram(name: "esp_dport_access_reg_read", scope: !536, file: !536, line: 13, type: !537, scopeLine: 14, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !539)
!536 = !DIFile(filename: "esp-idf/components/soc/esp32/dport_access.c", directory: "/home/mjshen/RTOSExploration/esp")
!537 = !DISubroutineType(types: !538)
!538 = !{!75, !75}
!539 = !{!540}
!540 = !DILocalVariable(name: "reg", arg: 1, scope: !535, file: !536, line: 13, type: !75)
!541 = !DILocation(line: 0, scope: !535)
!542 = !DILocation(line: 16, column: 12, scope: !535)
!543 = !{!544, !544, i64 0}
!544 = !{!"int", !545, i64 0}
!545 = !{!"omnipotent char", !546, i64 0}
!546 = !{!"Simple C/C++ TBAA"}
!547 = !DILocation(line: 16, column: 5, scope: !535)
!548 = distinct !DISubprogram(name: "esp_dport_access_sequence_reg_read", scope: !536, file: !536, line: 35, type: !537, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !549)
!549 = !{!550}
!550 = !DILocalVariable(name: "reg", arg: 1, scope: !548, file: !536, line: 35, type: !75)
!551 = !DILocation(line: 0, scope: !548)
!552 = !DILocation(line: 38, column: 12, scope: !548)
!553 = !DILocation(line: 38, column: 5, scope: !548)
!554 = distinct !DISubprogram(name: "__assert_func", scope: !555, file: !555, line: 13, type: !556, scopeLine: 14, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !558)
!555 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp")
!556 = !DISubroutineType(types: !557)
!557 = !{null, !81, !36, !81, !81}
!558 = !{!559, !560, !561, !562}
!559 = !DILocalVariable(name: "file", arg: 1, scope: !554, file: !555, line: 13, type: !81)
!560 = !DILocalVariable(name: "line", arg: 2, scope: !554, file: !555, line: 13, type: !36)
!561 = !DILocalVariable(name: "func", arg: 3, scope: !554, file: !555, line: 13, type: !81)
!562 = !DILocalVariable(name: "expr", arg: 4, scope: !554, file: !555, line: 13, type: !81)
!563 = !DILocation(line: 0, scope: !554)
!564 = !DILocation(line: 17, column: 5, scope: !554)
!565 = !DILocation(line: 20, column: 5, scope: !554)
!566 = distinct !{!566, !565, !567}
!567 = !DILocation(line: 21, column: 5, scope: !554)
!568 = !DISubprogram(name: "esp_rom_printf", scope: !569, file: !569, line: 24, type: !570, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !572)
!569 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_sys.h", directory: "/home/mjshen/RTOSExploration/esp")
!570 = !DISubroutineType(types: !571)
!571 = !{!36, !81, null}
!572 = !{}
!573 = distinct !DISubprogram(name: "abort", scope: !555, file: !555, line: 24, type: !71, scopeLine: 25, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !572)
!574 = !DILocation(line: 27, column: 69, scope: !573)
!575 = !DILocation(line: 27, column: 59, scope: !573)
!576 = !DILocation(line: 27, column: 97, scope: !573)
!577 = !DILocation(line: 27, column: 5, scope: !573)
!578 = !DILocalVariable(name: "dcr", scope: !579, file: !580, line: 189, type: !280)
!579 = distinct !DISubprogram(name: "xt_utils_dbgr_is_attached", scope: !580, file: !580, line: 187, type: !581, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !583)
!580 = !DIFile(filename: "esp-idf/components/xtensa/include/xt_utils.h", directory: "/home/mjshen/RTOSExploration/esp")
!581 = !DISubroutineType(types: !582)
!582 = !{!84}
!583 = !{!578, !584}
!584 = !DILocalVariable(name: "reg", scope: !579, file: !580, line: 190, type: !280)
!585 = !DILocation(line: 0, scope: !579, inlinedAt: !586)
!586 = distinct !DILocation(line: 497, column: 12, scope: !587, inlinedAt: !588)
!587 = distinct !DISubprogram(name: "esp_cpu_dbgr_is_attached", scope: !262, file: !262, line: 494, type: !581, scopeLine: 495, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !572)
!588 = distinct !DILocation(line: 29, column: 9, scope: !589)
!589 = distinct !DILexicalBlock(scope: !573, file: !555, line: 29, column: 9)
!590 = !DILocation(line: 191, column: 5, scope: !579, inlinedAt: !586)
!591 = !{i64 2148037441}
!592 = !DILocation(line: 192, column: 23, scope: !579, inlinedAt: !586)
!593 = !DILocation(line: 192, column: 12, scope: !579, inlinedAt: !586)
!594 = !DILocation(line: 29, column: 9, scope: !573)
!595 = !DILocation(line: 197, column: 5, scope: !596, inlinedAt: !597)
!596 = distinct !DISubprogram(name: "xt_utils_dbgr_break", scope: !580, file: !580, line: 195, type: !71, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !572)
!597 = distinct !DILocation(line: 509, column: 5, scope: !598, inlinedAt: !599)
!598 = distinct !DISubprogram(name: "esp_cpu_dbgr_break", scope: !262, file: !262, line: 506, type: !71, scopeLine: 507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !572)
!599 = distinct !DILocation(line: 30, column: 9, scope: !600)
!600 = distinct !DILexicalBlock(scope: !589, file: !555, line: 29, column: 37)
!601 = !{i64 513294}
!602 = !DILocation(line: 31, column: 5, scope: !600)
!603 = !DILocation(line: 32, column: 5, scope: !573)
!604 = distinct !{!604, !603, !605}
!605 = !DILocation(line: 33, column: 5, scope: !573)
!606 = distinct !DISubprogram(name: "call_start_cpu0", scope: !362, file: !362, line: 24, type: !71, scopeLine: 25, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !607)
!607 = !{!608, !627}
!608 = !DILocalVariable(name: "bs", scope: !606, file: !362, line: 50, type: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !610, line: 32, baseType: !611)
!610 = !DIFile(filename: "esp-idf/components/bootloader_support/private_include/bootloader_config.h", directory: "/home/mjshen/RTOSExploration/esp")
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 25, size: 1280, elements: !612)
!612 = !{!613, !619, !620, !621, !625, !626}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !611, file: !610, line: 26, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !16, line: 71, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 68, size: 64, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !615, file: !16, line: 69, baseType: !39, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !615, file: !16, line: 70, baseType: !39, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !611, file: !610, line: 27, baseType: !614, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !611, file: !610, line: 28, baseType: !614, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !611, file: !610, line: 29, baseType: !622, size: 1024, offset: 192)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 1024, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 16)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !611, file: !610, line: 30, baseType: !39, size: 32, offset: 1216)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !611, file: !610, line: 31, baseType: !39, size: 32, offset: 1248)
!627 = !DILocalVariable(name: "boot_index", scope: !606, file: !362, line: 51, type: !36)
!628 = !DILocation(line: 27, column: 9, scope: !606)
!629 = !DILocation(line: 28, column: 9, scope: !630)
!630 = distinct !DILexicalBlock(scope: !631, file: !362, line: 27, column: 33)
!631 = distinct !DILexicalBlock(scope: !606, file: !362, line: 27, column: 9)
!632 = !DILocation(line: 29, column: 5, scope: !630)
!633 = !DILocation(line: 32, column: 9, scope: !634)
!634 = distinct !DILexicalBlock(scope: !606, file: !362, line: 32, column: 9)
!635 = !DILocation(line: 32, column: 27, scope: !634)
!636 = !DILocation(line: 32, column: 9, scope: !606)
!637 = !DILocation(line: 33, column: 9, scope: !638)
!638 = distinct !DILexicalBlock(scope: !634, file: !362, line: 32, column: 38)
!639 = !DILocation(line: 37, column: 9, scope: !606)
!640 = !DILocation(line: 38, column: 9, scope: !641)
!641 = distinct !DILexicalBlock(scope: !642, file: !362, line: 37, column: 32)
!642 = distinct !DILexicalBlock(scope: !606, file: !362, line: 37, column: 9)
!643 = !DILocation(line: 39, column: 5, scope: !641)
!644 = !DILocation(line: 50, column: 5, scope: !606)
!645 = !DILocation(line: 50, column: 24, scope: !606)
!646 = !DILocation(line: 51, column: 22, scope: !606)
!647 = !DILocalVariable(name: "bs", arg: 1, scope: !648, file: !362, line: 61, type: !651)
!648 = distinct !DISubprogram(name: "select_partition_number", scope: !362, file: !362, line: 61, type: !649, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !652)
!649 = !DISubroutineType(types: !650)
!650 = !{!36, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!652 = !{!647}
!653 = !DILocation(line: 0, scope: !648, inlinedAt: !654)
!654 = distinct !DILocation(line: 51, column: 22, scope: !606)
!655 = !DILocation(line: 64, column: 10, scope: !656, inlinedAt: !654)
!656 = distinct !DILexicalBlock(scope: !648, file: !362, line: 64, column: 9)
!657 = !DILocation(line: 64, column: 9, scope: !648, inlinedAt: !654)
!658 = !DILocation(line: 65, column: 9, scope: !659, inlinedAt: !654)
!659 = distinct !DILexicalBlock(scope: !660, file: !362, line: 65, column: 9)
!660 = distinct !DILexicalBlock(scope: !661, file: !362, line: 65, column: 9)
!661 = distinct !DILexicalBlock(scope: !662, file: !362, line: 65, column: 9)
!662 = distinct !DILexicalBlock(scope: !656, file: !362, line: 64, column: 55)
!663 = !DILocation(line: 66, column: 9, scope: !662, inlinedAt: !654)
!664 = !DILocalVariable(name: "bs", arg: 1, scope: !665, file: !362, line: 77, type: !668)
!665 = distinct !DISubprogram(name: "selected_boot_partition", scope: !362, file: !362, line: 77, type: !666, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !670)
!666 = !DISubroutineType(types: !667)
!667 = !{!36, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!670 = !{!664, !671}
!671 = !DILocalVariable(name: "boot_index", scope: !665, file: !362, line: 79, type: !36)
!672 = !DILocation(line: 0, scope: !665, inlinedAt: !673)
!673 = distinct !DILocation(line: 70, column: 12, scope: !648, inlinedAt: !654)
!674 = !DILocation(line: 79, column: 22, scope: !665, inlinedAt: !673)
!675 = !DILocation(line: 80, column: 20, scope: !676, inlinedAt: !673)
!676 = distinct !DILexicalBlock(scope: !665, file: !362, line: 80, column: 9)
!677 = !DILocation(line: 80, column: 9, scope: !665, inlinedAt: !673)
!678 = !DILocation(line: 0, scope: !606)
!679 = !DILocation(line: 53, column: 9, scope: !680)
!680 = distinct !DILexicalBlock(scope: !681, file: !362, line: 52, column: 38)
!681 = distinct !DILexicalBlock(scope: !606, file: !362, line: 52, column: 9)
!682 = !DILocation(line: 83, column: 9, scope: !683, inlinedAt: !673)
!683 = distinct !DILexicalBlock(scope: !665, file: !362, line: 83, column: 9)
!684 = !DILocation(line: 57, column: 5, scope: !606)
!685 = !DISubprogram(name: "bootloader_before_init", scope: !686, file: !686, line: 30, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !572)
!686 = !DIFile(filename: "esp-idf/components/bootloader/subproject/main/bootloader_hooks.h", directory: "/home/mjshen/RTOSExploration/esp")
!687 = !DISubprogram(name: "bootloader_after_init", scope: !686, file: !686, line: 36, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !572)
!688 = !DISubprogram(name: "esp_rom_get_reset_reason", scope: !569, file: !569, line: 53, type: !689, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !572)
!689 = !DISubroutineType(types: !690)
!690 = !{!691, !36}
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "soc_reset_reason_t", file: !109, line: 54, baseType: !108)
!692 = distinct !DISubprogram(name: "__getreent", scope: !362, file: !362, line: 130, type: !693, scopeLine: 131, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !572)
!693 = !DISubroutineType(types: !694)
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !697, line: 377, size: 1920, elements: !698)
!697 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/reent.h", directory: "/home/mjshen/RTOSExploration/esp")
!698 = !{!699, !700, !778, !779, !780, !781, !782, !783, !784, !788, !809, !813, !814, !815, !816, !825, !838, !839, !844, !861, !862, !869, !870, !886}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !696, file: !697, line: 381, baseType: !36, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !696, file: !697, line: 386, baseType: !701, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !697, line: 292, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !697, line: 186, size: 832, elements: !704)
!704 = !{!705, !706, !707, !708, !710, !711, !716, !717, !718, !719, !723, !727, !733, !737, !738, !739, !740, !742, !746, !747, !748, !750, !762, !777}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !703, file: !697, line: 187, baseType: !394, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !703, file: !697, line: 188, baseType: !36, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !703, file: !697, line: 189, baseType: !36, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !703, file: !697, line: 190, baseType: !709, size: 16, offset: 96)
!709 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !703, file: !697, line: 191, baseType: !709, size: 16, offset: 112)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !703, file: !697, line: 192, baseType: !712, size: 64, offset: 128)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !697, line: 122, size: 64, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !712, file: !697, line: 123, baseType: !394, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !712, file: !697, line: 124, baseType: !36, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !703, file: !697, line: 193, baseType: !36, size: 32, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !703, file: !697, line: 196, baseType: !695, size: 32, offset: 224)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !703, file: !697, line: 200, baseType: !35, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !703, file: !697, line: 202, baseType: !720, size: 32, offset: 288)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!721 = !DISubroutineType(types: !722)
!722 = !{!36, !695, !35, !420, !36}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !703, file: !697, line: 204, baseType: !724, size: 32, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DISubroutineType(types: !726)
!726 = !{!36, !695, !35, !81, !36}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !703, file: !697, line: 207, baseType: !728, size: 32, offset: 352)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DISubroutineType(types: !730)
!730 = !{!731, !695, !35, !731, !36}
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !160, line: 116, baseType: !732)
!732 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !703, file: !697, line: 208, baseType: !734, size: 32, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DISubroutineType(types: !736)
!736 = !{!36, !695, !35}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !703, file: !697, line: 211, baseType: !712, size: 64, offset: 416)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !703, file: !697, line: 212, baseType: !394, size: 32, offset: 480)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !703, file: !697, line: 213, baseType: !36, size: 32, offset: 512)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !703, file: !697, line: 216, baseType: !741, size: 24, offset: 544)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 24, elements: !246)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !703, file: !697, line: 217, baseType: !743, size: 8, offset: 568)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 1)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !703, file: !697, line: 220, baseType: !712, size: 64, offset: 576)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !703, file: !697, line: 223, baseType: !36, size: 32, offset: 640)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !703, file: !697, line: 224, baseType: !749, size: 32, offset: 672)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !160, line: 46, baseType: !732)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !703, file: !697, line: 231, baseType: !751, size: 32, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !697, line: 35, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !753, line: 34, baseType: !754)
!753 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !756, line: 23, size: 736, elements: !757)
!756 = !DIFile(filename: "esp-idf/components/newlib/platform_include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !755, file: !756, line: 24, baseType: !759, size: 736)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 736, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 23)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !703, file: !697, line: 233, baseType: !763, size: 64, offset: 736)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !160, line: 170, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 162, size: 64, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !764, file: !160, line: 164, baseType: !36, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !764, file: !160, line: 169, baseType: !768, size: 32, offset: 32)
!768 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !764, file: !160, line: 165, size: 32, elements: !769)
!769 = !{!770, !773}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !768, file: !160, line: 167, baseType: !771, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !772, line: 116, baseType: !17)
!772 = !DIFile(filename: "xtensa-esp32-elf-clang/lib/clang/14.0.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/esp")
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !768, file: !160, line: 168, baseType: !774, size: 32)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 4)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !703, file: !697, line: 234, baseType: !36, size: 32, offset: 800)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !696, file: !697, line: 386, baseType: !701, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !696, file: !697, line: 386, baseType: !701, size: 32, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !696, file: !697, line: 388, baseType: !36, size: 32, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !696, file: !697, line: 390, baseType: !420, size: 32, offset: 160)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !696, file: !697, line: 392, baseType: !36, size: 32, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !696, file: !697, line: 394, baseType: !36, size: 32, offset: 224)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !696, file: !697, line: 395, baseType: !785, size: 32, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !787, line: 9, flags: DIFlagFwdDecl)
!787 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/_locale.h", directory: "/home/mjshen/RTOSExploration/esp")
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !696, file: !697, line: 397, baseType: !789, size: 32, offset: 288)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !697, line: 349, size: 128, elements: !791)
!791 = !{!792, !805, !806, !807}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !790, file: !697, line: 352, baseType: !793, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !697, line: 52, size: 192, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !794, file: !697, line: 54, baseType: !793, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !794, file: !697, line: 55, baseType: !36, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !794, file: !697, line: 55, baseType: !36, size: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !794, file: !697, line: 55, baseType: !36, size: 32, offset: 96)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !794, file: !697, line: 55, baseType: !36, size: 32, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !794, file: !697, line: 56, baseType: !802, size: 32, offset: 160)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 32, elements: !744)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !697, line: 22, baseType: !804)
!804 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !790, file: !697, line: 353, baseType: !36, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !790, file: !697, line: 354, baseType: !793, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !790, file: !697, line: 355, baseType: !808, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !696, file: !697, line: 399, baseType: !810, size: 32, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !695}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !696, file: !697, line: 401, baseType: !36, size: 32, offset: 352)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !696, file: !697, line: 404, baseType: !36, size: 32, offset: 384)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !696, file: !697, line: 405, baseType: !420, size: 32, offset: 416)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !696, file: !697, line: 407, baseType: !817, size: 32, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !697, line: 324, size: 192, elements: !819)
!819 = !{!820, !822, !823, !824}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !818, file: !697, line: 325, baseType: !821, size: 48)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !246)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !818, file: !697, line: 326, baseType: !821, size: 48, offset: 48)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !818, file: !697, line: 327, baseType: !7, size: 16, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !818, file: !697, line: 330, baseType: !229, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !696, file: !697, line: 408, baseType: !826, size: 32, offset: 480)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !697, line: 60, size: 288, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !837}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !827, file: !697, line: 62, baseType: !36, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !827, file: !697, line: 63, baseType: !36, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !827, file: !697, line: 64, baseType: !36, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !827, file: !697, line: 65, baseType: !36, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !827, file: !697, line: 66, baseType: !36, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !827, file: !697, line: 67, baseType: !36, size: 32, offset: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !827, file: !697, line: 68, baseType: !36, size: 32, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !827, file: !697, line: 69, baseType: !36, size: 32, offset: 224)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !827, file: !697, line: 70, baseType: !36, size: 32, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !696, file: !697, line: 409, baseType: !420, size: 32, offset: 512)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !696, file: !697, line: 412, baseType: !840, size: 32, offset: 544)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !36}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !696, file: !697, line: 416, baseType: !845, size: 32, offset: 576)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !697, line: 90, size: 1120, elements: !847)
!847 = !{!848, !849, !850, !852}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !846, file: !697, line: 91, baseType: !845, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !846, file: !697, line: 92, baseType: !36, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !846, file: !697, line: 93, baseType: !851, size: 1024, offset: 64)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1024, elements: !292)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !846, file: !697, line: 94, baseType: !853, size: 32, offset: 1088)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !697, line: 79, size: 2112, elements: !855)
!855 = !{!856, !858, !859, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !854, file: !697, line: 80, baseType: !857, size: 1024)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1024, elements: !292)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !854, file: !697, line: 81, baseType: !857, size: 1024, offset: 1024)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !854, file: !697, line: 83, baseType: !803, size: 32, offset: 2048)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !854, file: !697, line: 86, baseType: !803, size: 32, offset: 2080)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !696, file: !697, line: 417, baseType: !846, size: 1120, offset: 608)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !696, file: !697, line: 420, baseType: !863, size: 96, offset: 1728)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !697, line: 296, size: 96, elements: !864)
!864 = !{!865, !867, !868}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !863, file: !697, line: 298, baseType: !866, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !863, file: !697, line: 299, baseType: !36, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !863, file: !697, line: 300, baseType: !701, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !696, file: !697, line: 421, baseType: !701, size: 32, offset: 1824)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !696, file: !697, line: 422, baseType: !871, size: 32, offset: 1856)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !697, line: 359, size: 640, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !880, !881, !882, !883, !884, !885}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !872, file: !697, line: 362, baseType: !420, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !872, file: !697, line: 363, baseType: !763, size: 64, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !872, file: !697, line: 364, baseType: !763, size: 64, offset: 96)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !872, file: !697, line: 365, baseType: !763, size: 64, offset: 160)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !872, file: !697, line: 366, baseType: !879, size: 64, offset: 224)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !253)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !872, file: !697, line: 367, baseType: !36, size: 32, offset: 288)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !872, file: !697, line: 368, baseType: !763, size: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !872, file: !697, line: 369, baseType: !763, size: 64, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !872, file: !697, line: 370, baseType: !763, size: 64, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !872, file: !697, line: 371, baseType: !763, size: 64, offset: 512)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !872, file: !697, line: 372, baseType: !763, size: 64, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !696, file: !697, line: 423, baseType: !420, size: 32, offset: 1888)
!887 = !DILocation(line: 132, column: 12, scope: !692)
!888 = !{!889, !889, i64 0}
!889 = !{!"any pointer", !545, i64 0}
!890 = !DILocation(line: 132, column: 5, scope: !692)
!891 = distinct !DISubprogram(name: "bootloader_common_get_partition_description", scope: !48, file: !48, line: 123, type: !892, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !924)
!892 = !DISubroutineType(types: !893)
!893 = !{!894, !896, !903}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_err_t", file: !895, line: 19, baseType: !36)
!895 = !DIFile(filename: "esp-idf/components/esp_common/include/esp_err.h", directory: "/home/mjshen/RTOSExploration/esp")
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !16, line: 71, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 68, size: 64, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !899, file: !16, line: 69, baseType: !39, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !899, file: !16, line: 70, baseType: !39, size: 32, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_app_desc_t", file: !905, line: 35, baseType: !906)
!905 = !DIFile(filename: "esp-idf/components/esp_app_format/include/esp_app_desc.h", directory: "/home/mjshen/RTOSExploration/esp")
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !905, line: 24, size: 2048, elements: !907)
!907 = !{!908, !909, !910, !911, !913, !914, !916, !917, !918, !920}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "magic_word", scope: !906, file: !905, line: 25, baseType: !39, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "secure_version", scope: !906, file: !905, line: 26, baseType: !39, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "reserv1", scope: !906, file: !905, line: 27, baseType: !142, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !906, file: !905, line: 28, baseType: !912, size: 256, offset: 128)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, elements: !292)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "project_name", scope: !906, file: !905, line: 29, baseType: !912, size: 256, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !906, file: !905, line: 30, baseType: !915, size: 128, offset: 640)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, elements: !623)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !906, file: !905, line: 31, baseType: !915, size: 128, offset: 768)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "idf_ver", scope: !906, file: !905, line: 32, baseType: !912, size: 256, offset: 896)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "app_elf_sha256", scope: !906, file: !905, line: 33, baseType: !919, size: 256, offset: 1152)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 256, elements: !292)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "reserv2", scope: !906, file: !905, line: 34, baseType: !921, size: 640, offset: 1408)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 640, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 20)
!924 = !{!925, !926, !927, !928, !929}
!925 = !DILocalVariable(name: "partition", arg: 1, scope: !891, file: !48, line: 123, type: !896)
!926 = !DILocalVariable(name: "app_desc", arg: 2, scope: !891, file: !48, line: 123, type: !903)
!927 = !DILocalVariable(name: "app_desc_offset", scope: !891, file: !48, line: 129, type: !137)
!928 = !DILocalVariable(name: "mmap_size", scope: !891, file: !48, line: 130, type: !137)
!929 = !DILocalVariable(name: "image", scope: !891, file: !48, line: 131, type: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!931 = !DILocation(line: 0, scope: !891)
!932 = !DILocation(line: 125, column: 19, scope: !933)
!933 = distinct !DILexicalBlock(scope: !891, file: !48, line: 125, column: 9)
!934 = !DILocation(line: 125, column: 27, scope: !933)
!935 = !DILocation(line: 125, column: 61, scope: !933)
!936 = !{!937, !544, i64 0}
!937 = !{!"", !544, i64 0, !544, i64 4}
!938 = !DILocation(line: 125, column: 68, scope: !933)
!939 = !DILocation(line: 125, column: 9, scope: !891)
!940 = !DILocation(line: 131, column: 28, scope: !891)
!941 = !DILocation(line: 132, column: 15, scope: !942)
!942 = distinct !DILexicalBlock(scope: !891, file: !48, line: 132, column: 9)
!943 = !DILocation(line: 132, column: 9, scope: !891)
!944 = !DILocation(line: 133, column: 9, scope: !945)
!945 = distinct !DILexicalBlock(scope: !946, file: !48, line: 133, column: 9)
!946 = distinct !DILexicalBlock(scope: !947, file: !48, line: 133, column: 9)
!947 = distinct !DILexicalBlock(scope: !948, file: !48, line: 133, column: 9)
!948 = distinct !DILexicalBlock(scope: !942, file: !48, line: 132, column: 24)
!949 = !DILocation(line: 134, column: 9, scope: !948)
!950 = !DILocation(line: 137, column: 28, scope: !891)
!951 = !DILocation(line: 137, column: 5, scope: !891)
!952 = !DILocation(line: 138, column: 5, scope: !891)
!953 = !DILocation(line: 140, column: 19, scope: !954)
!954 = distinct !DILexicalBlock(scope: !891, file: !48, line: 140, column: 9)
!955 = !{!956, !544, i64 0}
!956 = !{!"", !544, i64 0, !544, i64 4, !545, i64 8, !545, i64 16, !545, i64 48, !545, i64 80, !545, i64 96, !545, i64 112, !545, i64 144, !545, i64 176}
!957 = !DILocation(line: 140, column: 30, scope: !954)
!958 = !DILocation(line: 145, column: 1, scope: !891)
!959 = !DISubprogram(name: "memcpy", scope: !960, file: !960, line: 31, type: !961, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !572)
!960 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/string.h", directory: "/home/mjshen/RTOSExploration/esp")
!961 = !DISubroutineType(types: !962)
!962 = !{!35, !963, !964, !157}
!963 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !35)
!964 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!967 = distinct !DISubprogram(name: "bootloader_utility_load_partition_table", scope: !48, file: !48, line: 148, type: !968, scopeLine: 149, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !981)
!968 = !DISubroutineType(types: !969)
!969 = !{!84, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !610, line: 32, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 25, size: 1280, elements: !973)
!973 = !{!974, !975, !976, !977, !979, !980}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !972, file: !610, line: 26, baseType: !898, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !972, file: !610, line: 27, baseType: !898, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !972, file: !610, line: 28, baseType: !898, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !972, file: !610, line: 29, baseType: !978, size: 1024, offset: 192)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 1024, elements: !623)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !972, file: !610, line: 30, baseType: !39, size: 32, offset: 1216)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !972, file: !610, line: 31, baseType: !39, size: 32, offset: 1248)
!981 = !{!982, !983, !998, !999, !1000, !1001, !1003}
!982 = !DILocalVariable(name: "bs", arg: 1, scope: !967, file: !48, line: 148, type: !970)
!983 = !DILocalVariable(name: "partitions", scope: !967, file: !48, line: 150, type: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_info_t", file: !16, line: 83, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 76, size: 256, elements: !988)
!988 = !{!989, !992, !993, !994, !995, !997}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !987, file: !16, line: 77, baseType: !990, size: 16)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !40, line: 36, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !42, line: 57, baseType: !7)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !987, file: !16, line: 78, baseType: !44, size: 8, offset: 16)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !987, file: !16, line: 79, baseType: !44, size: 8, offset: 24)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !987, file: !16, line: 80, baseType: !898, size: 64, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !987, file: !16, line: 81, baseType: !996, size: 128, offset: 96)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, elements: !623)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !987, file: !16, line: 82, baseType: !39, size: 32, offset: 224)
!998 = !DILocalVariable(name: "partition_usage", scope: !967, file: !48, line: 151, type: !81)
!999 = !DILocalVariable(name: "err", scope: !967, file: !48, line: 152, type: !894)
!1000 = !DILocalVariable(name: "num_partitions", scope: !967, file: !48, line: 153, type: !36)
!1001 = !DILocalVariable(name: "i", scope: !1002, file: !48, line: 171, type: !36)
!1002 = distinct !DILexicalBlock(scope: !967, file: !48, line: 171, column: 5)
!1003 = !DILocalVariable(name: "partition", scope: !1004, file: !48, line: 172, type: !984)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !48, line: 171, column: 46)
!1005 = distinct !DILexicalBlock(scope: !1002, file: !48, line: 171, column: 5)
!1006 = !DILocation(line: 0, scope: !967)
!1007 = !DILocation(line: 153, column: 5, scope: !967)
!1008 = !DILocation(line: 155, column: 18, scope: !967)
!1009 = !DILocation(line: 156, column: 10, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !967, file: !48, line: 156, column: 9)
!1011 = !DILocation(line: 156, column: 9, scope: !967)
!1012 = !DILocation(line: 157, column: 9, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !48, line: 157, column: 9)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !48, line: 157, column: 9)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !48, line: 157, column: 9)
!1016 = distinct !DILexicalBlock(scope: !1010, file: !48, line: 156, column: 22)
!1017 = !DILocation(line: 158, column: 9, scope: !1016)
!1018 = !DILocation(line: 162, column: 11, scope: !967)
!1019 = !DILocation(line: 163, column: 13, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !967, file: !48, line: 163, column: 9)
!1021 = !DILocation(line: 163, column: 9, scope: !967)
!1022 = !DILocation(line: 0, scope: !1002)
!1023 = !DILocation(line: 171, column: 23, scope: !1005)
!1024 = !DILocation(line: 171, column: 5, scope: !1002)
!1025 = !DILocation(line: 164, column: 9, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !48, line: 164, column: 9)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !48, line: 164, column: 9)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !48, line: 164, column: 9)
!1029 = distinct !DILexicalBlock(scope: !1020, file: !48, line: 163, column: 24)
!1030 = !DILocation(line: 165, column: 9, scope: !1029)
!1031 = !DILocation(line: 237, column: 5, scope: !967)
!1032 = !DILocation(line: 240, column: 5, scope: !967)
!1033 = !DILocation(line: 0, scope: !1004)
!1034 = !DILocation(line: 178, column: 28, scope: !1004)
!1035 = !{!1036, !545, i64 2}
!1036 = !{!"", !1037, i64 0, !545, i64 2, !545, i64 3, !937, i64 4, !545, i64 12, !544, i64 28}
!1037 = !{!"short", !545, i64 0}
!1038 = !DILocation(line: 178, column: 9, scope: !1004)
!1039 = !DILocation(line: 180, column: 32, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1004, file: !48, line: 178, column: 34)
!1041 = !{!1036, !545, i64 3}
!1042 = !DILocation(line: 180, column: 21, scope: !1040)
!1043 = !DILocation(line: 180, column: 13, scope: !1040)
!1044 = !DILocation(line: 182, column: 42, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1040, file: !48, line: 180, column: 41)
!1046 = !DILocation(line: 184, column: 17, scope: !1045)
!1047 = !DILocation(line: 186, column: 39, scope: !1045)
!1048 = !DILocation(line: 188, column: 17, scope: !1045)
!1049 = !DILocation(line: 191, column: 41, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1045, file: !48, line: 191, column: 21)
!1051 = !DILocation(line: 191, column: 67, scope: !1050)
!1052 = !DILocation(line: 191, column: 21, scope: !1045)
!1053 = !DILocation(line: 192, column: 48, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !48, line: 191, column: 93)
!1055 = !DILocation(line: 192, column: 21, scope: !1054)
!1056 = !DILocation(line: 192, column: 86, scope: !1054)
!1057 = !DILocation(line: 193, column: 21, scope: !1054)
!1058 = !{!1059, !544, i64 152}
!1059 = !{!"", !937, i64 0, !937, i64 8, !937, i64 16, !545, i64 24, !544, i64 152, !544, i64 156}
!1060 = !DILocation(line: 195, column: 17, scope: !1054)
!1061 = !DILocation(line: 202, column: 32, scope: !1040)
!1062 = !DILocation(line: 202, column: 13, scope: !1040)
!1063 = !DILocation(line: 204, column: 43, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1040, file: !48, line: 202, column: 41)
!1065 = !DILocation(line: 206, column: 17, scope: !1064)
!1066 = !DILocation(line: 171, column: 42, scope: !1005)
!1067 = distinct !{!1067, !1024, !1068, !1069}
!1068 = !DILocation(line: 235, column: 5, scope: !1002)
!1069 = !{!"llvm.loop.mustprogress"}
!1070 = !DILocation(line: 241, column: 1, scope: !967)
!1071 = distinct !DISubprogram(name: "bootloader_utility_get_selected_boot_partition", scope: !48, file: !48, line: 347, type: !1072, scopeLine: 348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1076)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!36, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1076 = !{!1077, !1078, !1088, !1089, !1092}
!1077 = !DILocalVariable(name: "bs", arg: 1, scope: !1071, file: !48, line: 347, type: !1074)
!1078 = !DILocalVariable(name: "otadata", scope: !1071, file: !48, line: 349, type: !1079)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 512, elements: !143)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_ota_select_entry_t", file: !16, line: 65, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 60, size: 256, elements: !1082)
!1082 = !{!1083, !1084, !1086, !1087}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ota_seq", scope: !1081, file: !16, line: 61, baseType: !39, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "seq_label", scope: !1081, file: !16, line: 62, baseType: !1085, size: 160, offset: 32)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !922)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ota_state", scope: !1081, file: !16, line: 63, baseType: !39, size: 32, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !1081, file: !16, line: 64, baseType: !39, size: 32, offset: 224)
!1088 = !DILocalVariable(name: "boot_index", scope: !1071, file: !48, line: 350, type: !36)
!1089 = !DILocalVariable(name: "active_otadata", scope: !1090, file: !48, line: 395, type: !36)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !48, line: 394, column: 12)
!1091 = distinct !DILexicalBlock(scope: !1071, file: !48, line: 376, column: 9)
!1092 = !DILocalVariable(name: "ota_seq", scope: !1093, file: !48, line: 411, type: !39)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !48, line: 409, column: 35)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !48, line: 409, column: 13)
!1095 = !DILocation(line: 0, scope: !1071)
!1096 = !DILocation(line: 349, column: 5, scope: !1071)
!1097 = !DILocation(line: 349, column: 28, scope: !1071)
!1098 = !DILocation(line: 352, column: 22, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1071, file: !48, line: 352, column: 9)
!1100 = !{!1059, !544, i64 0}
!1101 = !DILocation(line: 352, column: 29, scope: !1099)
!1102 = !DILocation(line: 352, column: 9, scope: !1071)
!1103 = !DILocation(line: 356, column: 9, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1071, file: !48, line: 356, column: 9)
!1105 = !DILocalVariable(name: "ota_info", arg: 1, scope: !1106, file: !48, line: 96, type: !896)
!1106 = distinct !DISubprogram(name: "read_otadata", scope: !48, file: !48, line: 96, type: !1107, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1110)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!894, !896, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 32)
!1110 = !{!1105, !1111, !1112}
!1111 = !DILocalVariable(name: "two_otadata", arg: 2, scope: !1106, file: !48, line: 96, type: !1109)
!1112 = !DILocalVariable(name: "ota_select_map", scope: !1106, file: !48, line: 98, type: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1115 = !DILocation(line: 0, scope: !1106, inlinedAt: !1116)
!1116 = distinct !DILocation(line: 356, column: 9, scope: !1104)
!1117 = !DILocation(line: 99, column: 19, scope: !1118, inlinedAt: !1116)
!1118 = distinct !DILexicalBlock(scope: !1106, file: !48, line: 99, column: 9)
!1119 = !DILocation(line: 99, column: 26, scope: !1118, inlinedAt: !1116)
!1120 = !DILocation(line: 99, column: 9, scope: !1106, inlinedAt: !1116)
!1121 = !DILocation(line: 104, column: 19, scope: !1122, inlinedAt: !1116)
!1122 = distinct !DILexicalBlock(scope: !1106, file: !48, line: 104, column: 9)
!1123 = !{!937, !544, i64 4}
!1124 = !DILocation(line: 104, column: 24, scope: !1122, inlinedAt: !1116)
!1125 = !DILocation(line: 104, column: 9, scope: !1106, inlinedAt: !1116)
!1126 = !DILocation(line: 105, column: 9, scope: !1127, inlinedAt: !1116)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !48, line: 105, column: 9)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !48, line: 105, column: 9)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !48, line: 105, column: 9)
!1130 = distinct !DILexicalBlock(scope: !1122, file: !48, line: 104, column: 44)
!1131 = !DILocation(line: 106, column: 9, scope: !1130, inlinedAt: !1116)
!1132 = !DILocation(line: 110, column: 22, scope: !1106, inlinedAt: !1116)
!1133 = !DILocation(line: 111, column: 10, scope: !1134, inlinedAt: !1116)
!1134 = distinct !DILexicalBlock(scope: !1106, file: !48, line: 111, column: 9)
!1135 = !DILocation(line: 111, column: 9, scope: !1106, inlinedAt: !1116)
!1136 = !DILocation(line: 112, column: 9, scope: !1137, inlinedAt: !1116)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !48, line: 112, column: 9)
!1138 = distinct !DILexicalBlock(scope: !1139, file: !48, line: 112, column: 9)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !48, line: 112, column: 9)
!1140 = distinct !DILexicalBlock(scope: !1134, file: !48, line: 111, column: 26)
!1141 = !DILocation(line: 113, column: 9, scope: !1140, inlinedAt: !1116)
!1142 = !DILocation(line: 116, column: 5, scope: !1106, inlinedAt: !1116)
!1143 = !DILocation(line: 117, column: 13, scope: !1106, inlinedAt: !1116)
!1144 = !DILocation(line: 117, column: 55, scope: !1106, inlinedAt: !1116)
!1145 = !DILocation(line: 117, column: 5, scope: !1106, inlinedAt: !1116)
!1146 = !DILocation(line: 118, column: 5, scope: !1106, inlinedAt: !1116)
!1147 = !DILocation(line: 359, column: 30, scope: !1071)
!1148 = !DILocation(line: 376, column: 10, scope: !1091)
!1149 = !DILocation(line: 376, column: 60, scope: !1091)
!1150 = !DILocation(line: 377, column: 13, scope: !1091)
!1151 = !DILocation(line: 377, column: 64, scope: !1091)
!1152 = !DILocation(line: 378, column: 17, scope: !1091)
!1153 = !DILocation(line: 378, column: 27, scope: !1091)
!1154 = !DILocation(line: 376, column: 9, scope: !1071)
!1155 = !DILocation(line: 380, column: 25, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !48, line: 380, column: 13)
!1157 = distinct !DILexicalBlock(scope: !1091, file: !48, line: 378, column: 33)
!1158 = !{!1059, !544, i64 8}
!1159 = !DILocation(line: 380, column: 32, scope: !1156)
!1160 = !DILocation(line: 380, column: 13, scope: !1157)
!1161 = !DILocation(line: 387, column: 29, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !48, line: 387, column: 17)
!1163 = distinct !DILexicalBlock(scope: !1156, file: !48, line: 383, column: 16)
!1164 = !{!1165, !544, i64 0}
!1165 = !{!"", !544, i64 0, !545, i64 4, !544, i64 24, !544, i64 28}
!1166 = !DILocation(line: 387, column: 37, scope: !1162)
!1167 = !DILocation(line: 387, column: 51, scope: !1162)
!1168 = !DILocation(line: 387, column: 65, scope: !1162)
!1169 = !{!1165, !544, i64 28}
!1170 = !DILocation(line: 387, column: 72, scope: !1162)
!1171 = !DILocation(line: 387, column: 69, scope: !1162)
!1172 = !DILocation(line: 387, column: 119, scope: !1162)
!1173 = !DILocation(line: 388, column: 33, scope: !1162)
!1174 = !DILocation(line: 388, column: 41, scope: !1162)
!1175 = !DILocation(line: 388, column: 55, scope: !1162)
!1176 = !DILocation(line: 388, column: 69, scope: !1162)
!1177 = !DILocation(line: 388, column: 76, scope: !1162)
!1178 = !DILocation(line: 388, column: 73, scope: !1162)
!1179 = !DILocation(line: 387, column: 17, scope: !1163)
!1180 = !DILocation(line: 391, column: 42, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1162, file: !48, line: 388, column: 124)
!1182 = !DILocation(line: 392, column: 13, scope: !1181)
!1183 = !DILocation(line: 395, column: 30, scope: !1090)
!1184 = !DILocation(line: 0, scope: !1090)
!1185 = !DILocation(line: 409, column: 28, scope: !1094)
!1186 = !DILocation(line: 409, column: 13, scope: !1090)
!1187 = !DILocation(line: 411, column: 56, scope: !1093)
!1188 = !DILocation(line: 411, column: 64, scope: !1093)
!1189 = !DILocation(line: 0, scope: !1093)
!1190 = !DILocation(line: 412, column: 40, scope: !1093)
!1191 = !DILocation(line: 412, column: 34, scope: !1093)
!1192 = !DILocation(line: 428, column: 9, scope: !1093)
!1193 = !DILocation(line: 428, column: 32, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1094, file: !48, line: 428, column: 20)
!1195 = !DILocation(line: 428, column: 39, scope: !1194)
!1196 = !DILocation(line: 0, scope: !1194)
!1197 = !DILocation(line: 428, column: 20, scope: !1094)
!1198 = !DILocation(line: 429, column: 13, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1200, file: !48, line: 429, column: 13)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !48, line: 429, column: 13)
!1201 = distinct !DILexicalBlock(scope: !1202, file: !48, line: 429, column: 13)
!1202 = distinct !DILexicalBlock(scope: !1194, file: !48, line: 428, column: 45)
!1203 = !DILocation(line: 431, column: 9, scope: !1202)
!1204 = !DILocation(line: 432, column: 13, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1206, file: !48, line: 432, column: 13)
!1206 = distinct !DILexicalBlock(scope: !1207, file: !48, line: 432, column: 13)
!1207 = distinct !DILexicalBlock(scope: !1208, file: !48, line: 432, column: 13)
!1208 = distinct !DILexicalBlock(scope: !1194, file: !48, line: 431, column: 16)
!1209 = !DILocation(line: 438, column: 1, scope: !1071)
!1210 = distinct !DISubprogram(name: "bootloader_utility_load_boot_image", scope: !48, file: !48, line: 503, type: !1211, scopeLine: 504, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1213)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{null, !1074, !36}
