; ModuleID = 'build//custom_bootloader/bootloader_override/bootloader/bootloader.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-i8:8:32-i16:16:32-i64:64-n32"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (i32)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque
%struct._mprec = type { %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint** }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%struct._rand48 = type { [3 x i16], [3 x i16], i16, i64 }
%struct.__tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args* }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, %struct._reent*, i8*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i32, %struct.__lock*, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct.__lock = type { [23 x i32] }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!173 = !DILocalVariable(name: "digest_words", scope: !163, file: !155, line: 110, type: !133)
!174 = !DILocalVariable(name: "sha_text_reg", scope: !163, file: !155, line: 111, type: !133)
!175 = !DILocalVariable(name: "i", scope: !176, file: !155, line: 112, type: !157)
!176 = distinct !DILexicalBlock(scope: !163, file: !155, line: 112, column: 5)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 512, elements: !179)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!179 = !{!180}
!180 = !DISubrange(count: 64)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!182 = distinct !DIGlobalVariable(name: "DIGEST_WORDS", scope: !147, file: !155, line: 21, type: !156, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!184 = distinct !DIGlobalVariable(name: "mapped", scope: !185, file: !199, line: 152, type: !84, isLocal: true, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !187, retainedTypes: !194, globals: !195, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!187 = !{!188}
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 43, baseType: !17, size: 32, elements: !190)
!189 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_spiflash.h", directory: "/home/mjshen/RTOSExploration/esp")
!190 = !{!191, !192, !193}
!191 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_OK", value: 0)
!192 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_ERR", value: 1)
!193 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_TIMEOUT", value: 2)
!194 = !{!35, !134, !133}
!195 = !{!196, !197, !200}
!196 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "TAG", scope: !185, file: !199, line: 124, type: !81, isLocal: true, isDefinition: true)
!199 = !DIFile(filename: "esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp")
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "current_read_mapping", scope: !185, file: !199, line: 155, type: !39, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "bootloader_image_hdr", scope: !204, file: !233, line: 25, type: !234, isLocal: false, isDefinition: true, align: 32)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !226, globals: !230, splitDebugInlining: false, nameTableKind: None)
!205 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!206 = !{!127, !5, !207, !213, !219}
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 21, baseType: !17, size: 32, elements: !209)
!208 = !DIFile(filename: "esp-idf/components/hal/include/hal/wdt_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!209 = !{!210, !211, !212}
!210 = !DIEnumerator(name: "WDT_RWDT", value: 0)
!211 = !DIEnumerator(name: "WDT_MWDT0", value: 1)
!212 = !DIEnumerator(name: "WDT_MWDT1", value: 2)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 30, baseType: !17, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218}
!215 = !DIEnumerator(name: "WDT_STAGE0", value: 0)
!216 = !DIEnumerator(name: "WDT_STAGE1", value: 1)
!217 = !DIEnumerator(name: "WDT_STAGE2", value: 2)
!218 = !DIEnumerator(name: "WDT_STAGE3", value: 3)
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 43, baseType: !17, size: 32, elements: !220)
!220 = !{!221, !222, !223, !224, !225}
!221 = !DIEnumerator(name: "WDT_STAGE_ACTION_OFF", value: 0)
!222 = !DIEnumerator(name: "WDT_STAGE_ACTION_INT", value: 1)
!223 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_CPU", value: 2)
!224 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_SYSTEM", value: 3)
!225 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_RTC", value: 4)
!226 = !{!39, !227}
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !40, line: 60, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !42, line: 105, baseType: !229)
!229 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!230 = !{!202, !231}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "TAG", scope: !204, file: !233, line: 23, type: !81, isLocal: true, isDefinition: true)
!233 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_image_header_t", file: !6, line: 93, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 74, size: 192, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !248, !250, !251, !255}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !235, file: !6, line: 75, baseType: !44, size: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !235, file: !6, line: 76, baseType: !44, size: 8, offset: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "spi_mode", scope: !235, file: !6, line: 77, baseType: !44, size: 8, offset: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "spi_speed", scope: !235, file: !6, line: 78, baseType: !44, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 24)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "spi_size", scope: !235, file: !6, line: 79, baseType: !44, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 24)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "entry_addr", scope: !235, file: !6, line: 80, baseType: !39, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "wp_pin", scope: !235, file: !6, line: 81, baseType: !44, size: 8, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "spi_pin_drv", scope: !235, file: !6, line: 84, baseType: !245, size: 24, offset: 72)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 3)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "chip_id", scope: !235, file: !6, line: 85, baseType: !249, size: 16, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_chip_id_t", file: !6, line: 26, baseType: !5)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "min_chip_rev", scope: !235, file: !6, line: 86, baseType: !44, size: 8, offset: 112)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !235, file: !6, line: 87, baseType: !252, size: 64, offset: 120)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "hash_appended", scope: !235, file: !6, line: 88, baseType: !44, size: 8, offset: 184)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "intr_desc_table", scope: !258, file: !282, line: 164, type: !283, isLocal: true, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !260, retainedTypes: !279, globals: !281, splitDebugInlining: false, nameTableKind: None)
!259 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!260 = !{!261, !267, !274}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 37, baseType: !17, size: 32, elements: !263)
!262 = !DIFile(filename: "esp-idf/components/esp_hw_support/include/esp_cpu.h", directory: "/home/mjshen/RTOSExploration/esp")
!263 = !{!264, !265, !266}
!264 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_LEVEL", value: 0)
!265 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_EDGE", value: 1)
!266 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_NA", value: 2)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !268, line: 23, baseType: !17, size: 32, elements: !269)
!268 = !DIFile(filename: "esp-idf/components/hal/include/hal/mpu_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!269 = !{!270, !271, !272, !273}
!270 = !DIEnumerator(name: "MPU_REGION_ILLEGAL", value: 0)
!271 = !DIEnumerator(name: "MPU_REGION_RW", value: 1)
!272 = !DIEnumerator(name: "MPU_REGION_X", value: 2)
!273 = !DIEnumerator(name: "MPU_REGION_RWX", value: 3)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 70, baseType: !17, size: 32, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_LOAD", value: 0)
!277 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_STORE", value: 1)
!278 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_ACCESS", value: 2)
!279 = !{!39, !37, !280}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !42, line: 184, baseType: !17)
!281 = !{!256}
!282 = !DIFile(filename: "esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp")
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 4096, elements: !292)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "intr_desc_t", file: !282, line: 160, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !282, line: 156, size: 128, elements: !287)
!287 = !{!288, !289, !291}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !286, file: !282, line: 157, baseType: !36, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !282, line: 158, baseType: !290, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_intr_type_t", file: !262, line: 41, baseType: !261)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !286, file: !282, line: 159, baseType: !142, size: 64, offset: 64)
!292 = !{!293}
!293 = !DISubrange(count: 32)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "s_cur_pll_freq", scope: !296, file: !340, line: 35, type: !280, isLocal: true, isDefinition: true)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !332, globals: !337, splitDebugInlining: false, nameTableKind: None)
!297 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!298 = !{!299, !305, !313, !320, !326}
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !300, line: 77, baseType: !17, size: 32, elements: !301)
!300 = !DIFile(filename: "esp-idf/components/hal/esp32/include/hal/clk_tree_ll.h", directory: "/home/mjshen/RTOSExploration/esp")
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_CRYSTAL", value: 0)
!303 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_EXTERNAL", value: 1)
!304 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_BOOTSTRAP", value: 2)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 64, baseType: !17, size: 32, elements: !307)
!306 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/clk_tree_defs.h", directory: "/home/mjshen/RTOSExploration/esp")
!307 = !{!308, !309, !310, !311, !312}
!308 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_XTAL", value: 0)
!309 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_PLL", value: 1)
!310 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_RC_FAST", value: 2)
!311 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_APLL", value: 3)
!312 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_INVALID", value: 4)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 82, baseType: !17, size: 32, elements: !315)
!314 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/rtc.h", directory: "/home/mjshen/RTOSExploration/esp")
!315 = !{!316, !317, !318, !319}
!316 = !DIEnumerator(name: "RTC_XTAL_FREQ_AUTO", value: 0)
!317 = !DIEnumerator(name: "RTC_XTAL_FREQ_40M", value: 40)
!318 = !DIEnumerator(name: "RTC_XTAL_FREQ_26M", value: 26)
!319 = !DIEnumerator(name: "RTC_XTAL_FREQ_24M", value: 24)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 76, baseType: !17, size: 32, elements: !321)
!321 = !{!322, !323, !324, !325}
!322 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_SLOW", value: 0)
!323 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_XTAL32K", value: 1)
!324 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_FAST_D256", value: 2)
!325 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_INVALID", value: 3)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 87, baseType: !17, size: 32, elements: !327)
!327 = !{!328, !329, !330, !331}
!328 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_D4", value: 0)
!329 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_DIV", value: 0)
!330 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_RC_FAST", value: 1)
!331 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_INVALID", value: 2)
!332 = !{!280, !333, !36, !335, !336}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !280)
!335 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtc_xtal_freq_t", file: !314, line: 87, baseType: !313)
!337 = !{!294, !338}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "TAG", scope: !296, file: !340, line: 37, type: !81, isLocal: true, isDefinition: true)
!340 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp")
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!342 = distinct !DIGlobalVariable(name: "s_lock", scope: !343, file: !349, line: 12, type: !36, isLocal: true, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !345, globals: !347, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_cycle_count_t", file: !262, line: 32, baseType: !39)
!347 = !{!348}
!348 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!349 = !DIFile(filename: "esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp")
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !352, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/soc/esp32/./dport_access.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!352 = !{!73}
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !355, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!355 = !{!134, !84}
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !358, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/examples/custom_bootloader/bootloader_override/bootloader_components/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!358 = !{!359}
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "TAG", scope: !356, file: !361, line: 13, type: !81, isLocal: true, isDefinition: true)
!361 = !DIFile(filename: "esp-idf/examples/custom_bootloader/bootloader_override/bootloader_components/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp")
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, retainedTypes: !385, globals: !386, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!364 = !{!365, !379}
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !366, line: 19, baseType: !17, size: 32, elements: !367)
!366 = !DIFile(filename: "esp-idf/components/efuse/esp32/include/esp_efuse_chip.h", directory: "/home/mjshen/RTOSExploration/esp")
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!368 = !DIEnumerator(name: "EFUSE_BLK0", value: 0)
!369 = !DIEnumerator(name: "EFUSE_BLK1", value: 1)
!370 = !DIEnumerator(name: "EFUSE_BLK_KEY0", value: 1)
!371 = !DIEnumerator(name: "EFUSE_BLK_ENCRYPT_FLASH", value: 1)
!372 = !DIEnumerator(name: "EFUSE_BLK2", value: 2)
!373 = !DIEnumerator(name: "EFUSE_BLK_KEY1", value: 2)
!374 = !DIEnumerator(name: "EFUSE_BLK_SECURE_BOOT", value: 2)
!375 = !DIEnumerator(name: "EFUSE_BLK3", value: 3)
!376 = !DIEnumerator(name: "EFUSE_BLK_KEY2", value: 3)
!377 = !DIEnumerator(name: "EFUSE_BLK_KEY_MAX", value: 4)
!378 = !DIEnumerator(name: "EFUSE_BLK_MAX", value: 4)
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !380, line: 23, baseType: !17, size: 32, elements: !381)
!380 = !DIFile(filename: "esp-idf/components/bootloader_support/include/esp_flash_encrypt.h", directory: "/home/mjshen/RTOSExploration/esp")
!381 = !{!382, !383, !384}
!382 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DISABLED", value: 0)
!383 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DEVELOPMENT", value: 1)
!384 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_RELEASE", value: 2)
!385 = !{!37}
!386 = !{!387}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "TAG", scope: !362, file: !389, line: 23, type: !81, isLocal: true, isDefinition: true)
!389 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp")
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !392, globals: !394, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!394 = !{!395}
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "TAG", scope: !390, file: !397, line: 12, type: !81, isLocal: true, isDefinition: true)
!397 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp")
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_soc.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !404, retainedTypes: !405, globals: !406, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!404 = !{!5, !188, !108}
!405 = !{!39, !37}
!406 = !{!407}
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "TAG", scope: !402, file: !409, line: 40, type: !81, isLocal: true, isDefinition: true)
!409 = !DIFile(filename: "esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp")
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !412, retainedTypes: !418, globals: !420, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!412 = !{!413, !5}
!413 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 16, baseType: !36, size: 32, elements: !414)
!414 = !{!415, !416, !417}
!415 = !DIEnumerator(name: "GPIO_LONG_HOLD", value: 1)
!416 = !DIEnumerator(name: "GPIO_SHORT_HOLD", value: -1)
!417 = !DIEnumerator(name: "GPIO_NOT_HOLD", value: 0)
!418 = !{!39, !37, !35, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!420 = !{!421}
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "TAG", scope: !410, file: !423, line: 30, type: !81, isLocal: true, isDefinition: true)
!423 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp")
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !425, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !426, retainedTypes: !427, globals: !428, splitDebugInlining: false, nameTableKind: None)
!425 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!426 = !{!15, !5, !127}
!427 = !{!43, !35}
!428 = !{!429}
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "TAG", scope: !424, file: !431, line: 29, type: !81, isLocal: true, isDefinition: true)
!431 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp")
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !435, splitDebugInlining: false, nameTableKind: None)
!433 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_clock_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!434 = !{!108, !313, !326, !320}
!435 = !{!333}
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!437 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_mem.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !440, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!440 = !{!43, !35, !37, !346}
!441 = distinct !DICompileUnit(language: DW_LANG_C99, file: !442, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !443, splitDebugInlining: false, nameTableKind: None)
!442 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!443 = !{!280, !333}
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !446, retainedTypes: !405, splitDebugInlining: false, nameTableKind: None)
!445 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash_config_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!446 = !{!5, !188, !447}
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 47, baseType: !17, size: 32, elements: !448)
!448 = !{!449, !450, !451, !452}
!449 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_2", value: 0)
!450 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_3", value: 1)
!451 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_4", value: 2)
!452 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_1", value: 15)
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !385, splitDebugInlining: false, nameTableKind: None)
!454 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_efuse.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !459, retainedTypes: !465, globals: !466, splitDebugInlining: false, nameTableKind: None)
!458 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!459 = !{!313, !326, !320, !305, !460}
!460 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 102, baseType: !17, size: 32, elements: !461)
!461 = !{!462, !463, !464}
!462 = !DIEnumerator(name: "RTC_CAL_RTC_MUX", value: 0)
!463 = !DIEnumerator(name: "RTC_CAL_8MD256", value: 1)
!464 = !DIEnumerator(name: "RTC_CAL_32K_XTAL", value: 2)
!465 = !{!37, !227, !39, !346}
!466 = !{!467}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "TAG", scope: !457, file: !469, line: 31, type: !81, isLocal: true, isDefinition: true)
!469 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !443, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !474, retainedTypes: !475, globals: !477, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!474 = !{!460, !313, !320}
!475 = !{!280, !476, !333}
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !42, line: 202, baseType: !229)
!477 = !{!478}
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "TAG", scope: !472, file: !480, line: 14, type: !81, isLocal: true, isDefinition: true)
!480 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp")
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_sys.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!484 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_uart.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !487, retainedTypes: !502, splitDebugInlining: false, nameTableKind: None)
!486 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_spiflash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!487 = !{!188, !488}
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 19, baseType: !17, size: 32, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!490 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QIO_MODE", value: 0)
!491 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QOUT_MODE", value: 1)
!492 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DIO_MODE", value: 2)
!493 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DOUT_MODE", value: 3)
!494 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_FASTRD_MODE", value: 4)
!495 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_SLOWRD_MODE", value: 5)
!496 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_STR_MODE", value: 6)
!497 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_DTR_MODE", value: 7)
!498 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OOUT_MODE", value: 8)
!499 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_STR_MODE", value: 9)
!500 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_DTR_MODE", value: 10)
!501 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QPI_MODE", value: 11)
!502 = !{!333, !280, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !506, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mpu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!506 = !{!267}
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !509, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!509 = !{!510, !511, !512, !73}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !76, line: 207, baseType: !7)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !352, splitDebugInlining: false, nameTableKind: None)
!514 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/esp32/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !405, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mmu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !519, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/wdt_hal_iram.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_override/bootloader")
!519 = !{!207, !213, !520, !219}
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 57, baseType: !17, size: 32, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529}
!522 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_100ns", value: 0)
!523 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_200ns", value: 1)
!524 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_300ns", value: 2)
!525 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_400ns", value: 3)
!526 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_500ns", value: 4)
!527 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_800ns", value: 5)
!528 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_1_6us", value: 6)
!529 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_3_2us", value: 7)
!530 = !{!"clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)"}
!531 = !{i32 7, !"Dwarf Version", i32 4}
!532 = !{i32 2, !"Debug Info Version", i32 3}
!533 = !{i32 1, !"wchar_size", i32 1}
!534 = distinct !DISubprogram(name: "esp_dport_access_reg_read", scope: !535, file: !535, line: 13, type: !536, scopeLine: 14, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !538)
!535 = !DIFile(filename: "esp-idf/components/soc/esp32/dport_access.c", directory: "/home/mjshen/RTOSExploration/esp")
!536 = !DISubroutineType(types: !537)
!537 = !{!75, !75}
!538 = !{!539}
!539 = !DILocalVariable(name: "reg", arg: 1, scope: !534, file: !535, line: 13, type: !75)
!540 = !DILocation(line: 0, scope: !534)
!541 = !DILocation(line: 16, column: 12, scope: !534)
!542 = !{!543, !543, i64 0}
!543 = !{!"int", !544, i64 0}
!544 = !{!"omnipotent char", !545, i64 0}
!545 = !{!"Simple C/C++ TBAA"}
!546 = !DILocation(line: 16, column: 5, scope: !534)
!547 = distinct !DISubprogram(name: "esp_dport_access_sequence_reg_read", scope: !535, file: !535, line: 35, type: !536, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !548)
!548 = !{!549}
!549 = !DILocalVariable(name: "reg", arg: 1, scope: !547, file: !535, line: 35, type: !75)
!550 = !DILocation(line: 0, scope: !547)
!551 = !DILocation(line: 38, column: 12, scope: !547)
!552 = !DILocation(line: 38, column: 5, scope: !547)
!553 = distinct !DISubprogram(name: "__assert_func", scope: !554, file: !554, line: 13, type: !555, scopeLine: 14, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !557)
!554 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp")
!555 = !DISubroutineType(types: !556)
!556 = !{null, !81, !36, !81, !81}
!557 = !{!558, !559, !560, !561}
!558 = !DILocalVariable(name: "file", arg: 1, scope: !553, file: !554, line: 13, type: !81)
!559 = !DILocalVariable(name: "line", arg: 2, scope: !553, file: !554, line: 13, type: !36)
!560 = !DILocalVariable(name: "func", arg: 3, scope: !553, file: !554, line: 13, type: !81)
!561 = !DILocalVariable(name: "expr", arg: 4, scope: !553, file: !554, line: 13, type: !81)
!562 = !DILocation(line: 0, scope: !553)
!563 = !DILocation(line: 17, column: 5, scope: !553)
!564 = !DILocation(line: 20, column: 5, scope: !553)
!565 = distinct !{!565, !564, !566}
!566 = !DILocation(line: 21, column: 5, scope: !553)
!567 = !DISubprogram(name: "esp_rom_printf", scope: !568, file: !568, line: 24, type: !569, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !571)
!568 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_sys.h", directory: "/home/mjshen/RTOSExploration/esp")
!569 = !DISubroutineType(types: !570)
!570 = !{!36, !81, null}
!571 = !{}
!572 = distinct !DISubprogram(name: "abort", scope: !554, file: !554, line: 24, type: !71, scopeLine: 25, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !571)
!573 = !DILocation(line: 27, column: 69, scope: !572)
!574 = !DILocation(line: 27, column: 59, scope: !572)
!575 = !DILocation(line: 27, column: 97, scope: !572)
!576 = !DILocation(line: 27, column: 5, scope: !572)
!577 = !DILocalVariable(name: "dcr", scope: !578, file: !579, line: 189, type: !280)
!578 = distinct !DISubprogram(name: "xt_utils_dbgr_is_attached", scope: !579, file: !579, line: 187, type: !580, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !582)
!579 = !DIFile(filename: "esp-idf/components/xtensa/include/xt_utils.h", directory: "/home/mjshen/RTOSExploration/esp")
!580 = !DISubroutineType(types: !581)
!581 = !{!84}
!582 = !{!577, !583}
!583 = !DILocalVariable(name: "reg", scope: !578, file: !579, line: 190, type: !280)
!584 = !DILocation(line: 0, scope: !578, inlinedAt: !585)
!585 = distinct !DILocation(line: 497, column: 12, scope: !586, inlinedAt: !587)
!586 = distinct !DISubprogram(name: "esp_cpu_dbgr_is_attached", scope: !262, file: !262, line: 494, type: !580, scopeLine: 495, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !571)
!587 = distinct !DILocation(line: 29, column: 9, scope: !588)
!588 = distinct !DILexicalBlock(scope: !572, file: !554, line: 29, column: 9)
!589 = !DILocation(line: 191, column: 5, scope: !578, inlinedAt: !585)
!590 = !{i64 2148037548}
!591 = !DILocation(line: 192, column: 23, scope: !578, inlinedAt: !585)
!592 = !DILocation(line: 192, column: 12, scope: !578, inlinedAt: !585)
!593 = !DILocation(line: 29, column: 9, scope: !572)
!594 = !DILocation(line: 197, column: 5, scope: !595, inlinedAt: !596)
!595 = distinct !DISubprogram(name: "xt_utils_dbgr_break", scope: !579, file: !579, line: 195, type: !71, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !571)
!596 = distinct !DILocation(line: 509, column: 5, scope: !597, inlinedAt: !598)
!597 = distinct !DISubprogram(name: "esp_cpu_dbgr_break", scope: !262, file: !262, line: 506, type: !71, scopeLine: 507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !571)
!598 = distinct !DILocation(line: 30, column: 9, scope: !599)
!599 = distinct !DILexicalBlock(scope: !588, file: !554, line: 29, column: 37)
!600 = !{i64 513401}
!601 = !DILocation(line: 31, column: 5, scope: !599)
!602 = !DILocation(line: 32, column: 5, scope: !572)
!603 = distinct !{!603, !602, !604}
!604 = !DILocation(line: 33, column: 5, scope: !572)
!605 = distinct !DISubprogram(name: "call_start_cpu0", scope: !361, file: !361, line: 22, type: !71, scopeLine: 23, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !606)
!606 = !{!607, !626}
!607 = !DILocalVariable(name: "bs", scope: !605, file: !361, line: 38, type: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !609, line: 32, baseType: !610)
!609 = !DIFile(filename: "esp-idf/components/bootloader_support/private_include/bootloader_config.h", directory: "/home/mjshen/RTOSExploration/esp")
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !609, line: 25, size: 1280, elements: !611)
!611 = !{!612, !618, !619, !620, !624, !625}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !610, file: !609, line: 26, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !16, line: 71, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 68, size: 64, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !614, file: !16, line: 69, baseType: !39, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !614, file: !16, line: 70, baseType: !39, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !610, file: !609, line: 27, baseType: !613, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !610, file: !609, line: 28, baseType: !613, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !610, file: !609, line: 29, baseType: !621, size: 1024, offset: 192)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 1024, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 16)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !610, file: !609, line: 30, baseType: !39, size: 32, offset: 1216)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !610, file: !609, line: 31, baseType: !39, size: 32, offset: 1248)
!626 = !DILocalVariable(name: "boot_index", scope: !605, file: !361, line: 39, type: !36)
!627 = !DILocation(line: 25, column: 9, scope: !628)
!628 = distinct !DILexicalBlock(scope: !605, file: !361, line: 25, column: 9)
!629 = !DILocation(line: 25, column: 27, scope: !628)
!630 = !DILocation(line: 25, column: 9, scope: !605)
!631 = !DILocation(line: 26, column: 9, scope: !632)
!632 = distinct !DILexicalBlock(scope: !628, file: !361, line: 25, column: 38)
!633 = !DILocation(line: 38, column: 5, scope: !605)
!634 = !DILocation(line: 38, column: 24, scope: !605)
!635 = !DILocation(line: 39, column: 22, scope: !605)
!636 = !DILocalVariable(name: "bs", arg: 1, scope: !637, file: !361, line: 52, type: !640)
!637 = distinct !DISubprogram(name: "select_partition_number", scope: !361, file: !361, line: 52, type: !638, scopeLine: 53, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !641)
!638 = !DISubroutineType(types: !639)
!639 = !{!36, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!641 = !{!636}
!642 = !DILocation(line: 0, scope: !637, inlinedAt: !643)
!643 = distinct !DILocation(line: 39, column: 22, scope: !605)
!644 = !DILocation(line: 55, column: 10, scope: !645, inlinedAt: !643)
!645 = distinct !DILexicalBlock(scope: !637, file: !361, line: 55, column: 9)
!646 = !DILocation(line: 55, column: 9, scope: !637, inlinedAt: !643)
!647 = !DILocation(line: 56, column: 9, scope: !648, inlinedAt: !643)
!648 = distinct !DILexicalBlock(scope: !649, file: !361, line: 56, column: 9)
!649 = distinct !DILexicalBlock(scope: !650, file: !361, line: 56, column: 9)
!650 = distinct !DILexicalBlock(scope: !651, file: !361, line: 56, column: 9)
!651 = distinct !DILexicalBlock(scope: !645, file: !361, line: 55, column: 55)
!652 = !DILocation(line: 0, scope: !605)
!653 = !DILocation(line: 40, column: 9, scope: !605)
!654 = !DILocation(line: 61, column: 12, scope: !637, inlinedAt: !643)
!655 = !DILocation(line: 40, column: 20, scope: !656)
!656 = distinct !DILexicalBlock(scope: !605, file: !361, line: 40, column: 9)
!657 = !DILocation(line: 41, column: 9, scope: !658)
!658 = distinct !DILexicalBlock(scope: !656, file: !361, line: 40, column: 38)
!659 = !DILocation(line: 45, column: 5, scope: !605)
!660 = !DILocation(line: 48, column: 5, scope: !605)
!661 = distinct !DISubprogram(name: "__getreent", scope: !361, file: !361, line: 65, type: !662, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !571)
!662 = !DISubroutineType(types: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !666, line: 377, size: 1920, elements: !667)
!666 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/reent.h", directory: "/home/mjshen/RTOSExploration/esp")
!667 = !{!668, !669, !747, !748, !749, !750, !751, !752, !753, !757, !778, !782, !783, !784, !785, !794, !807, !808, !813, !830, !831, !838, !839, !855}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !665, file: !666, line: 381, baseType: !36, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !665, file: !666, line: 386, baseType: !670, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !666, line: 292, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !666, line: 186, size: 832, elements: !673)
!673 = !{!674, !675, !676, !677, !679, !680, !685, !686, !687, !688, !692, !696, !702, !706, !707, !708, !709, !711, !715, !716, !717, !719, !731, !746}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !672, file: !666, line: 187, baseType: !393, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !672, file: !666, line: 188, baseType: !36, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !672, file: !666, line: 189, baseType: !36, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !672, file: !666, line: 190, baseType: !678, size: 16, offset: 96)
!678 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !672, file: !666, line: 191, baseType: !678, size: 16, offset: 112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !672, file: !666, line: 192, baseType: !681, size: 64, offset: 128)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !666, line: 122, size: 64, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !681, file: !666, line: 123, baseType: !393, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !681, file: !666, line: 124, baseType: !36, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !672, file: !666, line: 193, baseType: !36, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !672, file: !666, line: 196, baseType: !664, size: 32, offset: 224)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !672, file: !666, line: 200, baseType: !35, size: 32, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !672, file: !666, line: 202, baseType: !689, size: 32, offset: 288)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = !DISubroutineType(types: !691)
!691 = !{!36, !664, !35, !419, !36}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !672, file: !666, line: 204, baseType: !693, size: 32, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DISubroutineType(types: !695)
!695 = !{!36, !664, !35, !81, !36}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !672, file: !666, line: 207, baseType: !697, size: 32, offset: 352)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!698 = !DISubroutineType(types: !699)
!699 = !{!700, !664, !35, !700, !36}
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !160, line: 116, baseType: !701)
!701 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !672, file: !666, line: 208, baseType: !703, size: 32, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!704 = !DISubroutineType(types: !705)
!705 = !{!36, !664, !35}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !672, file: !666, line: 211, baseType: !681, size: 64, offset: 416)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !672, file: !666, line: 212, baseType: !393, size: 32, offset: 480)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !672, file: !666, line: 213, baseType: !36, size: 32, offset: 512)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !672, file: !666, line: 216, baseType: !710, size: 24, offset: 544)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 24, elements: !246)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !672, file: !666, line: 217, baseType: !712, size: 8, offset: 568)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 1)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !672, file: !666, line: 220, baseType: !681, size: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !672, file: !666, line: 223, baseType: !36, size: 32, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !672, file: !666, line: 224, baseType: !718, size: 32, offset: 672)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !160, line: 46, baseType: !701)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !672, file: !666, line: 231, baseType: !720, size: 32, offset: 704)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !666, line: 35, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !722, line: 34, baseType: !723)
!722 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !725, line: 23, size: 736, elements: !726)
!725 = !DIFile(filename: "esp-idf/components/newlib/platform_include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !724, file: !725, line: 24, baseType: !728, size: 736)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 736, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 23)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !672, file: !666, line: 233, baseType: !732, size: 64, offset: 736)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !160, line: 170, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 162, size: 64, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !733, file: !160, line: 164, baseType: !36, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !733, file: !160, line: 169, baseType: !737, size: 32, offset: 32)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !733, file: !160, line: 165, size: 32, elements: !738)
!738 = !{!739, !742}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !737, file: !160, line: 167, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !741, line: 116, baseType: !17)
!741 = !DIFile(filename: "xtensa-esp32-elf-clang/lib/clang/14.0.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/esp")
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !737, file: !160, line: 168, baseType: !743, size: 32)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 4)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !672, file: !666, line: 234, baseType: !36, size: 32, offset: 800)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !665, file: !666, line: 386, baseType: !670, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !665, file: !666, line: 386, baseType: !670, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !665, file: !666, line: 388, baseType: !36, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !665, file: !666, line: 390, baseType: !419, size: 32, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !665, file: !666, line: 392, baseType: !36, size: 32, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !665, file: !666, line: 394, baseType: !36, size: 32, offset: 224)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !665, file: !666, line: 395, baseType: !754, size: 32, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !756, line: 9, flags: DIFlagFwdDecl)
!756 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/_locale.h", directory: "/home/mjshen/RTOSExploration/esp")
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !665, file: !666, line: 397, baseType: !758, size: 32, offset: 288)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !666, line: 349, size: 128, elements: !760)
!760 = !{!761, !774, !775, !776}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !759, file: !666, line: 352, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !666, line: 52, size: 192, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !763, file: !666, line: 54, baseType: !762, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !763, file: !666, line: 55, baseType: !36, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !763, file: !666, line: 55, baseType: !36, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !763, file: !666, line: 55, baseType: !36, size: 32, offset: 96)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !763, file: !666, line: 55, baseType: !36, size: 32, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !763, file: !666, line: 56, baseType: !771, size: 32, offset: 160)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 32, elements: !713)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !666, line: 22, baseType: !773)
!773 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !759, file: !666, line: 353, baseType: !36, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !759, file: !666, line: 354, baseType: !762, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !759, file: !666, line: 355, baseType: !777, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !665, file: !666, line: 399, baseType: !779, size: 32, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !664}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !665, file: !666, line: 401, baseType: !36, size: 32, offset: 352)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !665, file: !666, line: 404, baseType: !36, size: 32, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !665, file: !666, line: 405, baseType: !419, size: 32, offset: 416)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !665, file: !666, line: 407, baseType: !786, size: 32, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !666, line: 324, size: 192, elements: !788)
!788 = !{!789, !791, !792, !793}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !787, file: !666, line: 325, baseType: !790, size: 48)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !246)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !787, file: !666, line: 326, baseType: !790, size: 48, offset: 48)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !787, file: !666, line: 327, baseType: !7, size: 16, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !787, file: !666, line: 330, baseType: !229, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !665, file: !666, line: 408, baseType: !795, size: 32, offset: 480)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !666, line: 60, size: 288, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !796, file: !666, line: 62, baseType: !36, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !796, file: !666, line: 63, baseType: !36, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !796, file: !666, line: 64, baseType: !36, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !796, file: !666, line: 65, baseType: !36, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !796, file: !666, line: 66, baseType: !36, size: 32, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !796, file: !666, line: 67, baseType: !36, size: 32, offset: 160)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !796, file: !666, line: 68, baseType: !36, size: 32, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !796, file: !666, line: 69, baseType: !36, size: 32, offset: 224)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !796, file: !666, line: 70, baseType: !36, size: 32, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !665, file: !666, line: 409, baseType: !419, size: 32, offset: 512)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !665, file: !666, line: 412, baseType: !809, size: 32, offset: 544)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !36}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !665, file: !666, line: 416, baseType: !814, size: 32, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !666, line: 90, size: 1120, elements: !816)
!816 = !{!817, !818, !819, !821}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !815, file: !666, line: 91, baseType: !814, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !815, file: !666, line: 92, baseType: !36, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !815, file: !666, line: 93, baseType: !820, size: 1024, offset: 64)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1024, elements: !292)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !815, file: !666, line: 94, baseType: !822, size: 32, offset: 1088)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !666, line: 79, size: 2112, elements: !824)
!824 = !{!825, !827, !828, !829}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !823, file: !666, line: 80, baseType: !826, size: 1024)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1024, elements: !292)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !823, file: !666, line: 81, baseType: !826, size: 1024, offset: 1024)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !823, file: !666, line: 83, baseType: !772, size: 32, offset: 2048)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !823, file: !666, line: 86, baseType: !772, size: 32, offset: 2080)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !665, file: !666, line: 417, baseType: !815, size: 1120, offset: 608)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !665, file: !666, line: 420, baseType: !832, size: 96, offset: 1728)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !666, line: 296, size: 96, elements: !833)
!833 = !{!834, !836, !837}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !832, file: !666, line: 298, baseType: !835, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !832, file: !666, line: 299, baseType: !36, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !832, file: !666, line: 300, baseType: !670, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !665, file: !666, line: 421, baseType: !670, size: 32, offset: 1824)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !665, file: !666, line: 422, baseType: !840, size: 32, offset: 1856)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !666, line: 359, size: 640, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !849, !850, !851, !852, !853, !854}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !841, file: !666, line: 362, baseType: !419, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !841, file: !666, line: 363, baseType: !732, size: 64, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !841, file: !666, line: 364, baseType: !732, size: 64, offset: 96)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !841, file: !666, line: 365, baseType: !732, size: 64, offset: 160)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !841, file: !666, line: 366, baseType: !848, size: 64, offset: 224)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !253)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !841, file: !666, line: 367, baseType: !36, size: 32, offset: 288)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !841, file: !666, line: 368, baseType: !732, size: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !841, file: !666, line: 369, baseType: !732, size: 64, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !841, file: !666, line: 370, baseType: !732, size: 64, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !841, file: !666, line: 371, baseType: !732, size: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !841, file: !666, line: 372, baseType: !732, size: 64, offset: 576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !665, file: !666, line: 423, baseType: !419, size: 32, offset: 1888)
!856 = !DILocation(line: 67, column: 12, scope: !661)
!857 = !{!858, !858, i64 0}
!858 = !{!"any pointer", !544, i64 0}
!859 = !DILocation(line: 67, column: 5, scope: !661)
!860 = distinct !DISubprogram(name: "bootloader_common_get_partition_description", scope: !48, file: !48, line: 123, type: !861, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !893)
!861 = !DISubroutineType(types: !862)
!862 = !{!863, !865, !872}
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_err_t", file: !864, line: 19, baseType: !36)
!864 = !DIFile(filename: "esp-idf/components/esp_common/include/esp_err.h", directory: "/home/mjshen/RTOSExploration/esp")
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !16, line: 71, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 68, size: 64, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !868, file: !16, line: 69, baseType: !39, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !868, file: !16, line: 70, baseType: !39, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_app_desc_t", file: !874, line: 35, baseType: !875)
!874 = !DIFile(filename: "esp-idf/components/esp_app_format/include/esp_app_desc.h", directory: "/home/mjshen/RTOSExploration/esp")
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !874, line: 24, size: 2048, elements: !876)
!876 = !{!877, !878, !879, !880, !882, !883, !885, !886, !887, !889}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "magic_word", scope: !875, file: !874, line: 25, baseType: !39, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "secure_version", scope: !875, file: !874, line: 26, baseType: !39, size: 32, offset: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reserv1", scope: !875, file: !874, line: 27, baseType: !142, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !875, file: !874, line: 28, baseType: !881, size: 256, offset: 128)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, elements: !292)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "project_name", scope: !875, file: !874, line: 29, baseType: !881, size: 256, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !875, file: !874, line: 30, baseType: !884, size: 128, offset: 640)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, elements: !622)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !875, file: !874, line: 31, baseType: !884, size: 128, offset: 768)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "idf_ver", scope: !875, file: !874, line: 32, baseType: !881, size: 256, offset: 896)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "app_elf_sha256", scope: !875, file: !874, line: 33, baseType: !888, size: 256, offset: 1152)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 256, elements: !292)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "reserv2", scope: !875, file: !874, line: 34, baseType: !890, size: 640, offset: 1408)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 640, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 20)
!893 = !{!894, !895, !896, !897, !898}
!894 = !DILocalVariable(name: "partition", arg: 1, scope: !860, file: !48, line: 123, type: !865)
!895 = !DILocalVariable(name: "app_desc", arg: 2, scope: !860, file: !48, line: 123, type: !872)
!896 = !DILocalVariable(name: "app_desc_offset", scope: !860, file: !48, line: 129, type: !137)
!897 = !DILocalVariable(name: "mmap_size", scope: !860, file: !48, line: 130, type: !137)
!898 = !DILocalVariable(name: "image", scope: !860, file: !48, line: 131, type: !899)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!900 = !DILocation(line: 0, scope: !860)
!901 = !DILocation(line: 125, column: 19, scope: !902)
!902 = distinct !DILexicalBlock(scope: !860, file: !48, line: 125, column: 9)
!903 = !DILocation(line: 125, column: 27, scope: !902)
!904 = !DILocation(line: 125, column: 61, scope: !902)
!905 = !{!906, !543, i64 0}
!906 = !{!"", !543, i64 0, !543, i64 4}
!907 = !DILocation(line: 125, column: 68, scope: !902)
!908 = !DILocation(line: 125, column: 9, scope: !860)
!909 = !DILocation(line: 131, column: 28, scope: !860)
!910 = !DILocation(line: 132, column: 15, scope: !911)
!911 = distinct !DILexicalBlock(scope: !860, file: !48, line: 132, column: 9)
!912 = !DILocation(line: 132, column: 9, scope: !860)
!913 = !DILocation(line: 133, column: 9, scope: !914)
!914 = distinct !DILexicalBlock(scope: !915, file: !48, line: 133, column: 9)
!915 = distinct !DILexicalBlock(scope: !916, file: !48, line: 133, column: 9)
!916 = distinct !DILexicalBlock(scope: !917, file: !48, line: 133, column: 9)
!917 = distinct !DILexicalBlock(scope: !911, file: !48, line: 132, column: 24)
!918 = !DILocation(line: 134, column: 9, scope: !917)
!919 = !DILocation(line: 137, column: 28, scope: !860)
!920 = !DILocation(line: 137, column: 5, scope: !860)
!921 = !DILocation(line: 138, column: 5, scope: !860)
!922 = !DILocation(line: 140, column: 19, scope: !923)
!923 = distinct !DILexicalBlock(scope: !860, file: !48, line: 140, column: 9)
!924 = !{!925, !543, i64 0}
!925 = !{!"", !543, i64 0, !543, i64 4, !544, i64 8, !544, i64 16, !544, i64 48, !544, i64 80, !544, i64 96, !544, i64 112, !544, i64 144, !544, i64 176}
!926 = !DILocation(line: 140, column: 30, scope: !923)
!927 = !DILocation(line: 145, column: 1, scope: !860)
!928 = !DISubprogram(name: "memcpy", scope: !929, file: !929, line: 31, type: !930, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !571)
!929 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/string.h", directory: "/home/mjshen/RTOSExploration/esp")
!930 = !DISubroutineType(types: !931)
!931 = !{!35, !932, !933, !157}
!932 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !35)
!933 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!936 = distinct !DISubprogram(name: "bootloader_utility_load_partition_table", scope: !48, file: !48, line: 148, type: !937, scopeLine: 149, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !950)
!937 = !DISubroutineType(types: !938)
!938 = !{!84, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !609, line: 32, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !609, line: 25, size: 1280, elements: !942)
!942 = !{!943, !944, !945, !946, !948, !949}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !941, file: !609, line: 26, baseType: !867, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !941, file: !609, line: 27, baseType: !867, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !941, file: !609, line: 28, baseType: !867, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !941, file: !609, line: 29, baseType: !947, size: 1024, offset: 192)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 1024, elements: !622)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !941, file: !609, line: 30, baseType: !39, size: 32, offset: 1216)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !941, file: !609, line: 31, baseType: !39, size: 32, offset: 1248)
!950 = !{!951, !952, !967, !968, !969, !970, !972}
!951 = !DILocalVariable(name: "bs", arg: 1, scope: !936, file: !48, line: 148, type: !939)
!952 = !DILocalVariable(name: "partitions", scope: !936, file: !48, line: 150, type: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_info_t", file: !16, line: 83, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 76, size: 256, elements: !957)
!957 = !{!958, !961, !962, !963, !964, !966}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !956, file: !16, line: 77, baseType: !959, size: 16)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !40, line: 36, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !42, line: 57, baseType: !7)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !956, file: !16, line: 78, baseType: !44, size: 8, offset: 16)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !956, file: !16, line: 79, baseType: !44, size: 8, offset: 24)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !956, file: !16, line: 80, baseType: !867, size: 64, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !956, file: !16, line: 81, baseType: !965, size: 128, offset: 96)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, elements: !622)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !956, file: !16, line: 82, baseType: !39, size: 32, offset: 224)
!967 = !DILocalVariable(name: "partition_usage", scope: !936, file: !48, line: 151, type: !81)
!968 = !DILocalVariable(name: "err", scope: !936, file: !48, line: 152, type: !863)
!969 = !DILocalVariable(name: "num_partitions", scope: !936, file: !48, line: 153, type: !36)
!970 = !DILocalVariable(name: "i", scope: !971, file: !48, line: 171, type: !36)
!971 = distinct !DILexicalBlock(scope: !936, file: !48, line: 171, column: 5)
!972 = !DILocalVariable(name: "partition", scope: !973, file: !48, line: 172, type: !953)
!973 = distinct !DILexicalBlock(scope: !974, file: !48, line: 171, column: 46)
!974 = distinct !DILexicalBlock(scope: !971, file: !48, line: 171, column: 5)
!975 = !DILocation(line: 0, scope: !936)
!976 = !DILocation(line: 153, column: 5, scope: !936)
!977 = !DILocation(line: 155, column: 18, scope: !936)
!978 = !DILocation(line: 156, column: 10, scope: !979)
!979 = distinct !DILexicalBlock(scope: !936, file: !48, line: 156, column: 9)
!980 = !DILocation(line: 156, column: 9, scope: !936)
!981 = !DILocation(line: 157, column: 9, scope: !982)
!982 = distinct !DILexicalBlock(scope: !983, file: !48, line: 157, column: 9)
!983 = distinct !DILexicalBlock(scope: !984, file: !48, line: 157, column: 9)
!984 = distinct !DILexicalBlock(scope: !985, file: !48, line: 157, column: 9)
!985 = distinct !DILexicalBlock(scope: !979, file: !48, line: 156, column: 22)
!986 = !DILocation(line: 158, column: 9, scope: !985)
!987 = !DILocation(line: 162, column: 11, scope: !936)
!988 = !DILocation(line: 163, column: 13, scope: !989)
!989 = distinct !DILexicalBlock(scope: !936, file: !48, line: 163, column: 9)
!990 = !DILocation(line: 163, column: 9, scope: !936)
!991 = !DILocation(line: 164, column: 9, scope: !992)
!992 = distinct !DILexicalBlock(scope: !993, file: !48, line: 164, column: 9)
!993 = distinct !DILexicalBlock(scope: !994, file: !48, line: 164, column: 9)
!994 = distinct !DILexicalBlock(scope: !995, file: !48, line: 164, column: 9)
!995 = distinct !DILexicalBlock(scope: !989, file: !48, line: 163, column: 24)
!996 = !DILocation(line: 165, column: 9, scope: !995)
!997 = !DILocation(line: 168, column: 5, scope: !998)
!998 = distinct !DILexicalBlock(scope: !999, file: !48, line: 168, column: 5)
!999 = distinct !DILexicalBlock(scope: !1000, file: !48, line: 168, column: 5)
!1000 = distinct !DILexicalBlock(scope: !936, file: !48, line: 168, column: 5)
!1001 = !DILocation(line: 169, column: 5, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !48, line: 169, column: 5)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !48, line: 169, column: 5)
!1004 = distinct !DILexicalBlock(scope: !936, file: !48, line: 169, column: 5)
!1005 = !DILocation(line: 0, scope: !971)
!1006 = !DILocation(line: 171, column: 25, scope: !974)
!1007 = !DILocation(line: 171, column: 23, scope: !974)
!1008 = !DILocation(line: 171, column: 5, scope: !971)
!1009 = !DILocation(line: 237, column: 5, scope: !936)
!1010 = !DILocation(line: 239, column: 5, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !48, line: 239, column: 5)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !48, line: 239, column: 5)
!1013 = distinct !DILexicalBlock(scope: !936, file: !48, line: 239, column: 5)
!1014 = !DILocation(line: 240, column: 5, scope: !936)
!1015 = !DILocation(line: 0, scope: !973)
!1016 = !DILocation(line: 178, column: 28, scope: !973)
!1017 = !{!1018, !544, i64 2}
!1018 = !{!"", !1019, i64 0, !544, i64 2, !544, i64 3, !906, i64 4, !544, i64 12, !543, i64 28}
!1019 = !{!"short", !544, i64 0}
!1020 = !DILocation(line: 178, column: 9, scope: !973)
!1021 = !DILocation(line: 180, column: 32, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !973, file: !48, line: 178, column: 34)
!1023 = !{!1018, !544, i64 3}
!1024 = !DILocation(line: 180, column: 21, scope: !1022)
!1025 = !DILocation(line: 180, column: 13, scope: !1022)
!1026 = !DILocation(line: 182, column: 42, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1022, file: !48, line: 180, column: 41)
!1028 = !DILocation(line: 184, column: 17, scope: !1027)
!1029 = !DILocation(line: 186, column: 39, scope: !1027)
!1030 = !DILocation(line: 188, column: 17, scope: !1027)
!1031 = !DILocation(line: 191, column: 41, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1027, file: !48, line: 191, column: 21)
!1033 = !DILocation(line: 191, column: 67, scope: !1032)
!1034 = !DILocation(line: 191, column: 21, scope: !1027)
!1035 = !DILocation(line: 192, column: 48, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1032, file: !48, line: 191, column: 93)
!1037 = !DILocation(line: 192, column: 21, scope: !1036)
!1038 = !DILocation(line: 192, column: 86, scope: !1036)
!1039 = !DILocation(line: 193, column: 21, scope: !1036)
!1040 = !{!1041, !543, i64 152}
!1041 = !{!"", !906, i64 0, !906, i64 8, !906, i64 16, !544, i64 24, !543, i64 152, !543, i64 156}
!1042 = !DILocation(line: 195, column: 17, scope: !1036)
!1043 = !DILocation(line: 202, column: 32, scope: !1022)
!1044 = !DILocation(line: 202, column: 13, scope: !1022)
!1045 = !DILocation(line: 204, column: 43, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1022, file: !48, line: 202, column: 41)
!1047 = !DILocation(line: 206, column: 17, scope: !1046)
!1048 = !DILocation(line: 212, column: 17, scope: !1046)
!1049 = !DILocation(line: 215, column: 17, scope: !1046)
!1050 = !DILocation(line: 221, column: 17, scope: !1046)
!1051 = !DILocation(line: 224, column: 17, scope: !1046)
!1052 = !DILocation(line: 232, column: 9, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !48, line: 232, column: 9)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !48, line: 232, column: 9)
!1055 = distinct !DILexicalBlock(scope: !973, file: !48, line: 232, column: 9)
!1056 = !{!1018, !543, i64 4}
!1057 = !{!1018, !543, i64 8}
!1058 = !DILocation(line: 171, column: 42, scope: !974)
!1059 = distinct !{!1059, !1008, !1060, !1061}
!1060 = !DILocation(line: 235, column: 5, scope: !971)
!1061 = !{!"llvm.loop.mustprogress"}
!1062 = !DILocation(line: 241, column: 1, scope: !936)
!1063 = distinct !DISubprogram(name: "bootloader_utility_get_selected_boot_partition", scope: !48, file: !48, line: 347, type: !1064, scopeLine: 348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1068)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!36, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!1068 = !{!1069, !1070, !1080, !1081, !1084}
!1069 = !DILocalVariable(name: "bs", arg: 1, scope: !1063, file: !48, line: 347, type: !1066)
!1070 = !DILocalVariable(name: "otadata", scope: !1063, file: !48, line: 349, type: !1071)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 512, elements: !143)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_ota_select_entry_t", file: !16, line: 65, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 60, size: 256, elements: !1074)
!1074 = !{!1075, !1076, !1078, !1079}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ota_seq", scope: !1073, file: !16, line: 61, baseType: !39, size: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "seq_label", scope: !1073, file: !16, line: 62, baseType: !1077, size: 160, offset: 32)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !891)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ota_state", scope: !1073, file: !16, line: 63, baseType: !39, size: 32, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !1073, file: !16, line: 64, baseType: !39, size: 32, offset: 224)
!1080 = !DILocalVariable(name: "boot_index", scope: !1063, file: !48, line: 350, type: !36)
!1081 = !DILocalVariable(name: "active_otadata", scope: !1082, file: !48, line: 395, type: !36)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !48, line: 394, column: 12)
!1083 = distinct !DILexicalBlock(scope: !1063, file: !48, line: 376, column: 9)
!1084 = !DILocalVariable(name: "ota_seq", scope: !1085, file: !48, line: 411, type: !39)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !48, line: 409, column: 35)
!1086 = distinct !DILexicalBlock(scope: !1082, file: !48, line: 409, column: 13)
!1087 = !DILocation(line: 0, scope: !1063)
!1088 = !DILocation(line: 349, column: 5, scope: !1063)
!1089 = !DILocation(line: 349, column: 28, scope: !1063)
!1090 = !DILocation(line: 352, column: 22, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1063, file: !48, line: 352, column: 9)
!1092 = !{!1041, !543, i64 0}
!1093 = !DILocation(line: 352, column: 29, scope: !1091)
!1094 = !DILocation(line: 352, column: 9, scope: !1063)
!1095 = !DILocation(line: 356, column: 9, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1063, file: !48, line: 356, column: 9)
!1097 = !DILocalVariable(name: "ota_info", arg: 1, scope: !1098, file: !48, line: 96, type: !865)
!1098 = distinct !DISubprogram(name: "read_otadata", scope: !48, file: !48, line: 96, type: !1099, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1102)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!863, !865, !1101}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 32)
!1102 = !{!1097, !1103, !1104}
!1103 = !DILocalVariable(name: "two_otadata", arg: 2, scope: !1098, file: !48, line: 96, type: !1101)
!1104 = !DILocalVariable(name: "ota_select_map", scope: !1098, file: !48, line: 98, type: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1072)
!1107 = !DILocation(line: 0, scope: !1098, inlinedAt: !1108)
!1108 = distinct !DILocation(line: 356, column: 9, scope: !1096)
!1109 = !DILocation(line: 99, column: 19, scope: !1110, inlinedAt: !1108)
!1110 = distinct !DILexicalBlock(scope: !1098, file: !48, line: 99, column: 9)
!1111 = !DILocation(line: 99, column: 26, scope: !1110, inlinedAt: !1108)
!1112 = !DILocation(line: 99, column: 9, scope: !1098, inlinedAt: !1108)
!1113 = !DILocation(line: 104, column: 19, scope: !1114, inlinedAt: !1108)
!1114 = distinct !DILexicalBlock(scope: !1098, file: !48, line: 104, column: 9)
!1115 = !{!906, !543, i64 4}
!1116 = !DILocation(line: 104, column: 24, scope: !1114, inlinedAt: !1108)
!1117 = !DILocation(line: 104, column: 9, scope: !1098, inlinedAt: !1108)
!1118 = !DILocation(line: 105, column: 9, scope: !1119, inlinedAt: !1108)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !48, line: 105, column: 9)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !48, line: 105, column: 9)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !48, line: 105, column: 9)
!1122 = distinct !DILexicalBlock(scope: !1114, file: !48, line: 104, column: 44)
!1123 = !DILocation(line: 106, column: 9, scope: !1122, inlinedAt: !1108)
!1124 = !DILocation(line: 110, column: 22, scope: !1098, inlinedAt: !1108)
!1125 = !DILocation(line: 111, column: 10, scope: !1126, inlinedAt: !1108)
!1126 = distinct !DILexicalBlock(scope: !1098, file: !48, line: 111, column: 9)
!1127 = !DILocation(line: 111, column: 9, scope: !1098, inlinedAt: !1108)
!1128 = !DILocation(line: 112, column: 9, scope: !1129, inlinedAt: !1108)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !48, line: 112, column: 9)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !48, line: 112, column: 9)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !48, line: 112, column: 9)
!1132 = distinct !DILexicalBlock(scope: !1126, file: !48, line: 111, column: 26)
!1133 = !DILocation(line: 113, column: 9, scope: !1132, inlinedAt: !1108)
!1134 = !DILocation(line: 116, column: 5, scope: !1098, inlinedAt: !1108)
!1135 = !DILocation(line: 117, column: 13, scope: !1098, inlinedAt: !1108)
!1136 = !DILocation(line: 117, column: 55, scope: !1098, inlinedAt: !1108)
!1137 = !DILocation(line: 117, column: 5, scope: !1098, inlinedAt: !1108)
!1138 = !DILocation(line: 118, column: 5, scope: !1098, inlinedAt: !1108)
!1139 = !DILocation(line: 359, column: 30, scope: !1063)
!1140 = !DILocation(line: 376, column: 10, scope: !1083)
!1141 = !DILocation(line: 376, column: 60, scope: !1083)
!1142 = !DILocation(line: 377, column: 13, scope: !1083)
!1143 = !DILocation(line: 377, column: 64, scope: !1083)
!1144 = !DILocation(line: 378, column: 17, scope: !1083)
!1145 = !DILocation(line: 378, column: 27, scope: !1083)
!1146 = !DILocation(line: 376, column: 9, scope: !1063)
!1147 = !DILocation(line: 380, column: 25, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1149, file: !48, line: 380, column: 13)
!1149 = distinct !DILexicalBlock(scope: !1083, file: !48, line: 378, column: 33)
!1150 = !{!1041, !543, i64 8}
!1151 = !DILocation(line: 380, column: 32, scope: !1148)
!1152 = !DILocation(line: 0, scope: !1148)
!1153 = !DILocation(line: 380, column: 13, scope: !1149)
!1154 = !DILocation(line: 381, column: 13, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !48, line: 381, column: 13)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !48, line: 381, column: 13)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !48, line: 381, column: 13)
!1158 = distinct !DILexicalBlock(scope: !1148, file: !48, line: 380, column: 38)
!1159 = !DILocation(line: 383, column: 9, scope: !1158)
!1160 = !DILocation(line: 384, column: 13, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !48, line: 384, column: 13)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !48, line: 384, column: 13)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !48, line: 384, column: 13)
!1164 = distinct !DILexicalBlock(scope: !1148, file: !48, line: 383, column: 16)
!1165 = !DILocation(line: 387, column: 29, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1164, file: !48, line: 387, column: 17)
!1167 = !{!1168, !543, i64 0}
!1168 = !{!"", !543, i64 0, !544, i64 4, !543, i64 24, !543, i64 28}
!1169 = !DILocation(line: 387, column: 37, scope: !1166)
!1170 = !DILocation(line: 387, column: 51, scope: !1166)
!1171 = !DILocation(line: 387, column: 65, scope: !1166)
!1172 = !{!1168, !543, i64 28}
!1173 = !DILocation(line: 387, column: 72, scope: !1166)
!1174 = !DILocation(line: 387, column: 69, scope: !1166)
!1175 = !DILocation(line: 387, column: 119, scope: !1166)
!1176 = !DILocation(line: 388, column: 33, scope: !1166)
!1177 = !DILocation(line: 388, column: 41, scope: !1166)
!1178 = !DILocation(line: 388, column: 55, scope: !1166)
!1179 = !DILocation(line: 388, column: 69, scope: !1166)
!1180 = !DILocation(line: 388, column: 76, scope: !1166)
!1181 = !DILocation(line: 388, column: 73, scope: !1166)
!1182 = !DILocation(line: 387, column: 17, scope: !1164)
!1183 = !DILocation(line: 391, column: 42, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1166, file: !48, line: 388, column: 124)
!1185 = !DILocation(line: 392, column: 13, scope: !1184)
!1186 = !DILocation(line: 395, column: 30, scope: !1082)
!1187 = !DILocation(line: 0, scope: !1082)
!1188 = !DILocation(line: 409, column: 28, scope: !1086)
!1189 = !DILocation(line: 409, column: 13, scope: !1082)
!1190 = !DILocation(line: 411, column: 56, scope: !1085)
!1191 = !DILocation(line: 411, column: 64, scope: !1085)
!1192 = !DILocation(line: 0, scope: !1085)
!1193 = !DILocation(line: 412, column: 40, scope: !1085)
!1194 = !DILocation(line: 412, column: 34, scope: !1085)
!1195 = !DILocation(line: 428, column: 9, scope: !1085)
!1196 = !DILocation(line: 428, column: 32, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1086, file: !48, line: 428, column: 20)
!1198 = !DILocation(line: 428, column: 39, scope: !1197)
!1199 = !DILocation(line: 0, scope: !1197)
!1200 = !DILocation(line: 428, column: 20, scope: !1086)
!1201 = !DILocation(line: 429, column: 13, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1203, file: !48, line: 429, column: 13)
!1203 = distinct !DILexicalBlock(scope: !1204, file: !48, line: 429, column: 13)
!1204 = distinct !DILexicalBlock(scope: !1205, file: !48, line: 429, column: 13)
!1205 = distinct !DILexicalBlock(scope: !1197, file: !48, line: 428, column: 45)
!1206 = !DILocation(line: 431, column: 9, scope: !1205)
!1207 = !DILocation(line: 432, column: 13, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !48, line: 432, column: 13)
!1209 = distinct !DILexicalBlock(scope: !1210, file: !48, line: 432, column: 13)
!1210 = distinct !DILexicalBlock(scope: !1211, file: !48, line: 432, column: 13)
!1211 = distinct !DILexicalBlock(scope: !1197, file: !48, line: 431, column: 16)
!1212 = !DILocation(line: 438, column: 1, scope: !1063)
!1213 = distinct !DISubprogram(name: "bootloader_utility_load_boot_image", scope: !48, file: !48, line: 503, type: !1214, scopeLine: 504, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1216)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{null, !1066, !36}
!1216 = !{!1217, !1218, !1219, !1220, !1221}
