; ModuleID = 'build//system/deep_sleep/bootloader/bootloader.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-i8:8:32-i16:16:32-i64:64-n32"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (i32)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque
%struct._mprec = type { %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint** }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%struct._rand48 = type { [3 x i16], [3 x i16], i16, i64 }
%struct.__tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args* }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, %struct._reent*, i8*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i32, %struct.__lock*, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct.__lock = type { [23 x i32] }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!146 = distinct !DIGlobalVariable(name: "words_hashed", scope: !147, file: !155, line: 16, type: !58, isLocal: true, isDefinition: true)
!147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !148, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !149, globals: !152, splitDebugInlining: false, nameTableKind: None)
!148 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_sha.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!149 = !{!150, !54, !136, !133, !56}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_sha256_handle_t", file: !151, line: 19, baseType: !54)
!151 = !DIFile(filename: "esp-idf/components/bootloader_support/private_include/bootloader_sha.h", directory: "/home/mjshen/RTOSExploration/esp")
!152 = !{!153, !161, !181, !145}
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!154 = distinct !DIGlobalVariable(name: "BLOCK_WORDS", scope: !147, file: !155, line: 19, type: !156, isLocal: true, isDefinition: true)
!155 = !DIFile(filename: "esp-idf/components/bootloader_support/src/esp32/bootloader_sha.c", directory: "/home/mjshen/RTOSExploration/esp")
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !158, line: 40, baseType: !159)
!158 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/strings.h", directory: "/home/mjshen/RTOSExploration/esp")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !160, line: 131, baseType: !7)
!160 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "padding", scope: !163, file: !155, line: 91, type: !177, isLocal: true, isDefinition: true)
!163 = distinct !DISubprogram(name: "bootloader_sha256_finish", scope: !155, file: !155, line: 73, type: !164, scopeLine: 74, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !166)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !150, !62}
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175}
!167 = !DILocalVariable(name: "handle", arg: 1, scope: !163, file: !155, line: 73, type: !150)
!168 = !DILocalVariable(name: "digest", arg: 2, scope: !163, file: !155, line: 73, type: !62)
!169 = !DILocalVariable(name: "data_words", scope: !163, file: !155, line: 81, type: !58)
!170 = !DILocalVariable(name: "block_bytes", scope: !163, file: !155, line: 86, type: !55)
!171 = !DILocalVariable(name: "pad_bytes", scope: !163, file: !155, line: 87, type: !55)
!172 = !DILocalVariable(name: "bit_count", scope: !163, file: !155, line: 101, type: !58)
!173 = !DILocalVariable(name: "digest_words", scope: !163, file: !155, line: 110, type: !133)
!174 = !DILocalVariable(name: "sha_text_reg", scope: !163, file: !155, line: 111, type: !133)
!175 = !DILocalVariable(name: "i", scope: !176, file: !155, line: 112, type: !157)
!176 = distinct !DILexicalBlock(scope: !163, file: !155, line: 112, column: 5)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 512, elements: !179)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!179 = !{!180}
!180 = !DISubrange(count: 64)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!182 = distinct !DIGlobalVariable(name: "DIGEST_WORDS", scope: !147, file: !155, line: 21, type: !156, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "rtc_retain_mem", scope: !185, file: !192, line: 119, type: !193, isLocal: false, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !187, retainedTypes: !188, globals: !189, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!187 = !{!35, !25, !127}
!188 = !{!62, !54}
!189 = !{!183, !190}
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "TAG", scope: !185, file: !192, line: 29, type: !100, isLocal: true, isDefinition: true)
!192 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp")
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtc_retain_mem_t", file: !110, line: 54, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 46, size: 128, elements: !197)
!197 = !{!198, !204, !207, !208}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !196, file: !110, line: 47, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !36, line: 71, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 68, size: 64, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !200, file: !36, line: 69, baseType: !58, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !200, file: !36, line: 70, baseType: !58, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reboot_counter", scope: !196, file: !110, line: 48, baseType: !205, size: 16, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !59, line: 36, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !61, line: 57, baseType: !27)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !196, file: !110, line: 49, baseType: !205, size: 16, offset: 80)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !196, file: !110, line: 53, baseType: !58, size: 32, offset: 96)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!210 = distinct !DIGlobalVariable(name: "mapped", scope: !211, file: !225, line: 152, type: !103, isLocal: true, isDefinition: true)
!211 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !220, globals: !221, splitDebugInlining: false, nameTableKind: None)
!212 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!213 = !{!214}
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !215, line: 43, baseType: !7, size: 32, elements: !216)
!215 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_spiflash.h", directory: "/home/mjshen/RTOSExploration/esp")
!216 = !{!217, !218, !219}
!217 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_OK", value: 0)
!218 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_ERR", value: 1)
!219 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_TIMEOUT", value: 2)
!220 = !{!54, !134, !133}
!221 = !{!222, !223, !226}
!222 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "TAG", scope: !211, file: !225, line: 124, type: !100, isLocal: true, isDefinition: true)
!225 = !DIFile(filename: "esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp")
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "current_read_mapping", scope: !211, file: !225, line: 155, type: !58, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "bootloader_image_hdr", scope: !230, file: !259, line: 25, type: !260, isLocal: false, isDefinition: true, align: 32)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !252, globals: !256, splitDebugInlining: false, nameTableKind: None)
!231 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!232 = !{!127, !25, !233, !239, !245}
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !234, line: 21, baseType: !7, size: 32, elements: !235)
!234 = !DIFile(filename: "esp-idf/components/hal/include/hal/wdt_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!235 = !{!236, !237, !238}
!236 = !DIEnumerator(name: "WDT_RWDT", value: 0)
!237 = !DIEnumerator(name: "WDT_MWDT0", value: 1)
!238 = !DIEnumerator(name: "WDT_MWDT1", value: 2)
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !234, line: 30, baseType: !7, size: 32, elements: !240)
!240 = !{!241, !242, !243, !244}
!241 = !DIEnumerator(name: "WDT_STAGE0", value: 0)
!242 = !DIEnumerator(name: "WDT_STAGE1", value: 1)
!243 = !DIEnumerator(name: "WDT_STAGE2", value: 2)
!244 = !DIEnumerator(name: "WDT_STAGE3", value: 3)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !234, line: 43, baseType: !7, size: 32, elements: !246)
!246 = !{!247, !248, !249, !250, !251}
!247 = !DIEnumerator(name: "WDT_STAGE_ACTION_OFF", value: 0)
!248 = !DIEnumerator(name: "WDT_STAGE_ACTION_INT", value: 1)
!249 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_CPU", value: 2)
!250 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_SYSTEM", value: 3)
!251 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_RTC", value: 4)
!252 = !{!58, !253}
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !59, line: 60, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !61, line: 105, baseType: !255)
!255 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!256 = !{!228, !257}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "TAG", scope: !230, file: !259, line: 23, type: !100, isLocal: true, isDefinition: true)
!259 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_image_header_t", file: !26, line: 93, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 74, size: 192, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !274, !276, !277, !281}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !261, file: !26, line: 75, baseType: !63, size: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !261, file: !26, line: 76, baseType: !63, size: 8, offset: 8)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "spi_mode", scope: !261, file: !26, line: 77, baseType: !63, size: 8, offset: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "spi_speed", scope: !261, file: !26, line: 78, baseType: !63, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 24)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "spi_size", scope: !261, file: !26, line: 79, baseType: !63, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 24)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "entry_addr", scope: !261, file: !26, line: 80, baseType: !58, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "wp_pin", scope: !261, file: !26, line: 81, baseType: !63, size: 8, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "spi_pin_drv", scope: !261, file: !26, line: 84, baseType: !271, size: 24, offset: 72)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 24, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 3)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "chip_id", scope: !261, file: !26, line: 85, baseType: !275, size: 16, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_chip_id_t", file: !26, line: 26, baseType: !25)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "min_chip_rev", scope: !261, file: !26, line: 86, baseType: !63, size: 8, offset: 112)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !261, file: !26, line: 87, baseType: !278, size: 64, offset: 120)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "hash_appended", scope: !261, file: !26, line: 88, baseType: !63, size: 8, offset: 184)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "intr_desc_table", scope: !284, file: !308, line: 164, type: !309, isLocal: true, isDefinition: true)
!284 = distinct !DICompileUnit(language: DW_LANG_C99, file: !285, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !286, retainedTypes: !305, globals: !307, splitDebugInlining: false, nameTableKind: None)
!285 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!286 = !{!287, !293, !300}
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !288, line: 37, baseType: !7, size: 32, elements: !289)
!288 = !DIFile(filename: "esp-idf/components/esp_hw_support/include/esp_cpu.h", directory: "/home/mjshen/RTOSExploration/esp")
!289 = !{!290, !291, !292}
!290 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_LEVEL", value: 0)
!291 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_EDGE", value: 1)
!292 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_NA", value: 2)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !294, line: 23, baseType: !7, size: 32, elements: !295)
!294 = !DIFile(filename: "esp-idf/components/hal/include/hal/mpu_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!295 = !{!296, !297, !298, !299}
!296 = !DIEnumerator(name: "MPU_REGION_ILLEGAL", value: 0)
!297 = !DIEnumerator(name: "MPU_REGION_RW", value: 1)
!298 = !DIEnumerator(name: "MPU_REGION_X", value: 2)
!299 = !DIEnumerator(name: "MPU_REGION_RWX", value: 3)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !288, line: 70, baseType: !7, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_LOAD", value: 0)
!303 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_STORE", value: 1)
!304 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_ACCESS", value: 2)
!305 = !{!58, !56, !306}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !61, line: 184, baseType: !7)
!307 = !{!282}
!308 = !DIFile(filename: "esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp")
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 4096, elements: !318)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "intr_desc_t", file: !308, line: 160, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !308, line: 156, size: 128, elements: !313)
!313 = !{!314, !315, !317}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !312, file: !308, line: 157, baseType: !55, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !308, line: 158, baseType: !316, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_intr_type_t", file: !288, line: 41, baseType: !287)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !312, file: !308, line: 159, baseType: !142, size: 64, offset: 64)
!318 = !{!319}
!319 = !DISubrange(count: 32)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "s_cur_pll_freq", scope: !322, file: !366, line: 35, type: !306, isLocal: true, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !324, retainedTypes: !358, globals: !363, splitDebugInlining: false, nameTableKind: None)
!323 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!324 = !{!325, !331, !339, !346, !352}
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 77, baseType: !7, size: 32, elements: !327)
!326 = !DIFile(filename: "esp-idf/components/hal/esp32/include/hal/clk_tree_ll.h", directory: "/home/mjshen/RTOSExploration/esp")
!327 = !{!328, !329, !330}
!328 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_CRYSTAL", value: 0)
!329 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_EXTERNAL", value: 1)
!330 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_BOOTSTRAP", value: 2)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !332, line: 64, baseType: !7, size: 32, elements: !333)
!332 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/clk_tree_defs.h", directory: "/home/mjshen/RTOSExploration/esp")
!333 = !{!334, !335, !336, !337, !338}
!334 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_XTAL", value: 0)
!335 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_PLL", value: 1)
!336 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_RC_FAST", value: 2)
!337 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_APLL", value: 3)
!338 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_INVALID", value: 4)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !340, line: 82, baseType: !7, size: 32, elements: !341)
!340 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/rtc.h", directory: "/home/mjshen/RTOSExploration/esp")
!341 = !{!342, !343, !344, !345}
!342 = !DIEnumerator(name: "RTC_XTAL_FREQ_AUTO", value: 0)
!343 = !DIEnumerator(name: "RTC_XTAL_FREQ_40M", value: 40)
!344 = !DIEnumerator(name: "RTC_XTAL_FREQ_26M", value: 26)
!345 = !DIEnumerator(name: "RTC_XTAL_FREQ_24M", value: 24)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !332, line: 76, baseType: !7, size: 32, elements: !347)
!347 = !{!348, !349, !350, !351}
!348 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_SLOW", value: 0)
!349 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_XTAL32K", value: 1)
!350 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_FAST_D256", value: 2)
!351 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_INVALID", value: 3)
!352 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !332, line: 87, baseType: !7, size: 32, elements: !353)
!353 = !{!354, !355, !356, !357}
!354 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_D4", value: 0)
!355 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_DIV", value: 0)
!356 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_RC_FAST", value: 1)
!357 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_INVALID", value: 2)
!358 = !{!306, !359, !55, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !306)
!361 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtc_xtal_freq_t", file: !340, line: 87, baseType: !339)
!363 = !{!320, !364}
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "TAG", scope: !322, file: !366, line: 37, type: !100, isLocal: true, isDefinition: true)
!366 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp")
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!368 = distinct !DIGlobalVariable(name: "s_lock", scope: !369, file: !375, line: 12, type: !55, isLocal: true, isDefinition: true)
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !371, globals: !373, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_cycle_count_t", file: !288, line: 32, baseType: !58)
!373 = !{!374}
!374 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!375 = !DIFile(filename: "esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp")
!376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !377, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !378, splitDebugInlining: false, nameTableKind: None)
!377 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/soc/esp32/./dport_access.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!378 = !{!92}
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !381, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!381 = !{!134, !103}
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !384, globals: !385, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader/subproject/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!384 = !{!5}
!385 = !{!386}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "TAG", scope: !382, file: !388, line: 14, type: !100, isLocal: true, isDefinition: true)
!388 = !DIFile(filename: "esp-idf/components/bootloader/subproject/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp")
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !391, retainedTypes: !412, globals: !413, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!391 = !{!392, !406}
!392 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !393, line: 19, baseType: !7, size: 32, elements: !394)
!393 = !DIFile(filename: "esp-idf/components/efuse/esp32/include/esp_efuse_chip.h", directory: "/home/mjshen/RTOSExploration/esp")
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405}
!395 = !DIEnumerator(name: "EFUSE_BLK0", value: 0)
!396 = !DIEnumerator(name: "EFUSE_BLK1", value: 1)
!397 = !DIEnumerator(name: "EFUSE_BLK_KEY0", value: 1)
!398 = !DIEnumerator(name: "EFUSE_BLK_ENCRYPT_FLASH", value: 1)
!399 = !DIEnumerator(name: "EFUSE_BLK2", value: 2)
!400 = !DIEnumerator(name: "EFUSE_BLK_KEY1", value: 2)
!401 = !DIEnumerator(name: "EFUSE_BLK_SECURE_BOOT", value: 2)
!402 = !DIEnumerator(name: "EFUSE_BLK3", value: 3)
!403 = !DIEnumerator(name: "EFUSE_BLK_KEY2", value: 3)
!404 = !DIEnumerator(name: "EFUSE_BLK_KEY_MAX", value: 4)
!405 = !DIEnumerator(name: "EFUSE_BLK_MAX", value: 4)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !407, line: 23, baseType: !7, size: 32, elements: !408)
!407 = !DIFile(filename: "esp-idf/components/bootloader_support/include/esp_flash_encrypt.h", directory: "/home/mjshen/RTOSExploration/esp")
!408 = !{!409, !410, !411}
!409 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DISABLED", value: 0)
!410 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DEVELOPMENT", value: 1)
!411 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_RELEASE", value: 2)
!412 = !{!56}
!413 = !{!414}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "TAG", scope: !389, file: !416, line: 23, type: !100, isLocal: true, isDefinition: true)
!416 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp")
!417 = distinct !DICompileUnit(language: DW_LANG_C99, file: !418, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !419, globals: !421, splitDebugInlining: false, nameTableKind: None)
!418 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!421 = !{!422}
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "TAG", scope: !417, file: !424, line: 12, type: !100, isLocal: true, isDefinition: true)
!424 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp")
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!428 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_soc.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !431, retainedTypes: !432, globals: !433, splitDebugInlining: false, nameTableKind: None)
!430 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!431 = !{!25, !214, !5}
!432 = !{!58, !56}
!433 = !{!434}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "TAG", scope: !429, file: !436, line: 40, type: !100, isLocal: true, isDefinition: true)
!436 = !DIFile(filename: "esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp")
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !439, retainedTypes: !445, globals: !447, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!439 = !{!440, !25}
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 16, baseType: !55, size: 32, elements: !441)
!441 = !{!442, !443, !444}
!442 = !DIEnumerator(name: "GPIO_LONG_HOLD", value: 1)
!443 = !DIEnumerator(name: "GPIO_SHORT_HOLD", value: -1)
!444 = !DIEnumerator(name: "GPIO_NOT_HOLD", value: 0)
!445 = !{!58, !56, !54, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!447 = !{!448}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "TAG", scope: !437, file: !450, line: 30, type: !100, isLocal: true, isDefinition: true)
!450 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp")
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !453, retainedTypes: !454, splitDebugInlining: false, nameTableKind: None)
!452 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_clock_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!453 = !{!5, !339, !352, !346}
!454 = !{!359}
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_mem.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !459, splitDebugInlining: false, nameTableKind: None)
!458 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!459 = !{!62, !54, !56, !372}
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !462, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!462 = !{!306, !359}
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !465, retainedTypes: !432, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash_config_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!465 = !{!25, !214, !466}
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 47, baseType: !7, size: 32, elements: !467)
!467 = !{!468, !469, !470, !471}
!468 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_2", value: 0)
!469 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_3", value: 1)
!470 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_4", value: 2)
!471 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_1", value: 15)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !412, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_efuse.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!474 = distinct !DICompileUnit(language: DW_LANG_C99, file: !475, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!475 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!476 = distinct !DICompileUnit(language: DW_LANG_C99, file: !477, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !478, retainedTypes: !484, globals: !485, splitDebugInlining: false, nameTableKind: None)
!477 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!478 = !{!339, !352, !346, !331, !479}
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !340, line: 102, baseType: !7, size: 32, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIEnumerator(name: "RTC_CAL_RTC_MUX", value: 0)
!482 = !DIEnumerator(name: "RTC_CAL_8MD256", value: 1)
!483 = !DIEnumerator(name: "RTC_CAL_32K_XTAL", value: 2)
!484 = !{!56, !253, !58, !372}
!485 = !{!486}
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "TAG", scope: !476, file: !488, line: 31, type: !100, isLocal: true, isDefinition: true)
!488 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!489 = distinct !DICompileUnit(language: DW_LANG_C99, file: !490, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !462, splitDebugInlining: false, nameTableKind: None)
!490 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !493, retainedTypes: !494, globals: !496, splitDebugInlining: false, nameTableKind: None)
!492 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!493 = !{!479, !339, !346}
!494 = !{!306, !495, !359}
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !61, line: 202, baseType: !255)
!496 = !{!497}
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "TAG", scope: !491, file: !499, line: 14, type: !100, isLocal: true, isDefinition: true)
!499 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp")
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_sys.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_uart.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !506, retainedTypes: !521, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_spiflash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!506 = !{!214, !507}
!507 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !215, line: 19, baseType: !7, size: 32, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!509 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QIO_MODE", value: 0)
!510 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QOUT_MODE", value: 1)
!511 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DIO_MODE", value: 2)
!512 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DOUT_MODE", value: 3)
!513 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_FASTRD_MODE", value: 4)
!514 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_SLOWRD_MODE", value: 5)
!515 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_STR_MODE", value: 6)
!516 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_DTR_MODE", value: 7)
!517 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OOUT_MODE", value: 8)
!518 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_STR_MODE", value: 9)
!519 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_DTR_MODE", value: 10)
!520 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QPI_MODE", value: 11)
!521 = !{!359, !306, !522}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !525, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mpu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!525 = !{!293}
!526 = distinct !DICompileUnit(language: DW_LANG_C99, file: !527, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !528, splitDebugInlining: false, nameTableKind: None)
!527 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!528 = !{!529, !530, !531, !92}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !95, line: 207, baseType: !27)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!532 = distinct !DICompileUnit(language: DW_LANG_C99, file: !533, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !378, splitDebugInlining: false, nameTableKind: None)
!533 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/esp32/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !432, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mmu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !538, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/wdt_hal_iram.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/deep_sleep/bootloader")
!538 = !{!233, !239, !539, !245}
!539 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !234, line: 57, baseType: !7, size: 32, elements: !540)
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548}
!541 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_100ns", value: 0)
!542 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_200ns", value: 1)
!543 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_300ns", value: 2)
!544 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_400ns", value: 3)
!545 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_500ns", value: 4)
!546 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_800ns", value: 5)
!547 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_1_6us", value: 6)
!548 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_3_2us", value: 7)
!549 = !{!"clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)"}
!550 = !{i32 7, !"Dwarf Version", i32 4}
!551 = !{i32 2, !"Debug Info Version", i32 3}
!552 = !{i32 1, !"wchar_size", i32 1}
!553 = distinct !DISubprogram(name: "esp_dport_access_reg_read", scope: !554, file: !554, line: 13, type: !555, scopeLine: 14, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !376, retainedNodes: !557)
!554 = !DIFile(filename: "esp-idf/components/soc/esp32/dport_access.c", directory: "/home/mjshen/RTOSExploration/esp")
!555 = !DISubroutineType(types: !556)
!556 = !{!94, !94}
!557 = !{!558}
!558 = !DILocalVariable(name: "reg", arg: 1, scope: !553, file: !554, line: 13, type: !94)
!559 = !DILocation(line: 0, scope: !553)
!560 = !DILocation(line: 16, column: 12, scope: !553)
!561 = !{!562, !562, i64 0}
!562 = !{!"int", !563, i64 0}
!563 = !{!"omnipotent char", !564, i64 0}
!564 = !{!"Simple C/C++ TBAA"}
!565 = !DILocation(line: 16, column: 5, scope: !553)
!566 = distinct !DISubprogram(name: "esp_dport_access_sequence_reg_read", scope: !554, file: !554, line: 35, type: !555, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !376, retainedNodes: !567)
!567 = !{!568}
!568 = !DILocalVariable(name: "reg", arg: 1, scope: !566, file: !554, line: 35, type: !94)
!569 = !DILocation(line: 0, scope: !566)
!570 = !DILocation(line: 38, column: 12, scope: !566)
!571 = !DILocation(line: 38, column: 5, scope: !566)
!572 = distinct !DISubprogram(name: "__assert_func", scope: !573, file: !573, line: 13, type: !574, scopeLine: 14, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !379, retainedNodes: !576)
!573 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp")
!574 = !DISubroutineType(types: !575)
!575 = !{null, !100, !55, !100, !100}
!576 = !{!577, !578, !579, !580}
!577 = !DILocalVariable(name: "file", arg: 1, scope: !572, file: !573, line: 13, type: !100)
!578 = !DILocalVariable(name: "line", arg: 2, scope: !572, file: !573, line: 13, type: !55)
!579 = !DILocalVariable(name: "func", arg: 3, scope: !572, file: !573, line: 13, type: !100)
!580 = !DILocalVariable(name: "expr", arg: 4, scope: !572, file: !573, line: 13, type: !100)
!581 = !DILocation(line: 0, scope: !572)
!582 = !DILocation(line: 17, column: 5, scope: !572)
!583 = !DILocation(line: 20, column: 5, scope: !572)
!584 = distinct !{!584, !583, !585}
!585 = !DILocation(line: 21, column: 5, scope: !572)
!586 = !DISubprogram(name: "esp_rom_printf", scope: !587, file: !587, line: 24, type: !588, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !590)
!587 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_sys.h", directory: "/home/mjshen/RTOSExploration/esp")
!588 = !DISubroutineType(types: !589)
!589 = !{!55, !100, null}
!590 = !{}
!591 = distinct !DISubprogram(name: "abort", scope: !573, file: !573, line: 24, type: !90, scopeLine: 25, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !379, retainedNodes: !590)
!592 = !DILocation(line: 27, column: 69, scope: !591)
!593 = !DILocation(line: 27, column: 59, scope: !591)
!594 = !DILocation(line: 27, column: 97, scope: !591)
!595 = !DILocation(line: 27, column: 5, scope: !591)
!596 = !DILocalVariable(name: "dcr", scope: !597, file: !598, line: 189, type: !306)
!597 = distinct !DISubprogram(name: "xt_utils_dbgr_is_attached", scope: !598, file: !598, line: 187, type: !599, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !379, retainedNodes: !601)
!598 = !DIFile(filename: "esp-idf/components/xtensa/include/xt_utils.h", directory: "/home/mjshen/RTOSExploration/esp")
!599 = !DISubroutineType(types: !600)
!600 = !{!103}
!601 = !{!596, !602}
!602 = !DILocalVariable(name: "reg", scope: !597, file: !598, line: 190, type: !306)
!603 = !DILocation(line: 0, scope: !597, inlinedAt: !604)
!604 = distinct !DILocation(line: 497, column: 12, scope: !605, inlinedAt: !606)
!605 = distinct !DISubprogram(name: "esp_cpu_dbgr_is_attached", scope: !288, file: !288, line: 494, type: !599, scopeLine: 495, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !379, retainedNodes: !590)
!606 = distinct !DILocation(line: 29, column: 9, scope: !607)
!607 = distinct !DILexicalBlock(scope: !591, file: !573, line: 29, column: 9)
!608 = !DILocation(line: 191, column: 5, scope: !597, inlinedAt: !604)
!609 = !{i64 2148037494}
!610 = !DILocation(line: 192, column: 23, scope: !597, inlinedAt: !604)
!611 = !DILocation(line: 192, column: 12, scope: !597, inlinedAt: !604)
!612 = !DILocation(line: 29, column: 9, scope: !591)
!613 = !DILocation(line: 197, column: 5, scope: !614, inlinedAt: !615)
!614 = distinct !DISubprogram(name: "xt_utils_dbgr_break", scope: !598, file: !598, line: 195, type: !90, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !379, retainedNodes: !590)
!615 = distinct !DILocation(line: 509, column: 5, scope: !616, inlinedAt: !617)
!616 = distinct !DISubprogram(name: "esp_cpu_dbgr_break", scope: !288, file: !288, line: 506, type: !90, scopeLine: 507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !379, retainedNodes: !590)
!617 = distinct !DILocation(line: 30, column: 9, scope: !618)
!618 = distinct !DILexicalBlock(scope: !607, file: !573, line: 29, column: 37)
!619 = !{i64 513347}
!620 = !DILocation(line: 31, column: 5, scope: !618)
!621 = !DILocation(line: 32, column: 5, scope: !591)
!622 = distinct !{!622, !621, !623}
!623 = !DILocation(line: 33, column: 5, scope: !591)
!624 = distinct !DISubprogram(name: "call_start_cpu0", scope: !388, file: !388, line: 24, type: !90, scopeLine: 25, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !382, retainedNodes: !625)
!625 = !{!626, !645}
!626 = !DILocalVariable(name: "bs", scope: !624, file: !388, line: 50, type: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !628, line: 32, baseType: !629)
!628 = !DIFile(filename: "esp-idf/components/bootloader_support/private_include/bootloader_config.h", directory: "/home/mjshen/RTOSExploration/esp")
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !628, line: 25, size: 1280, elements: !630)
!630 = !{!631, !637, !638, !639, !643, !644}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !629, file: !628, line: 26, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !36, line: 71, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 68, size: 64, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !633, file: !36, line: 69, baseType: !58, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !633, file: !36, line: 70, baseType: !58, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !629, file: !628, line: 27, baseType: !632, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !629, file: !628, line: 28, baseType: !632, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !629, file: !628, line: 29, baseType: !640, size: 1024, offset: 192)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 1024, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 16)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !629, file: !628, line: 30, baseType: !58, size: 32, offset: 1216)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !629, file: !628, line: 31, baseType: !58, size: 32, offset: 1248)
!645 = !DILocalVariable(name: "boot_index", scope: !624, file: !388, line: 51, type: !55)
!646 = !DILocation(line: 27, column: 9, scope: !624)
!647 = !DILocation(line: 28, column: 9, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !388, line: 27, column: 33)
!649 = distinct !DILexicalBlock(scope: !624, file: !388, line: 27, column: 9)
!650 = !DILocation(line: 29, column: 5, scope: !648)
!651 = !DILocation(line: 32, column: 9, scope: !652)
!652 = distinct !DILexicalBlock(scope: !624, file: !388, line: 32, column: 9)
!653 = !DILocation(line: 32, column: 27, scope: !652)
!654 = !DILocation(line: 32, column: 9, scope: !624)
!655 = !DILocation(line: 33, column: 9, scope: !656)
!656 = distinct !DILexicalBlock(scope: !652, file: !388, line: 32, column: 38)
!657 = !DILocation(line: 37, column: 9, scope: !624)
!658 = !DILocation(line: 38, column: 9, scope: !659)
!659 = distinct !DILexicalBlock(scope: !660, file: !388, line: 37, column: 32)
!660 = distinct !DILexicalBlock(scope: !624, file: !388, line: 37, column: 9)
!661 = !DILocation(line: 39, column: 5, scope: !659)
!662 = !DILocation(line: 45, column: 5, scope: !624)
!663 = !DILocation(line: 50, column: 5, scope: !624)
!664 = !DILocation(line: 50, column: 24, scope: !624)
!665 = !DILocation(line: 51, column: 22, scope: !624)
!666 = !DILocalVariable(name: "bs", arg: 1, scope: !667, file: !388, line: 61, type: !670)
!667 = distinct !DISubprogram(name: "select_partition_number", scope: !388, file: !388, line: 61, type: !668, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !382, retainedNodes: !671)
!668 = !DISubroutineType(types: !669)
!669 = !{!55, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!671 = !{!666}
!672 = !DILocation(line: 0, scope: !667, inlinedAt: !673)
!673 = distinct !DILocation(line: 51, column: 22, scope: !624)
!674 = !DILocation(line: 64, column: 10, scope: !675, inlinedAt: !673)
!675 = distinct !DILexicalBlock(scope: !667, file: !388, line: 64, column: 9)
!676 = !DILocation(line: 64, column: 9, scope: !667, inlinedAt: !673)
!677 = !DILocation(line: 65, column: 9, scope: !678, inlinedAt: !673)
!678 = distinct !DILexicalBlock(scope: !679, file: !388, line: 65, column: 9)
!679 = distinct !DILexicalBlock(scope: !680, file: !388, line: 65, column: 9)
!680 = distinct !DILexicalBlock(scope: !681, file: !388, line: 65, column: 9)
!681 = distinct !DILexicalBlock(scope: !675, file: !388, line: 64, column: 55)
!682 = !DILocation(line: 66, column: 9, scope: !681, inlinedAt: !673)
!683 = !DILocalVariable(name: "bs", arg: 1, scope: !684, file: !388, line: 77, type: !687)
!684 = distinct !DISubprogram(name: "selected_boot_partition", scope: !388, file: !388, line: 77, type: !685, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !382, retainedNodes: !689)
!685 = !DISubroutineType(types: !686)
!686 = !{!55, !687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!689 = !{!683, !690}
!690 = !DILocalVariable(name: "boot_index", scope: !684, file: !388, line: 79, type: !55)
!691 = !DILocation(line: 0, scope: !684, inlinedAt: !692)
!692 = distinct !DILocation(line: 70, column: 12, scope: !667, inlinedAt: !673)
!693 = !DILocation(line: 79, column: 22, scope: !684, inlinedAt: !692)
!694 = !DILocation(line: 80, column: 20, scope: !695, inlinedAt: !692)
!695 = distinct !DILexicalBlock(scope: !684, file: !388, line: 80, column: 9)
!696 = !DILocation(line: 80, column: 9, scope: !684, inlinedAt: !692)
!697 = !DILocation(line: 0, scope: !624)
!698 = !DILocation(line: 53, column: 9, scope: !699)
!699 = distinct !DILexicalBlock(scope: !700, file: !388, line: 52, column: 38)
!700 = distinct !DILexicalBlock(scope: !624, file: !388, line: 52, column: 9)
!701 = !DILocation(line: 83, column: 9, scope: !702, inlinedAt: !692)
!702 = distinct !DILexicalBlock(scope: !684, file: !388, line: 83, column: 9)
!703 = !DILocation(line: 57, column: 5, scope: !624)
!704 = !DISubprogram(name: "bootloader_before_init", scope: !705, file: !705, line: 30, type: !90, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !590)
!705 = !DIFile(filename: "esp-idf/components/bootloader/subproject/main/bootloader_hooks.h", directory: "/home/mjshen/RTOSExploration/esp")
!706 = !DISubprogram(name: "bootloader_after_init", scope: !705, file: !705, line: 36, type: !90, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !590)
!707 = !DISubprogram(name: "esp_rom_get_reset_reason", scope: !587, file: !587, line: 53, type: !708, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !590)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !55}
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "soc_reset_reason_t", file: !6, line: 54, baseType: !5)
!711 = distinct !DISubprogram(name: "__getreent", scope: !388, file: !388, line: 130, type: !712, scopeLine: 131, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !382, retainedNodes: !590)
!712 = !DISubroutineType(types: !713)
!713 = !{!714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !716, line: 377, size: 1920, elements: !717)
!716 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/reent.h", directory: "/home/mjshen/RTOSExploration/esp")
!717 = !{!718, !719, !797, !798, !799, !800, !801, !802, !803, !807, !828, !832, !833, !834, !835, !844, !857, !858, !863, !880, !881, !888, !889, !905}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !715, file: !716, line: 381, baseType: !55, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !715, file: !716, line: 386, baseType: !720, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !716, line: 292, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !716, line: 186, size: 832, elements: !723)
!723 = !{!724, !725, !726, !727, !729, !730, !735, !736, !737, !738, !742, !746, !752, !756, !757, !758, !759, !761, !765, !766, !767, !769, !781, !796}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !722, file: !716, line: 187, baseType: !420, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !722, file: !716, line: 188, baseType: !55, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !722, file: !716, line: 189, baseType: !55, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !722, file: !716, line: 190, baseType: !728, size: 16, offset: 96)
!728 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !722, file: !716, line: 191, baseType: !728, size: 16, offset: 112)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !722, file: !716, line: 192, baseType: !731, size: 64, offset: 128)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !716, line: 122, size: 64, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !731, file: !716, line: 123, baseType: !420, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !731, file: !716, line: 124, baseType: !55, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !722, file: !716, line: 193, baseType: !55, size: 32, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !722, file: !716, line: 196, baseType: !714, size: 32, offset: 224)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !722, file: !716, line: 200, baseType: !54, size: 32, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !722, file: !716, line: 202, baseType: !739, size: 32, offset: 288)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DISubroutineType(types: !741)
!741 = !{!55, !714, !54, !446, !55}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !722, file: !716, line: 204, baseType: !743, size: 32, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = !DISubroutineType(types: !745)
!745 = !{!55, !714, !54, !100, !55}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !722, file: !716, line: 207, baseType: !747, size: 32, offset: 352)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DISubroutineType(types: !749)
!749 = !{!750, !714, !54, !750, !55}
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !160, line: 116, baseType: !751)
!751 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !722, file: !716, line: 208, baseType: !753, size: 32, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DISubroutineType(types: !755)
!755 = !{!55, !714, !54}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !722, file: !716, line: 211, baseType: !731, size: 64, offset: 416)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !722, file: !716, line: 212, baseType: !420, size: 32, offset: 480)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !722, file: !716, line: 213, baseType: !55, size: 32, offset: 512)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !722, file: !716, line: 216, baseType: !760, size: 24, offset: 544)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 24, elements: !272)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !722, file: !716, line: 217, baseType: !762, size: 8, offset: 568)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 1)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !722, file: !716, line: 220, baseType: !731, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !722, file: !716, line: 223, baseType: !55, size: 32, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !722, file: !716, line: 224, baseType: !768, size: 32, offset: 672)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !160, line: 46, baseType: !751)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !722, file: !716, line: 231, baseType: !770, size: 32, offset: 704)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !716, line: 35, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !772, line: 34, baseType: !773)
!772 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !775, line: 23, size: 736, elements: !776)
!775 = !DIFile(filename: "esp-idf/components/newlib/platform_include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!776 = !{!777}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !774, file: !775, line: 24, baseType: !778, size: 736)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 736, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 23)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !722, file: !716, line: 233, baseType: !782, size: 64, offset: 736)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !160, line: 170, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 162, size: 64, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !783, file: !160, line: 164, baseType: !55, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !783, file: !160, line: 169, baseType: !787, size: 32, offset: 32)
!787 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !783, file: !160, line: 165, size: 32, elements: !788)
!788 = !{!789, !792}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !787, file: !160, line: 167, baseType: !790, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !791, line: 116, baseType: !7)
!791 = !DIFile(filename: "xtensa-esp32-elf-clang/lib/clang/14.0.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/esp")
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !787, file: !160, line: 168, baseType: !793, size: 32)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 32, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 4)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !722, file: !716, line: 234, baseType: !55, size: 32, offset: 800)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !715, file: !716, line: 386, baseType: !720, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !715, file: !716, line: 386, baseType: !720, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !715, file: !716, line: 388, baseType: !55, size: 32, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !715, file: !716, line: 390, baseType: !446, size: 32, offset: 160)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !715, file: !716, line: 392, baseType: !55, size: 32, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !715, file: !716, line: 394, baseType: !55, size: 32, offset: 224)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !715, file: !716, line: 395, baseType: !804, size: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !806, line: 9, flags: DIFlagFwdDecl)
!806 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/_locale.h", directory: "/home/mjshen/RTOSExploration/esp")
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !715, file: !716, line: 397, baseType: !808, size: 32, offset: 288)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !716, line: 349, size: 128, elements: !810)
!810 = !{!811, !824, !825, !826}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !809, file: !716, line: 352, baseType: !812, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !716, line: 52, size: 192, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !813, file: !716, line: 54, baseType: !812, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !813, file: !716, line: 55, baseType: !55, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !813, file: !716, line: 55, baseType: !55, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !813, file: !716, line: 55, baseType: !55, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !813, file: !716, line: 55, baseType: !55, size: 32, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !813, file: !716, line: 56, baseType: !821, size: 32, offset: 160)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 32, elements: !763)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !716, line: 22, baseType: !823)
!823 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !809, file: !716, line: 353, baseType: !55, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !809, file: !716, line: 354, baseType: !812, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !809, file: !716, line: 355, baseType: !827, size: 32, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !715, file: !716, line: 399, baseType: !829, size: 32, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !714}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !715, file: !716, line: 401, baseType: !55, size: 32, offset: 352)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !715, file: !716, line: 404, baseType: !55, size: 32, offset: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !715, file: !716, line: 405, baseType: !446, size: 32, offset: 416)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !715, file: !716, line: 407, baseType: !836, size: 32, offset: 448)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !716, line: 324, size: 192, elements: !838)
!838 = !{!839, !841, !842, !843}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !837, file: !716, line: 325, baseType: !840, size: 48)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 48, elements: !272)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !837, file: !716, line: 326, baseType: !840, size: 48, offset: 48)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !837, file: !716, line: 327, baseType: !27, size: 16, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !837, file: !716, line: 330, baseType: !255, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !715, file: !716, line: 408, baseType: !845, size: 32, offset: 480)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !716, line: 60, size: 288, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !846, file: !716, line: 62, baseType: !55, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !846, file: !716, line: 63, baseType: !55, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !846, file: !716, line: 64, baseType: !55, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !846, file: !716, line: 65, baseType: !55, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !846, file: !716, line: 66, baseType: !55, size: 32, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !846, file: !716, line: 67, baseType: !55, size: 32, offset: 160)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !846, file: !716, line: 68, baseType: !55, size: 32, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !846, file: !716, line: 69, baseType: !55, size: 32, offset: 224)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !846, file: !716, line: 70, baseType: !55, size: 32, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !715, file: !716, line: 409, baseType: !446, size: 32, offset: 512)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !715, file: !716, line: 412, baseType: !859, size: 32, offset: 544)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !55}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !715, file: !716, line: 416, baseType: !864, size: 32, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !716, line: 90, size: 1120, elements: !866)
!866 = !{!867, !868, !869, !871}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !865, file: !716, line: 91, baseType: !864, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !865, file: !716, line: 92, baseType: !55, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !865, file: !716, line: 93, baseType: !870, size: 1024, offset: 64)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 1024, elements: !318)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !865, file: !716, line: 94, baseType: !872, size: 32, offset: 1088)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !716, line: 79, size: 2112, elements: !874)
!874 = !{!875, !877, !878, !879}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !873, file: !716, line: 80, baseType: !876, size: 1024)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1024, elements: !318)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !873, file: !716, line: 81, baseType: !876, size: 1024, offset: 1024)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !873, file: !716, line: 83, baseType: !822, size: 32, offset: 2048)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !873, file: !716, line: 86, baseType: !822, size: 32, offset: 2080)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !715, file: !716, line: 417, baseType: !865, size: 1120, offset: 608)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !715, file: !716, line: 420, baseType: !882, size: 96, offset: 1728)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !716, line: 296, size: 96, elements: !883)
!883 = !{!884, !886, !887}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !882, file: !716, line: 298, baseType: !885, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !882, file: !716, line: 299, baseType: !55, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !882, file: !716, line: 300, baseType: !720, size: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !715, file: !716, line: 421, baseType: !720, size: 32, offset: 1824)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !715, file: !716, line: 422, baseType: !890, size: 32, offset: 1856)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !716, line: 359, size: 640, elements: !892)
!892 = !{!893, !894, !895, !896, !897, !899, !900, !901, !902, !903, !904}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !891, file: !716, line: 362, baseType: !446, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !891, file: !716, line: 363, baseType: !782, size: 64, offset: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !891, file: !716, line: 364, baseType: !782, size: 64, offset: 96)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !891, file: !716, line: 365, baseType: !782, size: 64, offset: 160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !891, file: !716, line: 366, baseType: !898, size: 64, offset: 224)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 64, elements: !279)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !891, file: !716, line: 367, baseType: !55, size: 32, offset: 288)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !891, file: !716, line: 368, baseType: !782, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !891, file: !716, line: 369, baseType: !782, size: 64, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !891, file: !716, line: 370, baseType: !782, size: 64, offset: 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !891, file: !716, line: 371, baseType: !782, size: 64, offset: 512)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !891, file: !716, line: 372, baseType: !782, size: 64, offset: 576)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !715, file: !716, line: 423, baseType: !446, size: 32, offset: 1888)
!906 = !DILocation(line: 132, column: 12, scope: !711)
!907 = !{!908, !908, i64 0}
!908 = !{!"any pointer", !563, i64 0}
!909 = !DILocation(line: 132, column: 5, scope: !711)
!910 = distinct !DISubprogram(name: "bootloader_common_get_partition_description", scope: !67, file: !67, line: 123, type: !911, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !943)
!911 = !DISubroutineType(types: !912)
!912 = !{!913, !915, !922}
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_err_t", file: !914, line: 19, baseType: !55)
!914 = !DIFile(filename: "esp-idf/components/esp_common/include/esp_err.h", directory: "/home/mjshen/RTOSExploration/esp")
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !36, line: 71, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 68, size: 64, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !918, file: !36, line: 69, baseType: !58, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !918, file: !36, line: 70, baseType: !58, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_app_desc_t", file: !924, line: 35, baseType: !925)
!924 = !DIFile(filename: "esp-idf/components/esp_app_format/include/esp_app_desc.h", directory: "/home/mjshen/RTOSExploration/esp")
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !924, line: 24, size: 2048, elements: !926)
!926 = !{!927, !928, !929, !930, !932, !933, !935, !936, !937, !939}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "magic_word", scope: !925, file: !924, line: 25, baseType: !58, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "secure_version", scope: !925, file: !924, line: 26, baseType: !58, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "reserv1", scope: !925, file: !924, line: 27, baseType: !142, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !925, file: !924, line: 28, baseType: !931, size: 256, offset: 128)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 256, elements: !318)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "project_name", scope: !925, file: !924, line: 29, baseType: !931, size: 256, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !925, file: !924, line: 30, baseType: !934, size: 128, offset: 640)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !641)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !925, file: !924, line: 31, baseType: !934, size: 128, offset: 768)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "idf_ver", scope: !925, file: !924, line: 32, baseType: !931, size: 256, offset: 896)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "app_elf_sha256", scope: !925, file: !924, line: 33, baseType: !938, size: 256, offset: 1152)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 256, elements: !318)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "reserv2", scope: !925, file: !924, line: 34, baseType: !940, size: 640, offset: 1408)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 640, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 20)
!943 = !{!944, !945, !946, !947, !948}
!944 = !DILocalVariable(name: "partition", arg: 1, scope: !910, file: !67, line: 123, type: !915)
!945 = !DILocalVariable(name: "app_desc", arg: 2, scope: !910, file: !67, line: 123, type: !922)
!946 = !DILocalVariable(name: "app_desc_offset", scope: !910, file: !67, line: 129, type: !137)
!947 = !DILocalVariable(name: "mmap_size", scope: !910, file: !67, line: 130, type: !137)
!948 = !DILocalVariable(name: "image", scope: !910, file: !67, line: 131, type: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!950 = !DILocation(line: 0, scope: !910)
!951 = !DILocation(line: 125, column: 19, scope: !952)
!952 = distinct !DILexicalBlock(scope: !910, file: !67, line: 125, column: 9)
!953 = !DILocation(line: 125, column: 27, scope: !952)
!954 = !DILocation(line: 125, column: 61, scope: !952)
!955 = !{!956, !562, i64 0}
!956 = !{!"", !562, i64 0, !562, i64 4}
!957 = !DILocation(line: 125, column: 68, scope: !952)
!958 = !DILocation(line: 125, column: 9, scope: !910)
!959 = !DILocation(line: 131, column: 28, scope: !910)
!960 = !DILocation(line: 132, column: 15, scope: !961)
!961 = distinct !DILexicalBlock(scope: !910, file: !67, line: 132, column: 9)
!962 = !DILocation(line: 132, column: 9, scope: !910)
!963 = !DILocation(line: 133, column: 9, scope: !964)
!964 = distinct !DILexicalBlock(scope: !965, file: !67, line: 133, column: 9)
!965 = distinct !DILexicalBlock(scope: !966, file: !67, line: 133, column: 9)
!966 = distinct !DILexicalBlock(scope: !967, file: !67, line: 133, column: 9)
!967 = distinct !DILexicalBlock(scope: !961, file: !67, line: 132, column: 24)
!968 = !DILocation(line: 134, column: 9, scope: !967)
!969 = !DILocation(line: 137, column: 28, scope: !910)
!970 = !DILocation(line: 137, column: 5, scope: !910)
!971 = !DILocation(line: 138, column: 5, scope: !910)
!972 = !DILocation(line: 140, column: 19, scope: !973)
!973 = distinct !DILexicalBlock(scope: !910, file: !67, line: 140, column: 9)
!974 = !{!975, !562, i64 0}
!975 = !{!"", !562, i64 0, !562, i64 4, !563, i64 8, !563, i64 16, !563, i64 48, !563, i64 80, !563, i64 96, !563, i64 112, !563, i64 144, !563, i64 176}
!976 = !DILocation(line: 140, column: 30, scope: !973)
!977 = !DILocation(line: 145, column: 1, scope: !910)
!978 = !DISubprogram(name: "memcpy", scope: !979, file: !979, line: 31, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !590)
!979 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/string.h", directory: "/home/mjshen/RTOSExploration/esp")
!980 = !DISubroutineType(types: !981)
!981 = !{!54, !982, !983, !157}
!982 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !54)
!983 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!986 = distinct !DISubprogram(name: "bootloader_utility_load_partition_table", scope: !67, file: !67, line: 148, type: !987, scopeLine: 149, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1000)
!987 = !DISubroutineType(types: !988)
!988 = !{!103, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !628, line: 32, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !628, line: 25, size: 1280, elements: !992)
!992 = !{!993, !994, !995, !996, !998, !999}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !991, file: !628, line: 26, baseType: !917, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !991, file: !628, line: 27, baseType: !917, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !991, file: !628, line: 28, baseType: !917, size: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !991, file: !628, line: 29, baseType: !997, size: 1024, offset: 192)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 1024, elements: !641)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !991, file: !628, line: 30, baseType: !58, size: 32, offset: 1216)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !991, file: !628, line: 31, baseType: !58, size: 32, offset: 1248)
!1000 = !{!1001, !1002, !1015, !1016, !1017, !1018, !1020}
!1001 = !DILocalVariable(name: "bs", arg: 1, scope: !986, file: !67, line: 148, type: !989)
!1002 = !DILocalVariable(name: "partitions", scope: !986, file: !67, line: 150, type: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_info_t", file: !36, line: 83, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 76, size: 256, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1014}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1006, file: !36, line: 77, baseType: !205, size: 16)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1006, file: !36, line: 78, baseType: !63, size: 8, offset: 16)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1006, file: !36, line: 79, baseType: !63, size: 8, offset: 24)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1006, file: !36, line: 80, baseType: !917, size: 64, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1006, file: !36, line: 81, baseType: !1013, size: 128, offset: 96)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !641)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1006, file: !36, line: 82, baseType: !58, size: 32, offset: 224)
!1015 = !DILocalVariable(name: "partition_usage", scope: !986, file: !67, line: 151, type: !100)
!1016 = !DILocalVariable(name: "err", scope: !986, file: !67, line: 152, type: !913)
!1017 = !DILocalVariable(name: "num_partitions", scope: !986, file: !67, line: 153, type: !55)
!1018 = !DILocalVariable(name: "i", scope: !1019, file: !67, line: 171, type: !55)
!1019 = distinct !DILexicalBlock(scope: !986, file: !67, line: 171, column: 5)
!1020 = !DILocalVariable(name: "partition", scope: !1021, file: !67, line: 172, type: !1003)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !67, line: 171, column: 46)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !67, line: 171, column: 5)
!1023 = !DILocation(line: 0, scope: !986)
!1024 = !DILocation(line: 153, column: 5, scope: !986)
!1025 = !DILocation(line: 155, column: 18, scope: !986)
!1026 = !DILocation(line: 156, column: 10, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !986, file: !67, line: 156, column: 9)
!1028 = !DILocation(line: 156, column: 9, scope: !986)
!1029 = !DILocation(line: 157, column: 9, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !67, line: 157, column: 9)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !67, line: 157, column: 9)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !67, line: 157, column: 9)
!1033 = distinct !DILexicalBlock(scope: !1027, file: !67, line: 156, column: 22)
!1034 = !DILocation(line: 158, column: 9, scope: !1033)
!1035 = !DILocation(line: 162, column: 11, scope: !986)
!1036 = !DILocation(line: 163, column: 13, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !986, file: !67, line: 163, column: 9)
!1038 = !DILocation(line: 163, column: 9, scope: !986)
!1039 = !DILocation(line: 164, column: 9, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !67, line: 164, column: 9)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !67, line: 164, column: 9)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !67, line: 164, column: 9)
!1043 = distinct !DILexicalBlock(scope: !1037, file: !67, line: 163, column: 24)
!1044 = !DILocation(line: 165, column: 9, scope: !1043)
!1045 = !DILocation(line: 168, column: 5, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !67, line: 168, column: 5)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !67, line: 168, column: 5)
!1048 = distinct !DILexicalBlock(scope: !986, file: !67, line: 168, column: 5)
!1049 = !DILocation(line: 169, column: 5, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !67, line: 169, column: 5)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !67, line: 169, column: 5)
!1052 = distinct !DILexicalBlock(scope: !986, file: !67, line: 169, column: 5)
!1053 = !DILocation(line: 0, scope: !1019)
!1054 = !DILocation(line: 171, column: 25, scope: !1022)
!1055 = !DILocation(line: 171, column: 23, scope: !1022)
!1056 = !DILocation(line: 171, column: 5, scope: !1019)
!1057 = !DILocation(line: 237, column: 5, scope: !986)
!1058 = !DILocation(line: 239, column: 5, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !67, line: 239, column: 5)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !67, line: 239, column: 5)
!1061 = distinct !DILexicalBlock(scope: !986, file: !67, line: 239, column: 5)
!1062 = !DILocation(line: 240, column: 5, scope: !986)
!1063 = !DILocation(line: 0, scope: !1021)
!1064 = !DILocation(line: 178, column: 28, scope: !1021)
!1065 = !{!1066, !563, i64 2}
!1066 = !{!"", !1067, i64 0, !563, i64 2, !563, i64 3, !956, i64 4, !563, i64 12, !562, i64 28}
!1067 = !{!"short", !563, i64 0}
!1068 = !DILocation(line: 178, column: 9, scope: !1021)
!1069 = !DILocation(line: 180, column: 32, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1021, file: !67, line: 178, column: 34)
!1071 = !{!1066, !563, i64 3}
!1072 = !DILocation(line: 180, column: 21, scope: !1070)
!1073 = !DILocation(line: 180, column: 13, scope: !1070)
!1074 = !DILocation(line: 182, column: 42, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1070, file: !67, line: 180, column: 41)
!1076 = !DILocation(line: 184, column: 17, scope: !1075)
!1077 = !DILocation(line: 186, column: 39, scope: !1075)
!1078 = !DILocation(line: 188, column: 17, scope: !1075)
!1079 = !DILocation(line: 191, column: 41, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1075, file: !67, line: 191, column: 21)
!1081 = !DILocation(line: 191, column: 67, scope: !1080)
!1082 = !DILocation(line: 191, column: 21, scope: !1075)
!1083 = !DILocation(line: 192, column: 48, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1080, file: !67, line: 191, column: 93)
!1085 = !DILocation(line: 192, column: 21, scope: !1084)
!1086 = !DILocation(line: 192, column: 86, scope: !1084)
!1087 = !DILocation(line: 193, column: 21, scope: !1084)
!1088 = !{!1089, !562, i64 152}
!1089 = !{!"", !956, i64 0, !956, i64 8, !956, i64 16, !563, i64 24, !562, i64 152, !562, i64 156}
!1090 = !DILocation(line: 195, column: 17, scope: !1084)
!1091 = !DILocation(line: 202, column: 32, scope: !1070)
!1092 = !DILocation(line: 202, column: 13, scope: !1070)
!1093 = !DILocation(line: 204, column: 43, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1070, file: !67, line: 202, column: 41)
!1095 = !DILocation(line: 206, column: 17, scope: !1094)
!1096 = !DILocation(line: 212, column: 17, scope: !1094)
!1097 = !DILocation(line: 215, column: 17, scope: !1094)
!1098 = !DILocation(line: 221, column: 17, scope: !1094)
!1099 = !DILocation(line: 224, column: 17, scope: !1094)
!1100 = !DILocation(line: 232, column: 9, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !67, line: 232, column: 9)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !67, line: 232, column: 9)
!1103 = distinct !DILexicalBlock(scope: !1021, file: !67, line: 232, column: 9)
!1104 = !{!1066, !562, i64 4}
!1105 = !{!1066, !562, i64 8}
!1106 = !DILocation(line: 171, column: 42, scope: !1022)
!1107 = distinct !{!1107, !1056, !1108, !1109}
!1108 = !DILocation(line: 235, column: 5, scope: !1019)
!1109 = !{!"llvm.loop.mustprogress"}
!1110 = !DILocation(line: 241, column: 1, scope: !986)
!1111 = distinct !DISubprogram(name: "bootloader_utility_get_selected_boot_partition", scope: !67, file: !67, line: 347, type: !1112, scopeLine: 348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1116)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!55, !1114}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1116 = !{!1117, !1118, !1128, !1129, !1132}
!1117 = !DILocalVariable(name: "bs", arg: 1, scope: !1111, file: !67, line: 347, type: !1114)
!1118 = !DILocalVariable(name: "otadata", scope: !1111, file: !67, line: 349, type: !1119)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1120, size: 512, elements: !143)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_ota_select_entry_t", file: !36, line: 65, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 60, size: 256, elements: !1122)
!1122 = !{!1123, !1124, !1126, !1127}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ota_seq", scope: !1121, file: !36, line: 61, baseType: !58, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "seq_label", scope: !1121, file: !36, line: 62, baseType: !1125, size: 160, offset: 32)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 160, elements: !941)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ota_state", scope: !1121, file: !36, line: 63, baseType: !58, size: 32, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !1121, file: !36, line: 64, baseType: !58, size: 32, offset: 224)
!1128 = !DILocalVariable(name: "boot_index", scope: !1111, file: !67, line: 350, type: !55)
!1129 = !DILocalVariable(name: "active_otadata", scope: !1130, file: !67, line: 395, type: !55)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !67, line: 394, column: 12)
!1131 = distinct !DILexicalBlock(scope: !1111, file: !67, line: 376, column: 9)
!1132 = !DILocalVariable(name: "ota_seq", scope: !1133, file: !67, line: 411, type: !58)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !67, line: 409, column: 35)
!1134 = distinct !DILexicalBlock(scope: !1130, file: !67, line: 409, column: 13)
!1135 = !DILocation(line: 0, scope: !1111)
!1136 = !DILocation(line: 349, column: 5, scope: !1111)
!1137 = !DILocation(line: 349, column: 28, scope: !1111)
!1138 = !DILocation(line: 352, column: 22, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1111, file: !67, line: 352, column: 9)
!1140 = !{!1089, !562, i64 0}
!1141 = !DILocation(line: 352, column: 29, scope: !1139)
!1142 = !DILocation(line: 352, column: 9, scope: !1111)
!1143 = !DILocation(line: 356, column: 9, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1111, file: !67, line: 356, column: 9)
!1145 = !DILocalVariable(name: "ota_info", arg: 1, scope: !1146, file: !67, line: 96, type: !915)
!1146 = distinct !DISubprogram(name: "read_otadata", scope: !67, file: !67, line: 96, type: !1147, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1150)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!913, !915, !1149}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 32)
!1150 = !{!1145, !1151, !1152}
!1151 = !DILocalVariable(name: "two_otadata", arg: 2, scope: !1146, file: !67, line: 96, type: !1149)
!1152 = !DILocalVariable(name: "ota_select_map", scope: !1146, file: !67, line: 98, type: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 32)
!1154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1155 = !DILocation(line: 0, scope: !1146, inlinedAt: !1156)
!1156 = distinct !DILocation(line: 356, column: 9, scope: !1144)
!1157 = !DILocation(line: 99, column: 19, scope: !1158, inlinedAt: !1156)
!1158 = distinct !DILexicalBlock(scope: !1146, file: !67, line: 99, column: 9)
!1159 = !DILocation(line: 99, column: 26, scope: !1158, inlinedAt: !1156)
!1160 = !DILocation(line: 99, column: 9, scope: !1146, inlinedAt: !1156)
!1161 = !DILocation(line: 104, column: 19, scope: !1162, inlinedAt: !1156)
!1162 = distinct !DILexicalBlock(scope: !1146, file: !67, line: 104, column: 9)
