; ModuleID = 'build//system/efuse/bootloader/bootloader.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-i8:8:32-i16:16:32-i64:64-n32"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (i32)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque
%struct._mprec = type { %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint** }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%struct._rand48 = type { [3 x i16], [3 x i16], i16, i64 }
%struct.__tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args* }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, %struct._reent*, i8*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i32, %struct.__lock*, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct.__lock = type { [23 x i32] }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!173 = !DILocalVariable(name: "digest_words", scope: !163, file: !155, line: 110, type: !133)
!174 = !DILocalVariable(name: "sha_text_reg", scope: !163, file: !155, line: 111, type: !133)
!175 = !DILocalVariable(name: "i", scope: !176, file: !155, line: 112, type: !157)
!176 = distinct !DILexicalBlock(scope: !163, file: !155, line: 112, column: 5)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 512, elements: !179)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!179 = !{!180}
!180 = !DISubrange(count: 64)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!182 = distinct !DIGlobalVariable(name: "DIGEST_WORDS", scope: !147, file: !155, line: 21, type: !156, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!184 = distinct !DIGlobalVariable(name: "mapped", scope: !185, file: !199, line: 152, type: !84, isLocal: true, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !187, retainedTypes: !194, globals: !195, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!187 = !{!188}
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 43, baseType: !17, size: 32, elements: !190)
!189 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_spiflash.h", directory: "/home/mjshen/RTOSExploration/esp")
!190 = !{!191, !192, !193}
!191 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_OK", value: 0)
!192 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_ERR", value: 1)
!193 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_TIMEOUT", value: 2)
!194 = !{!35, !134, !133}
!195 = !{!196, !197, !200}
!196 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "TAG", scope: !185, file: !199, line: 124, type: !81, isLocal: true, isDefinition: true)
!199 = !DIFile(filename: "esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp")
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "current_read_mapping", scope: !185, file: !199, line: 155, type: !39, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "bootloader_image_hdr", scope: !204, file: !233, line: 25, type: !234, isLocal: false, isDefinition: true, align: 32)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !226, globals: !230, splitDebugInlining: false, nameTableKind: None)
!205 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!206 = !{!127, !5, !207, !213, !219}
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 21, baseType: !17, size: 32, elements: !209)
!208 = !DIFile(filename: "esp-idf/components/hal/include/hal/wdt_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!209 = !{!210, !211, !212}
!210 = !DIEnumerator(name: "WDT_RWDT", value: 0)
!211 = !DIEnumerator(name: "WDT_MWDT0", value: 1)
!212 = !DIEnumerator(name: "WDT_MWDT1", value: 2)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 30, baseType: !17, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218}
!215 = !DIEnumerator(name: "WDT_STAGE0", value: 0)
!216 = !DIEnumerator(name: "WDT_STAGE1", value: 1)
!217 = !DIEnumerator(name: "WDT_STAGE2", value: 2)
!218 = !DIEnumerator(name: "WDT_STAGE3", value: 3)
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 43, baseType: !17, size: 32, elements: !220)
!220 = !{!221, !222, !223, !224, !225}
!221 = !DIEnumerator(name: "WDT_STAGE_ACTION_OFF", value: 0)
!222 = !DIEnumerator(name: "WDT_STAGE_ACTION_INT", value: 1)
!223 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_CPU", value: 2)
!224 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_SYSTEM", value: 3)
!225 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_RTC", value: 4)
!226 = !{!39, !227}
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !40, line: 60, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !42, line: 105, baseType: !229)
!229 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!230 = !{!202, !231}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "TAG", scope: !204, file: !233, line: 23, type: !81, isLocal: true, isDefinition: true)
!233 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_image_header_t", file: !6, line: 93, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 74, size: 192, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !248, !250, !251, !255}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !235, file: !6, line: 75, baseType: !44, size: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !235, file: !6, line: 76, baseType: !44, size: 8, offset: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "spi_mode", scope: !235, file: !6, line: 77, baseType: !44, size: 8, offset: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "spi_speed", scope: !235, file: !6, line: 78, baseType: !44, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 24)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "spi_size", scope: !235, file: !6, line: 79, baseType: !44, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 24)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "entry_addr", scope: !235, file: !6, line: 80, baseType: !39, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "wp_pin", scope: !235, file: !6, line: 81, baseType: !44, size: 8, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "spi_pin_drv", scope: !235, file: !6, line: 84, baseType: !245, size: 24, offset: 72)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 3)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "chip_id", scope: !235, file: !6, line: 85, baseType: !249, size: 16, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_chip_id_t", file: !6, line: 26, baseType: !5)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "min_chip_rev", scope: !235, file: !6, line: 86, baseType: !44, size: 8, offset: 112)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !235, file: !6, line: 87, baseType: !252, size: 64, offset: 120)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "hash_appended", scope: !235, file: !6, line: 88, baseType: !44, size: 8, offset: 184)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "s_burn_counter", scope: !258, file: !285, line: 21, type: !291, isLocal: true, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !260, retainedTypes: !280, globals: !282, splitDebugInlining: false, nameTableKind: None)
!259 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/efuse/src/esp_efuse_utility.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!260 = !{!261, !275}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 19, baseType: !17, size: 32, elements: !263)
!262 = !DIFile(filename: "esp-idf/components/efuse/esp32/include/esp_efuse_chip.h", directory: "/home/mjshen/RTOSExploration/esp")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!264 = !DIEnumerator(name: "EFUSE_BLK0", value: 0)
!265 = !DIEnumerator(name: "EFUSE_BLK1", value: 1)
!266 = !DIEnumerator(name: "EFUSE_BLK_KEY0", value: 1)
!267 = !DIEnumerator(name: "EFUSE_BLK_ENCRYPT_FLASH", value: 1)
!268 = !DIEnumerator(name: "EFUSE_BLK2", value: 2)
!269 = !DIEnumerator(name: "EFUSE_BLK_KEY1", value: 2)
!270 = !DIEnumerator(name: "EFUSE_BLK_SECURE_BOOT", value: 2)
!271 = !DIEnumerator(name: "EFUSE_BLK3", value: 3)
!272 = !DIEnumerator(name: "EFUSE_BLK_KEY2", value: 3)
!273 = !DIEnumerator(name: "EFUSE_BLK_KEY_MAX", value: 4)
!274 = !DIEnumerator(name: "EFUSE_BLK_MAX", value: 4)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 40, baseType: !17, size: 32, elements: !276)
!276 = !{!277, !278, !279}
!277 = !DIEnumerator(name: "EFUSE_CODING_SCHEME_NONE", value: 0)
!278 = !DIEnumerator(name: "EFUSE_CODING_SCHEME_3_4", value: 1)
!279 = !DIEnumerator(name: "EFUSE_CODING_SCHEME_REPEAT", value: 2)
!280 = !{!35, !43, !44, !281, !37, !39, !133}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!282 = !{!283, !256, !289}
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "virt_blocks", scope: !258, file: !285, line: 25, type: !286, isLocal: false, isDefinition: true)
!285 = !DIFile(filename: "esp-idf/components/efuse/src/esp_efuse_utility.c", directory: "/home/mjshen/RTOSExploration/esp")
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1024, elements: !287)
!287 = !{!288, !254}
!288 = !DISubrange(count: 4)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "TAG", scope: !258, file: !285, line: 16, type: !81, isLocal: true, isDefinition: true)
!291 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !17)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "range_read_addr_blocks", scope: !294, file: !300, line: 23, type: !301, isLocal: false, isDefinition: true)
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !260, retainedTypes: !296, globals: !297, splitDebugInlining: false, nameTableKind: None)
!295 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/efuse/esp32/esp_efuse_utility.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!296 = !{!37, !35, !133, !43}
!297 = !{!292, !298, !310, !312}
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "range_write_addr_blocks", scope: !294, file: !300, line: 33, type: !301, isLocal: false, isDefinition: true)
!300 = !DIFile(filename: "esp-idf/components/efuse/esp32/esp_efuse_utility.c", directory: "/home/mjshen/RTOSExploration/esp")
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 256, elements: !309)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_efuse_range_addr_t", file: !304, line: 34, baseType: !305)
!304 = !DIFile(filename: "esp-idf/components/efuse/private_include/esp_efuse_utility.h", directory: "/home/mjshen/RTOSExploration/esp")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 31, size: 64, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !305, file: !304, line: 32, baseType: !39, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !305, file: !304, line: 33, baseType: !39, size: 32, offset: 32)
!309 = !{!288}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "write_mass_blocks", scope: !294, file: !300, line: 30, type: !286, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "TAG", scope: !294, file: !300, line: 16, type: !81, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "intr_desc_table", scope: !316, file: !340, line: 164, type: !341, isLocal: true, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !318, retainedTypes: !337, globals: !339, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!318 = !{!319, !325, !332}
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !320, line: 37, baseType: !17, size: 32, elements: !321)
!320 = !DIFile(filename: "esp-idf/components/esp_hw_support/include/esp_cpu.h", directory: "/home/mjshen/RTOSExploration/esp")
!321 = !{!322, !323, !324}
!322 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_LEVEL", value: 0)
!323 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_EDGE", value: 1)
!324 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_NA", value: 2)
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 23, baseType: !17, size: 32, elements: !327)
!326 = !DIFile(filename: "esp-idf/components/hal/include/hal/mpu_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!327 = !{!328, !329, !330, !331}
!328 = !DIEnumerator(name: "MPU_REGION_ILLEGAL", value: 0)
!329 = !DIEnumerator(name: "MPU_REGION_RW", value: 1)
!330 = !DIEnumerator(name: "MPU_REGION_X", value: 2)
!331 = !DIEnumerator(name: "MPU_REGION_RWX", value: 3)
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !320, line: 70, baseType: !17, size: 32, elements: !333)
!333 = !{!334, !335, !336}
!334 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_LOAD", value: 0)
!335 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_STORE", value: 1)
!336 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_ACCESS", value: 2)
!337 = !{!39, !37, !338}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !42, line: 184, baseType: !17)
!339 = !{!314}
!340 = !DIFile(filename: "esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp")
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 4096, elements: !350)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "intr_desc_t", file: !340, line: 160, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 156, size: 128, elements: !345)
!345 = !{!346, !347, !349}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !344, file: !340, line: 157, baseType: !36, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !344, file: !340, line: 158, baseType: !348, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_intr_type_t", file: !320, line: 41, baseType: !319)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !344, file: !340, line: 159, baseType: !142, size: 64, offset: 64)
!350 = !{!351}
!351 = !DISubrange(count: 32)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "s_cur_pll_freq", scope: !354, file: !398, line: 35, type: !338, isLocal: true, isDefinition: true)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !356, retainedTypes: !390, globals: !395, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!356 = !{!357, !363, !371, !378, !384}
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !358, line: 77, baseType: !17, size: 32, elements: !359)
!358 = !DIFile(filename: "esp-idf/components/hal/esp32/include/hal/clk_tree_ll.h", directory: "/home/mjshen/RTOSExploration/esp")
!359 = !{!360, !361, !362}
!360 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_CRYSTAL", value: 0)
!361 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_EXTERNAL", value: 1)
!362 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_BOOTSTRAP", value: 2)
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !364, line: 64, baseType: !17, size: 32, elements: !365)
!364 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/clk_tree_defs.h", directory: "/home/mjshen/RTOSExploration/esp")
!365 = !{!366, !367, !368, !369, !370}
!366 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_XTAL", value: 0)
!367 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_PLL", value: 1)
!368 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_RC_FAST", value: 2)
!369 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_APLL", value: 3)
!370 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_INVALID", value: 4)
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !372, line: 82, baseType: !17, size: 32, elements: !373)
!372 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/rtc.h", directory: "/home/mjshen/RTOSExploration/esp")
!373 = !{!374, !375, !376, !377}
!374 = !DIEnumerator(name: "RTC_XTAL_FREQ_AUTO", value: 0)
!375 = !DIEnumerator(name: "RTC_XTAL_FREQ_40M", value: 40)
!376 = !DIEnumerator(name: "RTC_XTAL_FREQ_26M", value: 26)
!377 = !DIEnumerator(name: "RTC_XTAL_FREQ_24M", value: 24)
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !364, line: 76, baseType: !17, size: 32, elements: !379)
!379 = !{!380, !381, !382, !383}
!380 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_SLOW", value: 0)
!381 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_XTAL32K", value: 1)
!382 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_FAST_D256", value: 2)
!383 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_INVALID", value: 3)
!384 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !364, line: 87, baseType: !17, size: 32, elements: !385)
!385 = !{!386, !387, !388, !389}
!386 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_D4", value: 0)
!387 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_DIV", value: 0)
!388 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_RC_FAST", value: 1)
!389 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_INVALID", value: 2)
!390 = !{!338, !391, !36, !393, !394}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !338)
!393 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtc_xtal_freq_t", file: !372, line: 87, baseType: !371)
!395 = !{!352, !396}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "TAG", scope: !354, file: !398, line: 37, type: !81, isLocal: true, isDefinition: true)
!398 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp")
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!400 = distinct !DIGlobalVariable(name: "s_lock", scope: !401, file: !407, line: 12, type: !36, isLocal: true, isDefinition: true)
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !403, globals: !405, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_cycle_count_t", file: !320, line: 32, baseType: !39)
!405 = !{!406}
!406 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!407 = !DIFile(filename: "esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp")
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !410, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/soc/esp32/./dport_access.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!410 = !{!73}
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !413, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!413 = !{!134, !84}
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !416, globals: !417, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader/subproject/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!416 = !{!108}
!417 = !{!418}
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "TAG", scope: !414, file: !420, line: 14, type: !81, isLocal: true, isDefinition: true)
!420 = !DIFile(filename: "esp-idf/components/bootloader/subproject/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp")
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !423, retainedTypes: !430, globals: !431, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!423 = !{!261, !424}
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !425, line: 23, baseType: !17, size: 32, elements: !426)
!425 = !DIFile(filename: "esp-idf/components/bootloader_support/include/esp_flash_encrypt.h", directory: "/home/mjshen/RTOSExploration/esp")
!426 = !{!427, !428, !429}
!427 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DISABLED", value: 0)
!428 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DEVELOPMENT", value: 1)
!429 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_RELEASE", value: 2)
!430 = !{!37}
!431 = !{!432}
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "TAG", scope: !421, file: !434, line: 23, type: !81, isLocal: true, isDefinition: true)
!434 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp")
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !437, globals: !439, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!439 = !{!440}
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "TAG", scope: !435, file: !442, line: 12, type: !81, isLocal: true, isDefinition: true)
!442 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp")
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_soc.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !449, retainedTypes: !450, globals: !451, splitDebugInlining: false, nameTableKind: None)
!448 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!449 = !{!5, !188, !108}
!450 = !{!39, !37}
!451 = !{!452}
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "TAG", scope: !447, file: !454, line: 40, type: !81, isLocal: true, isDefinition: true)
!454 = !DIFile(filename: "esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp")
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !457, retainedTypes: !463, globals: !465, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!457 = !{!458, !5}
!458 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 16, baseType: !36, size: 32, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIEnumerator(name: "GPIO_LONG_HOLD", value: 1)
!461 = !DIEnumerator(name: "GPIO_SHORT_HOLD", value: -1)
!462 = !DIEnumerator(name: "GPIO_NOT_HOLD", value: 0)
!463 = !{!39, !37, !35, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!465 = !{!466}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "TAG", scope: !455, file: !468, line: 30, type: !81, isLocal: true, isDefinition: true)
!468 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp")
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !472, globals: !473, splitDebugInlining: false, nameTableKind: None)
!470 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!471 = !{!15, !5, !127}
!472 = !{!43, !35}
!473 = !{!474}
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "TAG", scope: !469, file: !476, line: 29, type: !81, isLocal: true, isDefinition: true)
!476 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp")
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !479, retainedTypes: !480, splitDebugInlining: false, nameTableKind: None)
!478 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_clock_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!479 = !{!108, !371, !384, !378}
!480 = !{!391}
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_mem.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !485, splitDebugInlining: false, nameTableKind: None)
!484 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!485 = !{!43, !35, !37, !404}
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !488, splitDebugInlining: false, nameTableKind: None)
!487 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!488 = !{!338, !391}
!489 = distinct !DICompileUnit(language: DW_LANG_C99, file: !490, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !491, retainedTypes: !450, splitDebugInlining: false, nameTableKind: None)
!490 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash_config_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!491 = !{!5, !188, !492}
!492 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 47, baseType: !17, size: 32, elements: !493)
!493 = !{!494, !495, !496, !497}
!494 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_2", value: 0)
!495 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_3", value: 1)
!496 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_4", value: 2)
!497 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_1", value: 15)
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !430, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_efuse.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !504, retainedTypes: !510, globals: !511, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!504 = !{!371, !384, !378, !363, !505}
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !372, line: 102, baseType: !17, size: 32, elements: !506)
!506 = !{!507, !508, !509}
!507 = !DIEnumerator(name: "RTC_CAL_RTC_MUX", value: 0)
!508 = !DIEnumerator(name: "RTC_CAL_8MD256", value: 1)
!509 = !DIEnumerator(name: "RTC_CAL_32K_XTAL", value: 2)
!510 = !{!37, !227, !39, !404}
!511 = !{!512}
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "TAG", scope: !502, file: !514, line: 31, type: !81, isLocal: true, isDefinition: true)
!514 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !488, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !519, retainedTypes: !520, globals: !522, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!519 = !{!505, !371, !378}
!520 = !{!338, !521, !391}
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !42, line: 202, baseType: !229)
!522 = !{!523}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "TAG", scope: !517, file: !525, line: 14, type: !81, isLocal: true, isDefinition: true)
!525 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp")
!526 = distinct !DICompileUnit(language: DW_LANG_C99, file: !527, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!527 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_sys.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!529 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_uart.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !532, retainedTypes: !547, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_spiflash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!532 = !{!188, !533}
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 19, baseType: !17, size: 32, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!535 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QIO_MODE", value: 0)
!536 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QOUT_MODE", value: 1)
!537 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DIO_MODE", value: 2)
!538 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DOUT_MODE", value: 3)
!539 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_FASTRD_MODE", value: 4)
!540 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_SLOWRD_MODE", value: 5)
!541 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_STR_MODE", value: 6)
!542 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_DTR_MODE", value: 7)
!543 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OOUT_MODE", value: 8)
!544 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_STR_MODE", value: 9)
!545 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_DTR_MODE", value: 10)
!546 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QPI_MODE", value: 11)
!547 = !{!391, !338, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !551, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mpu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!551 = !{!325}
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !554, splitDebugInlining: false, nameTableKind: None)
!553 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!554 = !{!555, !556, !557, !73}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !76, line: 207, baseType: !7)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!558 = distinct !DICompileUnit(language: DW_LANG_C99, file: !559, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !410, splitDebugInlining: false, nameTableKind: None)
!559 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/esp32/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !450, splitDebugInlining: false, nameTableKind: None)
!561 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mmu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!562 = distinct !DICompileUnit(language: DW_LANG_C99, file: !563, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !564, splitDebugInlining: false, nameTableKind: None)
!563 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/wdt_hal_iram.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/system/efuse/bootloader")
!564 = !{!207, !213, !565, !219}
!565 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 57, baseType: !17, size: 32, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574}
!567 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_100ns", value: 0)
!568 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_200ns", value: 1)
!569 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_300ns", value: 2)
!570 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_400ns", value: 3)
!571 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_500ns", value: 4)
!572 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_800ns", value: 5)
!573 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_1_6us", value: 6)
!574 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_3_2us", value: 7)
!575 = !{!"clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)"}
!576 = !{i32 7, !"Dwarf Version", i32 4}
!577 = !{i32 2, !"Debug Info Version", i32 3}
!578 = !{i32 1, !"wchar_size", i32 1}
!579 = distinct !DISubprogram(name: "esp_dport_access_reg_read", scope: !580, file: !580, line: 13, type: !581, scopeLine: 14, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !583)
!580 = !DIFile(filename: "esp-idf/components/soc/esp32/dport_access.c", directory: "/home/mjshen/RTOSExploration/esp")
!581 = !DISubroutineType(types: !582)
!582 = !{!75, !75}
!583 = !{!584}
!584 = !DILocalVariable(name: "reg", arg: 1, scope: !579, file: !580, line: 13, type: !75)
!585 = !DILocation(line: 0, scope: !579)
!586 = !DILocation(line: 16, column: 12, scope: !579)
!587 = !{!588, !588, i64 0}
!588 = !{!"int", !589, i64 0}
!589 = !{!"omnipotent char", !590, i64 0}
!590 = !{!"Simple C/C++ TBAA"}
!591 = !DILocation(line: 16, column: 5, scope: !579)
!592 = distinct !DISubprogram(name: "esp_dport_access_sequence_reg_read", scope: !580, file: !580, line: 35, type: !581, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !593)
!593 = !{!594}
!594 = !DILocalVariable(name: "reg", arg: 1, scope: !592, file: !580, line: 35, type: !75)
!595 = !DILocation(line: 0, scope: !592)
!596 = !DILocation(line: 38, column: 12, scope: !592)
!597 = !DILocation(line: 38, column: 5, scope: !592)
!598 = distinct !DISubprogram(name: "__assert_func", scope: !599, file: !599, line: 13, type: !600, scopeLine: 14, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !411, retainedNodes: !602)
!599 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp")
!600 = !DISubroutineType(types: !601)
!601 = !{null, !81, !36, !81, !81}
!602 = !{!603, !604, !605, !606}
!603 = !DILocalVariable(name: "file", arg: 1, scope: !598, file: !599, line: 13, type: !81)
!604 = !DILocalVariable(name: "line", arg: 2, scope: !598, file: !599, line: 13, type: !36)
!605 = !DILocalVariable(name: "func", arg: 3, scope: !598, file: !599, line: 13, type: !81)
!606 = !DILocalVariable(name: "expr", arg: 4, scope: !598, file: !599, line: 13, type: !81)
!607 = !DILocation(line: 0, scope: !598)
!608 = !DILocation(line: 17, column: 5, scope: !598)
!609 = !DILocation(line: 20, column: 5, scope: !598)
!610 = distinct !{!610, !609, !611}
!611 = !DILocation(line: 21, column: 5, scope: !598)
!612 = !DISubprogram(name: "esp_rom_printf", scope: !613, file: !613, line: 24, type: !614, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !616)
!613 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_sys.h", directory: "/home/mjshen/RTOSExploration/esp")
!614 = !DISubroutineType(types: !615)
!615 = !{!36, !81, null}
!616 = !{}
!617 = distinct !DISubprogram(name: "abort", scope: !599, file: !599, line: 24, type: !71, scopeLine: 25, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !411, retainedNodes: !616)
!618 = !DILocation(line: 27, column: 69, scope: !617)
!619 = !DILocation(line: 27, column: 59, scope: !617)
!620 = !DILocation(line: 27, column: 97, scope: !617)
!621 = !DILocation(line: 27, column: 5, scope: !617)
!622 = !DILocalVariable(name: "dcr", scope: !623, file: !624, line: 189, type: !338)
!623 = distinct !DISubprogram(name: "xt_utils_dbgr_is_attached", scope: !624, file: !624, line: 187, type: !625, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !411, retainedNodes: !627)
!624 = !DIFile(filename: "esp-idf/components/xtensa/include/xt_utils.h", directory: "/home/mjshen/RTOSExploration/esp")
!625 = !DISubroutineType(types: !626)
!626 = !{!84}
!627 = !{!622, !628}
!628 = !DILocalVariable(name: "reg", scope: !623, file: !624, line: 190, type: !338)
!629 = !DILocation(line: 0, scope: !623, inlinedAt: !630)
!630 = distinct !DILocation(line: 497, column: 12, scope: !631, inlinedAt: !632)
!631 = distinct !DISubprogram(name: "esp_cpu_dbgr_is_attached", scope: !320, file: !320, line: 494, type: !625, scopeLine: 495, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !411, retainedNodes: !616)
!632 = distinct !DILocation(line: 29, column: 9, scope: !633)
!633 = distinct !DILexicalBlock(scope: !617, file: !599, line: 29, column: 9)
!634 = !DILocation(line: 191, column: 5, scope: !623, inlinedAt: !630)
!635 = !{i64 2148037585}
!636 = !DILocation(line: 192, column: 23, scope: !623, inlinedAt: !630)
!637 = !DILocation(line: 192, column: 12, scope: !623, inlinedAt: !630)
!638 = !DILocation(line: 29, column: 9, scope: !617)
!639 = !DILocation(line: 197, column: 5, scope: !640, inlinedAt: !641)
!640 = distinct !DISubprogram(name: "xt_utils_dbgr_break", scope: !624, file: !624, line: 195, type: !71, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !411, retainedNodes: !616)
!641 = distinct !DILocation(line: 509, column: 5, scope: !642, inlinedAt: !643)
!642 = distinct !DISubprogram(name: "esp_cpu_dbgr_break", scope: !320, file: !320, line: 506, type: !71, scopeLine: 507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !411, retainedNodes: !616)
!643 = distinct !DILocation(line: 30, column: 9, scope: !644)
!644 = distinct !DILexicalBlock(scope: !633, file: !599, line: 29, column: 37)
!645 = !{i64 513438}
!646 = !DILocation(line: 31, column: 5, scope: !644)
!647 = !DILocation(line: 32, column: 5, scope: !617)
!648 = distinct !{!648, !647, !649}
!649 = !DILocation(line: 33, column: 5, scope: !617)
!650 = distinct !DISubprogram(name: "call_start_cpu0", scope: !420, file: !420, line: 24, type: !71, scopeLine: 25, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !651)
!651 = !{!652, !671}
!652 = !DILocalVariable(name: "bs", scope: !650, file: !420, line: 50, type: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !654, line: 32, baseType: !655)
!654 = !DIFile(filename: "esp-idf/components/bootloader_support/private_include/bootloader_config.h", directory: "/home/mjshen/RTOSExploration/esp")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !654, line: 25, size: 1280, elements: !656)
!656 = !{!657, !663, !664, !665, !669, !670}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !655, file: !654, line: 26, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !16, line: 71, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 68, size: 64, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !659, file: !16, line: 69, baseType: !39, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !659, file: !16, line: 70, baseType: !39, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !655, file: !654, line: 27, baseType: !658, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !655, file: !654, line: 28, baseType: !658, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !655, file: !654, line: 29, baseType: !666, size: 1024, offset: 192)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 1024, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 16)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !655, file: !654, line: 30, baseType: !39, size: 32, offset: 1216)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !655, file: !654, line: 31, baseType: !39, size: 32, offset: 1248)
!671 = !DILocalVariable(name: "boot_index", scope: !650, file: !420, line: 51, type: !36)
!672 = !DILocation(line: 27, column: 9, scope: !650)
!673 = !DILocation(line: 28, column: 9, scope: !674)
!674 = distinct !DILexicalBlock(scope: !675, file: !420, line: 27, column: 33)
!675 = distinct !DILexicalBlock(scope: !650, file: !420, line: 27, column: 9)
!676 = !DILocation(line: 29, column: 5, scope: !674)
!677 = !DILocation(line: 32, column: 9, scope: !678)
!678 = distinct !DILexicalBlock(scope: !650, file: !420, line: 32, column: 9)
!679 = !DILocation(line: 32, column: 27, scope: !678)
!680 = !DILocation(line: 32, column: 9, scope: !650)
!681 = !DILocation(line: 33, column: 9, scope: !682)
!682 = distinct !DILexicalBlock(scope: !678, file: !420, line: 32, column: 38)
!683 = !DILocation(line: 37, column: 9, scope: !650)
!684 = !DILocation(line: 38, column: 9, scope: !685)
!685 = distinct !DILexicalBlock(scope: !686, file: !420, line: 37, column: 32)
!686 = distinct !DILexicalBlock(scope: !650, file: !420, line: 37, column: 9)
!687 = !DILocation(line: 39, column: 5, scope: !685)
!688 = !DILocation(line: 50, column: 5, scope: !650)
!689 = !DILocation(line: 50, column: 24, scope: !650)
!690 = !DILocation(line: 51, column: 22, scope: !650)
!691 = !DILocalVariable(name: "bs", arg: 1, scope: !692, file: !420, line: 61, type: !695)
!692 = distinct !DISubprogram(name: "select_partition_number", scope: !420, file: !420, line: 61, type: !693, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !696)
!693 = !DISubroutineType(types: !694)
!694 = !{!36, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!696 = !{!691}
!697 = !DILocation(line: 0, scope: !692, inlinedAt: !698)
!698 = distinct !DILocation(line: 51, column: 22, scope: !650)
!699 = !DILocation(line: 64, column: 10, scope: !700, inlinedAt: !698)
!700 = distinct !DILexicalBlock(scope: !692, file: !420, line: 64, column: 9)
!701 = !DILocation(line: 64, column: 9, scope: !692, inlinedAt: !698)
!702 = !DILocation(line: 65, column: 9, scope: !703, inlinedAt: !698)
!703 = distinct !DILexicalBlock(scope: !704, file: !420, line: 65, column: 9)
!704 = distinct !DILexicalBlock(scope: !705, file: !420, line: 65, column: 9)
!705 = distinct !DILexicalBlock(scope: !706, file: !420, line: 65, column: 9)
!706 = distinct !DILexicalBlock(scope: !700, file: !420, line: 64, column: 55)
!707 = !DILocation(line: 66, column: 9, scope: !706, inlinedAt: !698)
!708 = !DILocalVariable(name: "bs", arg: 1, scope: !709, file: !420, line: 77, type: !712)
!709 = distinct !DISubprogram(name: "selected_boot_partition", scope: !420, file: !420, line: 77, type: !710, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !714)
!710 = !DISubroutineType(types: !711)
!711 = !{!36, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!714 = !{!708, !715}
!715 = !DILocalVariable(name: "boot_index", scope: !709, file: !420, line: 79, type: !36)
!716 = !DILocation(line: 0, scope: !709, inlinedAt: !717)
!717 = distinct !DILocation(line: 70, column: 12, scope: !692, inlinedAt: !698)
!718 = !DILocation(line: 79, column: 22, scope: !709, inlinedAt: !717)
!719 = !DILocation(line: 80, column: 20, scope: !720, inlinedAt: !717)
!720 = distinct !DILexicalBlock(scope: !709, file: !420, line: 80, column: 9)
!721 = !DILocation(line: 80, column: 9, scope: !709, inlinedAt: !717)
!722 = !DILocation(line: 0, scope: !650)
!723 = !DILocation(line: 53, column: 9, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !420, line: 52, column: 38)
!725 = distinct !DILexicalBlock(scope: !650, file: !420, line: 52, column: 9)
!726 = !DILocation(line: 83, column: 9, scope: !727, inlinedAt: !717)
!727 = distinct !DILexicalBlock(scope: !709, file: !420, line: 83, column: 9)
!728 = !DILocation(line: 57, column: 5, scope: !650)
!729 = !DISubprogram(name: "bootloader_before_init", scope: !730, file: !730, line: 30, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !616)
!730 = !DIFile(filename: "esp-idf/components/bootloader/subproject/main/bootloader_hooks.h", directory: "/home/mjshen/RTOSExploration/esp")
!731 = !DISubprogram(name: "bootloader_after_init", scope: !730, file: !730, line: 36, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !616)
!732 = !DISubprogram(name: "esp_rom_get_reset_reason", scope: !613, file: !613, line: 53, type: !733, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !616)
!733 = !DISubroutineType(types: !734)
!734 = !{!735, !36}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "soc_reset_reason_t", file: !109, line: 54, baseType: !108)
!736 = distinct !DISubprogram(name: "__getreent", scope: !420, file: !420, line: 130, type: !737, scopeLine: 131, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !616)
!737 = !DISubroutineType(types: !738)
!738 = !{!739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !741, line: 377, size: 1920, elements: !742)
!741 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/reent.h", directory: "/home/mjshen/RTOSExploration/esp")
!742 = !{!743, !744, !820, !821, !822, !823, !824, !825, !826, !830, !851, !855, !856, !857, !858, !867, !880, !881, !886, !903, !904, !911, !912, !928}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !740, file: !741, line: 381, baseType: !36, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !740, file: !741, line: 386, baseType: !745, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !741, line: 292, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !741, line: 186, size: 832, elements: !748)
!748 = !{!749, !750, !751, !752, !754, !755, !760, !761, !762, !763, !767, !771, !777, !781, !782, !783, !784, !786, !790, !791, !792, !794, !806, !819}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !747, file: !741, line: 187, baseType: !438, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !747, file: !741, line: 188, baseType: !36, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !747, file: !741, line: 189, baseType: !36, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !747, file: !741, line: 190, baseType: !753, size: 16, offset: 96)
!753 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !747, file: !741, line: 191, baseType: !753, size: 16, offset: 112)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !747, file: !741, line: 192, baseType: !756, size: 64, offset: 128)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !741, line: 122, size: 64, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !756, file: !741, line: 123, baseType: !438, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !756, file: !741, line: 124, baseType: !36, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !747, file: !741, line: 193, baseType: !36, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !747, file: !741, line: 196, baseType: !739, size: 32, offset: 224)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !747, file: !741, line: 200, baseType: !35, size: 32, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !747, file: !741, line: 202, baseType: !764, size: 32, offset: 288)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DISubroutineType(types: !766)
!766 = !{!36, !739, !35, !464, !36}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !747, file: !741, line: 204, baseType: !768, size: 32, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DISubroutineType(types: !770)
!770 = !{!36, !739, !35, !81, !36}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !747, file: !741, line: 207, baseType: !772, size: 32, offset: 352)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DISubroutineType(types: !774)
!774 = !{!775, !739, !35, !775, !36}
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !160, line: 116, baseType: !776)
!776 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !747, file: !741, line: 208, baseType: !778, size: 32, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DISubroutineType(types: !780)
!780 = !{!36, !739, !35}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !747, file: !741, line: 211, baseType: !756, size: 64, offset: 416)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !747, file: !741, line: 212, baseType: !438, size: 32, offset: 480)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !747, file: !741, line: 213, baseType: !36, size: 32, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !747, file: !741, line: 216, baseType: !785, size: 24, offset: 544)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 24, elements: !246)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !747, file: !741, line: 217, baseType: !787, size: 8, offset: 568)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 1)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !747, file: !741, line: 220, baseType: !756, size: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !747, file: !741, line: 223, baseType: !36, size: 32, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !747, file: !741, line: 224, baseType: !793, size: 32, offset: 672)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !160, line: 46, baseType: !776)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !747, file: !741, line: 231, baseType: !795, size: 32, offset: 704)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !741, line: 35, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !797, line: 34, baseType: !798)
!797 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !800, line: 23, size: 736, elements: !801)
!800 = !DIFile(filename: "esp-idf/components/newlib/platform_include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!801 = !{!802}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !799, file: !800, line: 24, baseType: !803, size: 736)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 736, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 23)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !747, file: !741, line: 233, baseType: !807, size: 64, offset: 736)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !160, line: 170, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 162, size: 64, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !808, file: !160, line: 164, baseType: !36, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !808, file: !160, line: 169, baseType: !812, size: 32, offset: 32)
!812 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !808, file: !160, line: 165, size: 32, elements: !813)
!813 = !{!814, !817}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !812, file: !160, line: 167, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !816, line: 116, baseType: !17)
!816 = !DIFile(filename: "xtensa-esp32-elf-clang/lib/clang/14.0.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/esp")
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !812, file: !160, line: 168, baseType: !818, size: 32)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !309)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !747, file: !741, line: 234, baseType: !36, size: 32, offset: 800)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !740, file: !741, line: 386, baseType: !745, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !740, file: !741, line: 386, baseType: !745, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !740, file: !741, line: 388, baseType: !36, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !740, file: !741, line: 390, baseType: !464, size: 32, offset: 160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !740, file: !741, line: 392, baseType: !36, size: 32, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !740, file: !741, line: 394, baseType: !36, size: 32, offset: 224)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !740, file: !741, line: 395, baseType: !827, size: 32, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !829, line: 9, flags: DIFlagFwdDecl)
!829 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/_locale.h", directory: "/home/mjshen/RTOSExploration/esp")
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !740, file: !741, line: 397, baseType: !831, size: 32, offset: 288)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !741, line: 349, size: 128, elements: !833)
!833 = !{!834, !847, !848, !849}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !832, file: !741, line: 352, baseType: !835, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !741, line: 52, size: 192, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !836, file: !741, line: 54, baseType: !835, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !836, file: !741, line: 55, baseType: !36, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !836, file: !741, line: 55, baseType: !36, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !836, file: !741, line: 55, baseType: !36, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !836, file: !741, line: 55, baseType: !36, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !836, file: !741, line: 56, baseType: !844, size: 32, offset: 160)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 32, elements: !788)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !741, line: 22, baseType: !846)
!846 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !832, file: !741, line: 353, baseType: !36, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !832, file: !741, line: 354, baseType: !835, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !832, file: !741, line: 355, baseType: !850, size: 32, offset: 96)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !740, file: !741, line: 399, baseType: !852, size: 32, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !739}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !740, file: !741, line: 401, baseType: !36, size: 32, offset: 352)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !740, file: !741, line: 404, baseType: !36, size: 32, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !740, file: !741, line: 405, baseType: !464, size: 32, offset: 416)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !740, file: !741, line: 407, baseType: !859, size: 32, offset: 448)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !741, line: 324, size: 192, elements: !861)
!861 = !{!862, !864, !865, !866}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !860, file: !741, line: 325, baseType: !863, size: 48)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !246)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !860, file: !741, line: 326, baseType: !863, size: 48, offset: 48)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !860, file: !741, line: 327, baseType: !7, size: 16, offset: 96)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !860, file: !741, line: 330, baseType: !229, size: 64, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !740, file: !741, line: 408, baseType: !868, size: 32, offset: 480)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !741, line: 60, size: 288, elements: !870)
!870 = !{!871, !872, !873, !874, !875, !876, !877, !878, !879}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !869, file: !741, line: 62, baseType: !36, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !869, file: !741, line: 63, baseType: !36, size: 32, offset: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !869, file: !741, line: 64, baseType: !36, size: 32, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !869, file: !741, line: 65, baseType: !36, size: 32, offset: 96)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !869, file: !741, line: 66, baseType: !36, size: 32, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !869, file: !741, line: 67, baseType: !36, size: 32, offset: 160)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !869, file: !741, line: 68, baseType: !36, size: 32, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !869, file: !741, line: 69, baseType: !36, size: 32, offset: 224)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !869, file: !741, line: 70, baseType: !36, size: 32, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !740, file: !741, line: 409, baseType: !464, size: 32, offset: 512)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !740, file: !741, line: 412, baseType: !882, size: 32, offset: 544)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 32)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !36}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !740, file: !741, line: 416, baseType: !887, size: 32, offset: 576)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !741, line: 90, size: 1120, elements: !889)
!889 = !{!890, !891, !892, !894}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !888, file: !741, line: 91, baseType: !887, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !888, file: !741, line: 92, baseType: !36, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !888, file: !741, line: 93, baseType: !893, size: 1024, offset: 64)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1024, elements: !350)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !888, file: !741, line: 94, baseType: !895, size: 32, offset: 1088)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !741, line: 79, size: 2112, elements: !897)
!897 = !{!898, !900, !901, !902}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !896, file: !741, line: 80, baseType: !899, size: 1024)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1024, elements: !350)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !896, file: !741, line: 81, baseType: !899, size: 1024, offset: 1024)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !896, file: !741, line: 83, baseType: !845, size: 32, offset: 2048)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !896, file: !741, line: 86, baseType: !845, size: 32, offset: 2080)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !740, file: !741, line: 417, baseType: !888, size: 1120, offset: 608)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !740, file: !741, line: 420, baseType: !905, size: 96, offset: 1728)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !741, line: 296, size: 96, elements: !906)
!906 = !{!907, !909, !910}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !905, file: !741, line: 298, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !905, file: !741, line: 299, baseType: !36, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !905, file: !741, line: 300, baseType: !745, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !740, file: !741, line: 421, baseType: !745, size: 32, offset: 1824)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !740, file: !741, line: 422, baseType: !913, size: 32, offset: 1856)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !741, line: 359, size: 640, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !922, !923, !924, !925, !926, !927}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !914, file: !741, line: 362, baseType: !464, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !914, file: !741, line: 363, baseType: !807, size: 64, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !914, file: !741, line: 364, baseType: !807, size: 64, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !914, file: !741, line: 365, baseType: !807, size: 64, offset: 160)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !914, file: !741, line: 366, baseType: !921, size: 64, offset: 224)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !253)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !914, file: !741, line: 367, baseType: !36, size: 32, offset: 288)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !914, file: !741, line: 368, baseType: !807, size: 64, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !914, file: !741, line: 369, baseType: !807, size: 64, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !914, file: !741, line: 370, baseType: !807, size: 64, offset: 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !914, file: !741, line: 371, baseType: !807, size: 64, offset: 512)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !914, file: !741, line: 372, baseType: !807, size: 64, offset: 576)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !740, file: !741, line: 423, baseType: !464, size: 32, offset: 1888)
!929 = !DILocation(line: 132, column: 12, scope: !736)
!930 = !{!931, !931, i64 0}
!931 = !{!"any pointer", !589, i64 0}
!932 = !DILocation(line: 132, column: 5, scope: !736)
!933 = distinct !DISubprogram(name: "bootloader_common_get_partition_description", scope: !48, file: !48, line: 123, type: !934, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !966)
!934 = !DISubroutineType(types: !935)
!935 = !{!936, !938, !945}
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_err_t", file: !937, line: 19, baseType: !36)
!937 = !DIFile(filename: "esp-idf/components/esp_common/include/esp_err.h", directory: "/home/mjshen/RTOSExploration/esp")
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !16, line: 71, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 68, size: 64, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !941, file: !16, line: 69, baseType: !39, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !941, file: !16, line: 70, baseType: !39, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_app_desc_t", file: !947, line: 35, baseType: !948)
!947 = !DIFile(filename: "esp-idf/components/esp_app_format/include/esp_app_desc.h", directory: "/home/mjshen/RTOSExploration/esp")
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !947, line: 24, size: 2048, elements: !949)
!949 = !{!950, !951, !952, !953, !955, !956, !958, !959, !960, !962}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "magic_word", scope: !948, file: !947, line: 25, baseType: !39, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "secure_version", scope: !948, file: !947, line: 26, baseType: !39, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "reserv1", scope: !948, file: !947, line: 27, baseType: !142, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !948, file: !947, line: 28, baseType: !954, size: 256, offset: 128)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, elements: !350)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "project_name", scope: !948, file: !947, line: 29, baseType: !954, size: 256, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !948, file: !947, line: 30, baseType: !957, size: 128, offset: 640)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, elements: !667)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !948, file: !947, line: 31, baseType: !957, size: 128, offset: 768)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "idf_ver", scope: !948, file: !947, line: 32, baseType: !954, size: 256, offset: 896)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "app_elf_sha256", scope: !948, file: !947, line: 33, baseType: !961, size: 256, offset: 1152)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 256, elements: !350)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "reserv2", scope: !948, file: !947, line: 34, baseType: !963, size: 640, offset: 1408)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 640, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 20)
!966 = !{!967, !968, !969, !970, !971}
!967 = !DILocalVariable(name: "partition", arg: 1, scope: !933, file: !48, line: 123, type: !938)
!968 = !DILocalVariable(name: "app_desc", arg: 2, scope: !933, file: !48, line: 123, type: !945)
!969 = !DILocalVariable(name: "app_desc_offset", scope: !933, file: !48, line: 129, type: !137)
!970 = !DILocalVariable(name: "mmap_size", scope: !933, file: !48, line: 130, type: !137)
!971 = !DILocalVariable(name: "image", scope: !933, file: !48, line: 131, type: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!973 = !DILocation(line: 0, scope: !933)
!974 = !DILocation(line: 125, column: 19, scope: !975)
!975 = distinct !DILexicalBlock(scope: !933, file: !48, line: 125, column: 9)
!976 = !DILocation(line: 125, column: 27, scope: !975)
!977 = !DILocation(line: 125, column: 61, scope: !975)
!978 = !{!979, !588, i64 0}
!979 = !{!"", !588, i64 0, !588, i64 4}
!980 = !DILocation(line: 125, column: 68, scope: !975)
!981 = !DILocation(line: 125, column: 9, scope: !933)
!982 = !DILocation(line: 131, column: 28, scope: !933)
!983 = !DILocation(line: 132, column: 15, scope: !984)
!984 = distinct !DILexicalBlock(scope: !933, file: !48, line: 132, column: 9)
!985 = !DILocation(line: 132, column: 9, scope: !933)
!986 = !DILocation(line: 133, column: 9, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !48, line: 133, column: 9)
!988 = distinct !DILexicalBlock(scope: !989, file: !48, line: 133, column: 9)
!989 = distinct !DILexicalBlock(scope: !990, file: !48, line: 133, column: 9)
!990 = distinct !DILexicalBlock(scope: !984, file: !48, line: 132, column: 24)
!991 = !DILocation(line: 134, column: 9, scope: !990)
!992 = !DILocation(line: 137, column: 28, scope: !933)
!993 = !DILocation(line: 137, column: 5, scope: !933)
!994 = !DILocation(line: 138, column: 5, scope: !933)
!995 = !DILocation(line: 140, column: 19, scope: !996)
!996 = distinct !DILexicalBlock(scope: !933, file: !48, line: 140, column: 9)
!997 = !{!998, !588, i64 0}
!998 = !{!"", !588, i64 0, !588, i64 4, !589, i64 8, !589, i64 16, !589, i64 48, !589, i64 80, !589, i64 96, !589, i64 112, !589, i64 144, !589, i64 176}
!999 = !DILocation(line: 140, column: 30, scope: !996)
!1000 = !DILocation(line: 145, column: 1, scope: !933)
!1001 = !DISubprogram(name: "memcpy", scope: !1002, file: !1002, line: 31, type: !1003, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !616)
!1002 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/string.h", directory: "/home/mjshen/RTOSExploration/esp")
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!35, !1005, !1006, !157}
!1005 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !35)
!1006 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1009 = distinct !DISubprogram(name: "bootloader_utility_load_partition_table", scope: !48, file: !48, line: 148, type: !1010, scopeLine: 149, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1023)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!84, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !654, line: 32, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !654, line: 25, size: 1280, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1021, !1022}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !1014, file: !654, line: 26, baseType: !940, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !1014, file: !654, line: 27, baseType: !940, size: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !1014, file: !654, line: 28, baseType: !940, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !1014, file: !654, line: 29, baseType: !1020, size: 1024, offset: 192)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 1024, elements: !667)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !1014, file: !654, line: 30, baseType: !39, size: 32, offset: 1216)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !1014, file: !654, line: 31, baseType: !39, size: 32, offset: 1248)
!1023 = !{!1024, !1025, !1040, !1041, !1042, !1043, !1045}
!1024 = !DILocalVariable(name: "bs", arg: 1, scope: !1009, file: !48, line: 148, type: !1012)
!1025 = !DILocalVariable(name: "partitions", scope: !1009, file: !48, line: 150, type: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_info_t", file: !16, line: 83, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 76, size: 256, elements: !1030)
!1030 = !{!1031, !1034, !1035, !1036, !1037, !1039}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1029, file: !16, line: 77, baseType: !1032, size: 16)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !40, line: 36, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !42, line: 57, baseType: !7)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1029, file: !16, line: 78, baseType: !44, size: 8, offset: 16)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1029, file: !16, line: 79, baseType: !44, size: 8, offset: 24)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1029, file: !16, line: 80, baseType: !940, size: 64, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1029, file: !16, line: 81, baseType: !1038, size: 128, offset: 96)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, elements: !667)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1029, file: !16, line: 82, baseType: !39, size: 32, offset: 224)
!1040 = !DILocalVariable(name: "partition_usage", scope: !1009, file: !48, line: 151, type: !81)
!1041 = !DILocalVariable(name: "err", scope: !1009, file: !48, line: 152, type: !936)
!1042 = !DILocalVariable(name: "num_partitions", scope: !1009, file: !48, line: 153, type: !36)
!1043 = !DILocalVariable(name: "i", scope: !1044, file: !48, line: 171, type: !36)
!1044 = distinct !DILexicalBlock(scope: !1009, file: !48, line: 171, column: 5)
!1045 = !DILocalVariable(name: "partition", scope: !1046, file: !48, line: 172, type: !1026)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !48, line: 171, column: 46)
!1047 = distinct !DILexicalBlock(scope: !1044, file: !48, line: 171, column: 5)
!1048 = !DILocation(line: 0, scope: !1009)
!1049 = !DILocation(line: 153, column: 5, scope: !1009)
!1050 = !DILocation(line: 155, column: 18, scope: !1009)
!1051 = !DILocation(line: 156, column: 10, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1009, file: !48, line: 156, column: 9)
!1053 = !DILocation(line: 156, column: 9, scope: !1009)
!1054 = !DILocation(line: 157, column: 9, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !48, line: 157, column: 9)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !48, line: 157, column: 9)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !48, line: 157, column: 9)
!1058 = distinct !DILexicalBlock(scope: !1052, file: !48, line: 156, column: 22)
!1059 = !DILocation(line: 158, column: 9, scope: !1058)
!1060 = !DILocation(line: 162, column: 11, scope: !1009)
!1061 = !DILocation(line: 163, column: 13, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1009, file: !48, line: 163, column: 9)
!1063 = !DILocation(line: 163, column: 9, scope: !1009)
!1064 = !DILocation(line: 164, column: 9, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !48, line: 164, column: 9)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !48, line: 164, column: 9)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !48, line: 164, column: 9)
!1068 = distinct !DILexicalBlock(scope: !1062, file: !48, line: 163, column: 24)
!1069 = !DILocation(line: 165, column: 9, scope: !1068)
!1070 = !DILocation(line: 168, column: 5, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !48, line: 168, column: 5)
!1072 = distinct !DILexicalBlock(scope: !1073, file: !48, line: 168, column: 5)
!1073 = distinct !DILexicalBlock(scope: !1009, file: !48, line: 168, column: 5)
!1074 = !DILocation(line: 169, column: 5, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !48, line: 169, column: 5)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !48, line: 169, column: 5)
!1077 = distinct !DILexicalBlock(scope: !1009, file: !48, line: 169, column: 5)
!1078 = !DILocation(line: 0, scope: !1044)
!1079 = !DILocation(line: 171, column: 25, scope: !1047)
!1080 = !DILocation(line: 171, column: 23, scope: !1047)
!1081 = !DILocation(line: 171, column: 5, scope: !1044)
!1082 = !DILocation(line: 237, column: 5, scope: !1009)
!1083 = !DILocation(line: 239, column: 5, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !48, line: 239, column: 5)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !48, line: 239, column: 5)
!1086 = distinct !DILexicalBlock(scope: !1009, file: !48, line: 239, column: 5)
!1087 = !DILocation(line: 240, column: 5, scope: !1009)
!1088 = !DILocation(line: 0, scope: !1046)
!1089 = !DILocation(line: 178, column: 28, scope: !1046)
!1090 = !{!1091, !589, i64 2}
!1091 = !{!"", !1092, i64 0, !589, i64 2, !589, i64 3, !979, i64 4, !589, i64 12, !588, i64 28}
!1092 = !{!"short", !589, i64 0}
!1093 = !DILocation(line: 178, column: 9, scope: !1046)
!1094 = !DILocation(line: 180, column: 32, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1046, file: !48, line: 178, column: 34)
!1096 = !{!1091, !589, i64 3}
!1097 = !DILocation(line: 180, column: 21, scope: !1095)
!1098 = !DILocation(line: 180, column: 13, scope: !1095)
!1099 = !DILocation(line: 182, column: 42, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1095, file: !48, line: 180, column: 41)
!1101 = !DILocation(line: 184, column: 17, scope: !1100)
!1102 = !DILocation(line: 186, column: 39, scope: !1100)
!1103 = !DILocation(line: 188, column: 17, scope: !1100)
!1104 = !DILocation(line: 191, column: 41, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1100, file: !48, line: 191, column: 21)
!1106 = !DILocation(line: 191, column: 67, scope: !1105)
!1107 = !DILocation(line: 191, column: 21, scope: !1100)
!1108 = !DILocation(line: 192, column: 48, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !48, line: 191, column: 93)
!1110 = !DILocation(line: 192, column: 21, scope: !1109)
!1111 = !DILocation(line: 192, column: 86, scope: !1109)
!1112 = !DILocation(line: 193, column: 21, scope: !1109)
!1113 = !{!1114, !588, i64 152}
!1114 = !{!"", !979, i64 0, !979, i64 8, !979, i64 16, !589, i64 24, !588, i64 152, !588, i64 156}
!1115 = !DILocation(line: 195, column: 17, scope: !1109)
!1116 = !DILocation(line: 202, column: 32, scope: !1095)
!1117 = !DILocation(line: 202, column: 13, scope: !1095)
!1118 = !DILocation(line: 204, column: 43, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1095, file: !48, line: 202, column: 41)
!1120 = !DILocation(line: 206, column: 17, scope: !1119)
!1121 = !DILocation(line: 212, column: 17, scope: !1119)
!1122 = !DILocation(line: 215, column: 17, scope: !1119)
!1123 = !DILocation(line: 221, column: 17, scope: !1119)
!1124 = !DILocation(line: 224, column: 17, scope: !1119)
!1125 = !DILocation(line: 232, column: 9, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !48, line: 232, column: 9)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !48, line: 232, column: 9)
!1128 = distinct !DILexicalBlock(scope: !1046, file: !48, line: 232, column: 9)
!1129 = !{!1091, !588, i64 4}
!1130 = !{!1091, !588, i64 8}
!1131 = !DILocation(line: 171, column: 42, scope: !1047)
!1132 = distinct !{!1132, !1081, !1133, !1134}
!1133 = !DILocation(line: 235, column: 5, scope: !1044)
!1134 = !{!"llvm.loop.mustprogress"}
!1135 = !DILocation(line: 241, column: 1, scope: !1009)
!1136 = distinct !DISubprogram(name: "bootloader_utility_get_selected_boot_partition", scope: !48, file: !48, line: 347, type: !1137, scopeLine: 348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1141)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!36, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 32)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1141 = !{!1142, !1143, !1153, !1154, !1157}
!1142 = !DILocalVariable(name: "bs", arg: 1, scope: !1136, file: !48, line: 347, type: !1139)
!1143 = !DILocalVariable(name: "otadata", scope: !1136, file: !48, line: 349, type: !1144)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1145, size: 512, elements: !143)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_ota_select_entry_t", file: !16, line: 65, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 60, size: 256, elements: !1147)
!1147 = !{!1148, !1149, !1151, !1152}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ota_seq", scope: !1146, file: !16, line: 61, baseType: !39, size: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "seq_label", scope: !1146, file: !16, line: 62, baseType: !1150, size: 160, offset: 32)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !964)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ota_state", scope: !1146, file: !16, line: 63, baseType: !39, size: 32, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !1146, file: !16, line: 64, baseType: !39, size: 32, offset: 224)
!1153 = !DILocalVariable(name: "boot_index", scope: !1136, file: !48, line: 350, type: !36)
!1154 = !DILocalVariable(name: "active_otadata", scope: !1155, file: !48, line: 395, type: !36)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !48, line: 394, column: 12)
!1156 = distinct !DILexicalBlock(scope: !1136, file: !48, line: 376, column: 9)
!1157 = !DILocalVariable(name: "ota_seq", scope: !1158, file: !48, line: 411, type: !39)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !48, line: 409, column: 35)
!1159 = distinct !DILexicalBlock(scope: !1155, file: !48, line: 409, column: 13)
!1160 = !DILocation(line: 0, scope: !1136)
!1161 = !DILocation(line: 349, column: 5, scope: !1136)
!1162 = !DILocation(line: 349, column: 28, scope: !1136)
!1163 = !DILocation(line: 352, column: 22, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1136, file: !48, line: 352, column: 9)
!1165 = !{!1114, !588, i64 0}
!1166 = !DILocation(line: 352, column: 29, scope: !1164)
!1167 = !DILocation(line: 352, column: 9, scope: !1136)
!1168 = !DILocation(line: 356, column: 9, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1136, file: !48, line: 356, column: 9)
!1170 = !DILocalVariable(name: "ota_info", arg: 1, scope: !1171, file: !48, line: 96, type: !938)
!1171 = distinct !DISubprogram(name: "read_otadata", scope: !48, file: !48, line: 96, type: !1172, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1175)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!936, !938, !1174}
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 32)
!1175 = !{!1170, !1176, !1177}
!1176 = !DILocalVariable(name: "two_otadata", arg: 2, scope: !1171, file: !48, line: 96, type: !1174)
!1177 = !DILocalVariable(name: "ota_select_map", scope: !1171, file: !48, line: 98, type: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 32)
!1179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1145)
!1180 = !DILocation(line: 0, scope: !1171, inlinedAt: !1181)
!1181 = distinct !DILocation(line: 356, column: 9, scope: !1169)
!1182 = !DILocation(line: 99, column: 19, scope: !1183, inlinedAt: !1181)
!1183 = distinct !DILexicalBlock(scope: !1171, file: !48, line: 99, column: 9)
!1184 = !DILocation(line: 99, column: 26, scope: !1183, inlinedAt: !1181)
!1185 = !DILocation(line: 99, column: 9, scope: !1171, inlinedAt: !1181)
!1186 = !DILocation(line: 104, column: 19, scope: !1187, inlinedAt: !1181)
!1187 = distinct !DILexicalBlock(scope: !1171, file: !48, line: 104, column: 9)
!1188 = !{!979, !588, i64 4}
!1189 = !DILocation(line: 104, column: 24, scope: !1187, inlinedAt: !1181)
!1190 = !DILocation(line: 104, column: 9, scope: !1171, inlinedAt: !1181)
!1191 = !DILocation(line: 105, column: 9, scope: !1192, inlinedAt: !1181)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !48, line: 105, column: 9)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !48, line: 105, column: 9)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !48, line: 105, column: 9)
!1195 = distinct !DILexicalBlock(scope: !1187, file: !48, line: 104, column: 44)
