; ModuleID = 'build//custom_bootloader/bootloader_hooks/bootloader/bootloader.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-i8:8:32-i16:16:32-i64:64-n32"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (i32)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque
%struct._mprec = type { %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint** }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%struct._rand48 = type { [3 x i16], [3 x i16], i16, i64 }
%struct.__tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._atexit = type { %struct._atexit*, i32, [32 x void ()*], %struct._on_exit_args* }
%struct._on_exit_args = type { [32 x i8*], [32 x i8*], i32, i32 }
%struct._glue = type { %struct._glue*, i32, %struct.__sFILE* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, %struct._reent*, i8*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32, i32, i32)*, i32 (i32, i32)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i32, %struct.__lock*, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct.__lock = type { [23 x i32] }
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!173 = !DILocalVariable(name: "digest_words", scope: !163, file: !155, line: 110, type: !133)
!174 = !DILocalVariable(name: "sha_text_reg", scope: !163, file: !155, line: 111, type: !133)
!175 = !DILocalVariable(name: "i", scope: !176, file: !155, line: 112, type: !157)
!176 = distinct !DILexicalBlock(scope: !163, file: !155, line: 112, column: 5)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 512, elements: !179)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!179 = !{!180}
!180 = !DISubrange(count: 64)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!182 = distinct !DIGlobalVariable(name: "DIGEST_WORDS", scope: !147, file: !155, line: 21, type: !156, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!184 = distinct !DIGlobalVariable(name: "mapped", scope: !185, file: !199, line: 152, type: !84, isLocal: true, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !187, retainedTypes: !194, globals: !195, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!187 = !{!188}
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 43, baseType: !17, size: 32, elements: !190)
!189 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_spiflash.h", directory: "/home/mjshen/RTOSExploration/esp")
!190 = !{!191, !192, !193}
!191 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_OK", value: 0)
!192 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_ERR", value: 1)
!193 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_RESULT_TIMEOUT", value: 2)
!194 = !{!35, !134, !133}
!195 = !{!196, !197, !200}
!196 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "TAG", scope: !185, file: !199, line: 124, type: !81, isLocal: true, isDefinition: true)
!199 = !DIFile(filename: "esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash.c", directory: "/home/mjshen/RTOSExploration/esp")
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "current_read_mapping", scope: !185, file: !199, line: 155, type: !39, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "bootloader_image_hdr", scope: !204, file: !233, line: 25, type: !234, isLocal: false, isDefinition: true, align: 32)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !226, globals: !230, splitDebugInlining: false, nameTableKind: None)
!205 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!206 = !{!127, !5, !207, !213, !219}
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 21, baseType: !17, size: 32, elements: !209)
!208 = !DIFile(filename: "esp-idf/components/hal/include/hal/wdt_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!209 = !{!210, !211, !212}
!210 = !DIEnumerator(name: "WDT_RWDT", value: 0)
!211 = !DIEnumerator(name: "WDT_MWDT0", value: 1)
!212 = !DIEnumerator(name: "WDT_MWDT1", value: 2)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 30, baseType: !17, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218}
!215 = !DIEnumerator(name: "WDT_STAGE0", value: 0)
!216 = !DIEnumerator(name: "WDT_STAGE1", value: 1)
!217 = !DIEnumerator(name: "WDT_STAGE2", value: 2)
!218 = !DIEnumerator(name: "WDT_STAGE3", value: 3)
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 43, baseType: !17, size: 32, elements: !220)
!220 = !{!221, !222, !223, !224, !225}
!221 = !DIEnumerator(name: "WDT_STAGE_ACTION_OFF", value: 0)
!222 = !DIEnumerator(name: "WDT_STAGE_ACTION_INT", value: 1)
!223 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_CPU", value: 2)
!224 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_SYSTEM", value: 3)
!225 = !DIEnumerator(name: "WDT_STAGE_ACTION_RESET_RTC", value: 4)
!226 = !{!39, !227}
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !40, line: 60, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !42, line: 105, baseType: !229)
!229 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!230 = !{!202, !231}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "TAG", scope: !204, file: !233, line: 23, type: !81, isLocal: true, isDefinition: true)
!233 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_image_header_t", file: !6, line: 93, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 74, size: 192, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !248, !250, !251, !255}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !235, file: !6, line: 75, baseType: !44, size: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !235, file: !6, line: 76, baseType: !44, size: 8, offset: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "spi_mode", scope: !235, file: !6, line: 77, baseType: !44, size: 8, offset: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "spi_speed", scope: !235, file: !6, line: 78, baseType: !44, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 24)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "spi_size", scope: !235, file: !6, line: 79, baseType: !44, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 24)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "entry_addr", scope: !235, file: !6, line: 80, baseType: !39, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "wp_pin", scope: !235, file: !6, line: 81, baseType: !44, size: 8, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "spi_pin_drv", scope: !235, file: !6, line: 84, baseType: !245, size: 24, offset: 72)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 3)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "chip_id", scope: !235, file: !6, line: 85, baseType: !249, size: 16, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_chip_id_t", file: !6, line: 26, baseType: !5)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "min_chip_rev", scope: !235, file: !6, line: 86, baseType: !44, size: 8, offset: 112)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !235, file: !6, line: 87, baseType: !252, size: 64, offset: 120)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "hash_appended", scope: !235, file: !6, line: 88, baseType: !44, size: 8, offset: 184)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "intr_desc_table", scope: !258, file: !282, line: 164, type: !283, isLocal: true, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !260, retainedTypes: !279, globals: !281, splitDebugInlining: false, nameTableKind: None)
!259 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!260 = !{!261, !267, !274}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 37, baseType: !17, size: 32, elements: !263)
!262 = !DIFile(filename: "esp-idf/components/esp_hw_support/include/esp_cpu.h", directory: "/home/mjshen/RTOSExploration/esp")
!263 = !{!264, !265, !266}
!264 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_LEVEL", value: 0)
!265 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_EDGE", value: 1)
!266 = !DIEnumerator(name: "ESP_CPU_INTR_TYPE_NA", value: 2)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !268, line: 23, baseType: !17, size: 32, elements: !269)
!268 = !DIFile(filename: "esp-idf/components/hal/include/hal/mpu_types.h", directory: "/home/mjshen/RTOSExploration/esp")
!269 = !{!270, !271, !272, !273}
!270 = !DIEnumerator(name: "MPU_REGION_ILLEGAL", value: 0)
!271 = !DIEnumerator(name: "MPU_REGION_RW", value: 1)
!272 = !DIEnumerator(name: "MPU_REGION_X", value: 2)
!273 = !DIEnumerator(name: "MPU_REGION_RWX", value: 3)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 70, baseType: !17, size: 32, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_LOAD", value: 0)
!277 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_STORE", value: 1)
!278 = !DIEnumerator(name: "ESP_CPU_WATCHPOINT_ACCESS", value: 2)
!279 = !{!39, !37, !280}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !42, line: 184, baseType: !17)
!281 = !{!256}
!282 = !DIFile(filename: "esp-idf/components/esp_hw_support/cpu.c", directory: "/home/mjshen/RTOSExploration/esp")
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 4096, elements: !292)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "intr_desc_t", file: !282, line: 160, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !282, line: 156, size: 128, elements: !287)
!287 = !{!288, !289, !291}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !286, file: !282, line: 157, baseType: !36, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !282, line: 158, baseType: !290, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_intr_type_t", file: !262, line: 41, baseType: !261)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !286, file: !282, line: 159, baseType: !142, size: 64, offset: 64)
!292 = !{!293}
!293 = !DISubrange(count: 32)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "s_cur_pll_freq", scope: !296, file: !340, line: 35, type: !280, isLocal: true, isDefinition: true)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !332, globals: !337, splitDebugInlining: false, nameTableKind: None)
!297 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!298 = !{!299, !305, !313, !320, !326}
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !300, line: 77, baseType: !17, size: 32, elements: !301)
!300 = !DIFile(filename: "esp-idf/components/hal/esp32/include/hal/clk_tree_ll.h", directory: "/home/mjshen/RTOSExploration/esp")
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_CRYSTAL", value: 0)
!303 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_EXTERNAL", value: 1)
!304 = !DIEnumerator(name: "CLK_LL_XTAL32K_ENABLE_MODE_BOOTSTRAP", value: 2)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 64, baseType: !17, size: 32, elements: !307)
!306 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/clk_tree_defs.h", directory: "/home/mjshen/RTOSExploration/esp")
!307 = !{!308, !309, !310, !311, !312}
!308 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_XTAL", value: 0)
!309 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_PLL", value: 1)
!310 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_RC_FAST", value: 2)
!311 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_APLL", value: 3)
!312 = !DIEnumerator(name: "SOC_CPU_CLK_SRC_INVALID", value: 4)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 82, baseType: !17, size: 32, elements: !315)
!314 = !DIFile(filename: "esp-idf/components/soc/esp32/include/soc/rtc.h", directory: "/home/mjshen/RTOSExploration/esp")
!315 = !{!316, !317, !318, !319}
!316 = !DIEnumerator(name: "RTC_XTAL_FREQ_AUTO", value: 0)
!317 = !DIEnumerator(name: "RTC_XTAL_FREQ_40M", value: 40)
!318 = !DIEnumerator(name: "RTC_XTAL_FREQ_26M", value: 26)
!319 = !DIEnumerator(name: "RTC_XTAL_FREQ_24M", value: 24)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 76, baseType: !17, size: 32, elements: !321)
!321 = !{!322, !323, !324, !325}
!322 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_SLOW", value: 0)
!323 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_XTAL32K", value: 1)
!324 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_RC_FAST_D256", value: 2)
!325 = !DIEnumerator(name: "SOC_RTC_SLOW_CLK_SRC_INVALID", value: 3)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 87, baseType: !17, size: 32, elements: !327)
!327 = !{!328, !329, !330, !331}
!328 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_D4", value: 0)
!329 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_XTAL_DIV", value: 0)
!330 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_RC_FAST", value: 1)
!331 = !DIEnumerator(name: "SOC_RTC_FAST_CLK_SRC_INVALID", value: 2)
!332 = !{!280, !333, !36, !335, !336}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !280)
!335 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtc_xtal_freq_t", file: !314, line: 87, baseType: !313)
!337 = !{!294, !338}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "TAG", scope: !296, file: !340, line: 37, type: !81, isLocal: true, isDefinition: true)
!340 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk.c", directory: "/home/mjshen/RTOSExploration/esp")
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!342 = distinct !DIGlobalVariable(name: "s_lock", scope: !343, file: !349, line: 12, type: !36, isLocal: true, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !345, globals: !347, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_cpu_cycle_count_t", file: !262, line: 32, baseType: !39)
!347 = !{!348}
!348 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!349 = !DIFile(filename: "esp-idf/components/log/log_noos.c", directory: "/home/mjshen/RTOSExploration/esp")
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !352, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/soc/esp32/./dport_access.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!352 = !{!73}
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !355, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!355 = !{!134, !84}
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !358, globals: !359, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader/subproject/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!358 = !{!108}
!359 = !{!360}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "TAG", scope: !356, file: !362, line: 14, type: !81, isLocal: true, isDefinition: true)
!362 = !DIFile(filename: "esp-idf/components/bootloader/subproject/main/bootloader_start.c", directory: "/home/mjshen/RTOSExploration/esp")
!363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !364, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!364 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/examples/custom_bootloader/bootloader_hooks/bootloader_components/my_boot_hooks/hooks.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !367, retainedTypes: !388, globals: !389, splitDebugInlining: false, nameTableKind: None)
!366 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!367 = !{!368, !382}
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 19, baseType: !17, size: 32, elements: !370)
!369 = !DIFile(filename: "esp-idf/components/efuse/esp32/include/esp_efuse_chip.h", directory: "/home/mjshen/RTOSExploration/esp")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!371 = !DIEnumerator(name: "EFUSE_BLK0", value: 0)
!372 = !DIEnumerator(name: "EFUSE_BLK1", value: 1)
!373 = !DIEnumerator(name: "EFUSE_BLK_KEY0", value: 1)
!374 = !DIEnumerator(name: "EFUSE_BLK_ENCRYPT_FLASH", value: 1)
!375 = !DIEnumerator(name: "EFUSE_BLK2", value: 2)
!376 = !DIEnumerator(name: "EFUSE_BLK_KEY1", value: 2)
!377 = !DIEnumerator(name: "EFUSE_BLK_SECURE_BOOT", value: 2)
!378 = !DIEnumerator(name: "EFUSE_BLK3", value: 3)
!379 = !DIEnumerator(name: "EFUSE_BLK_KEY2", value: 3)
!380 = !DIEnumerator(name: "EFUSE_BLK_KEY_MAX", value: 4)
!381 = !DIEnumerator(name: "EFUSE_BLK_MAX", value: 4)
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !383, line: 23, baseType: !17, size: 32, elements: !384)
!383 = !DIFile(filename: "esp-idf/components/bootloader_support/include/esp_flash_encrypt.h", directory: "/home/mjshen/RTOSExploration/esp")
!384 = !{!385, !386, !387}
!385 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DISABLED", value: 0)
!386 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_DEVELOPMENT", value: 1)
!387 = !DIEnumerator(name: "ESP_FLASH_ENC_MODE_RELEASE", value: 2)
!388 = !{!37}
!389 = !{!390}
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "TAG", scope: !365, file: !392, line: 23, type: !81, isLocal: true, isDefinition: true)
!392 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_encrypt.c", directory: "/home/mjshen/RTOSExploration/esp")
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !395, globals: !397, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!397 = !{!398}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "TAG", scope: !393, file: !400, line: 12, type: !81, isLocal: true, isDefinition: true)
!400 = !DIFile(filename: "esp-idf/components/bootloader_support/src/flash_partitions.c", directory: "/home/mjshen/RTOSExploration/esp")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_soc.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !407, retainedTypes: !408, globals: !409, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!407 = !{!5, !188, !108}
!408 = !{!39, !37}
!409 = !{!410}
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "TAG", scope: !405, file: !412, line: 40, type: !81, isLocal: true, isDefinition: true)
!412 = !DIFile(filename: "esp-idf/components/bootloader_support/src/esp32/bootloader_esp32.c", directory: "/home/mjshen/RTOSExploration/esp")
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !415, retainedTypes: !421, globals: !423, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!415 = !{!416, !5}
!416 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 16, baseType: !36, size: 32, elements: !417)
!417 = !{!418, !419, !420}
!418 = !DIEnumerator(name: "GPIO_LONG_HOLD", value: 1)
!419 = !DIEnumerator(name: "GPIO_SHORT_HOLD", value: -1)
!420 = !DIEnumerator(name: "GPIO_NOT_HOLD", value: 0)
!421 = !{!39, !37, !35, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!423 = !{!424}
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "TAG", scope: !413, file: !426, line: 30, type: !81, isLocal: true, isDefinition: true)
!426 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common.c", directory: "/home/mjshen/RTOSExploration/esp")
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !429, retainedTypes: !430, globals: !431, splitDebugInlining: false, nameTableKind: None)
!428 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!429 = !{!15, !5, !127}
!430 = !{!43, !35}
!431 = !{!432}
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "TAG", scope: !427, file: !434, line: 29, type: !81, isLocal: true, isDefinition: true)
!434 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_common_loader.c", directory: "/home/mjshen/RTOSExploration/esp")
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !438, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_clock_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!437 = !{!108, !313, !326, !320}
!438 = !{!333}
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!440 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_mem.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!441 = distinct !DICompileUnit(language: DW_LANG_C99, file: !442, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !443, splitDebugInlining: false, nameTableKind: None)
!442 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!443 = !{!43, !35, !37, !346}
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !446, splitDebugInlining: false, nameTableKind: None)
!445 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_random_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!446 = !{!280, !333}
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !449, retainedTypes: !408, splitDebugInlining: false, nameTableKind: None)
!448 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/bootloader_flash/src/bootloader_flash_config_esp32.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!449 = !{!5, !188, !450}
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 47, baseType: !17, size: 32, elements: !451)
!451 = !{!452, !453, !454, !455}
!452 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_2", value: 0)
!453 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_3", value: 1)
!454 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_4", value: 2)
!455 = !DIEnumerator(name: "ESP_IMAGE_SPI_SPEED_DIV_1", value: 15)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !388, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_efuse.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/bootloader_support/src/bootloader_console.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !462, retainedTypes: !468, globals: !469, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!462 = !{!313, !326, !320, !305, !463}
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 102, baseType: !17, size: 32, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIEnumerator(name: "RTC_CAL_RTC_MUX", value: 0)
!466 = !DIEnumerator(name: "RTC_CAL_8MD256", value: 1)
!467 = !DIEnumerator(name: "RTC_CAL_32K_XTAL", value: 2)
!468 = !{!37, !227, !39, !346}
!469 = !{!470}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "TAG", scope: !460, file: !472, line: 31, type: !81, isLocal: true, isDefinition: true)
!472 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_clk_init.c", directory: "/home/mjshen/RTOSExploration/esp")
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !446, splitDebugInlining: false, nameTableKind: None)
!474 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_init.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !477, retainedTypes: !478, globals: !480, splitDebugInlining: false, nameTableKind: None)
!476 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_hw_support/port/esp32/./rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!477 = !{!463, !313, !320}
!478 = !{!280, !479, !333}
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !42, line: 202, baseType: !229)
!480 = !{!481}
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "TAG", scope: !475, file: !483, line: 14, type: !81, isLocal: true, isDefinition: true)
!483 = !DIFile(filename: "esp-idf/components/esp_hw_support/port/esp32/rtc_time.c", directory: "/home/mjshen/RTOSExploration/esp")
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!485 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_sys.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!487 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_uart.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !490, retainedTypes: !505, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/esp_rom/patches/esp_rom_spiflash.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!490 = !{!188, !491}
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 19, baseType: !17, size: 32, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!493 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QIO_MODE", value: 0)
!494 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QOUT_MODE", value: 1)
!495 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DIO_MODE", value: 2)
!496 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_DOUT_MODE", value: 3)
!497 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_FASTRD_MODE", value: 4)
!498 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_SLOWRD_MODE", value: 5)
!499 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_STR_MODE", value: 6)
!500 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OPI_DTR_MODE", value: 7)
!501 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OOUT_MODE", value: 8)
!502 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_STR_MODE", value: 9)
!503 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_OIO_DTR_MODE", value: 10)
!504 = !DIEnumerator(name: "ESP_ROM_SPIFLASH_QPI_MODE", value: 11)
!505 = !{!333, !280, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !509, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mpu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!509 = !{!267}
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !512, splitDebugInlining: false, nameTableKind: None)
!511 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!512 = !{!513, !514, !515, !73}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !76, line: 207, baseType: !7)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !352, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/esp32/efuse_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !408, splitDebugInlining: false, nameTableKind: None)
!519 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/mmu_hal.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !522, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "/home/mjshen/RTOSExploration/esp/esp-idf/components/hal/wdt_hal_iram.c", directory: "/home/mjshen/RTOSExploration/esp/esp-build/build/custom_bootloader/bootloader_hooks/bootloader")
!522 = !{!207, !213, !523, !219}
!523 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 57, baseType: !17, size: 32, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532}
!525 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_100ns", value: 0)
!526 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_200ns", value: 1)
!527 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_300ns", value: 2)
!528 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_400ns", value: 3)
!529 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_500ns", value: 4)
!530 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_800ns", value: 5)
!531 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_1_6us", value: 6)
!532 = !DIEnumerator(name: "WDT_RESET_SIG_LENGTH_3_2us", value: 7)
!533 = !{!"clang version 14.0.0 (https://github.com/espressif/llvm-project.git 38679f0333ca1fd10fb78a3e8a2e90b2b64f9097)"}
!534 = !{i32 7, !"Dwarf Version", i32 4}
!535 = !{i32 2, !"Debug Info Version", i32 3}
!536 = !{i32 1, !"wchar_size", i32 1}
!537 = distinct !DISubprogram(name: "esp_dport_access_reg_read", scope: !538, file: !538, line: 13, type: !539, scopeLine: 14, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !541)
!538 = !DIFile(filename: "esp-idf/components/soc/esp32/dport_access.c", directory: "/home/mjshen/RTOSExploration/esp")
!539 = !DISubroutineType(types: !540)
!540 = !{!75, !75}
!541 = !{!542}
!542 = !DILocalVariable(name: "reg", arg: 1, scope: !537, file: !538, line: 13, type: !75)
!543 = !DILocation(line: 0, scope: !537)
!544 = !DILocation(line: 16, column: 12, scope: !537)
!545 = !{!546, !546, i64 0}
!546 = !{!"int", !547, i64 0}
!547 = !{!"omnipotent char", !548, i64 0}
!548 = !{!"Simple C/C++ TBAA"}
!549 = !DILocation(line: 16, column: 5, scope: !537)
!550 = distinct !DISubprogram(name: "esp_dport_access_sequence_reg_read", scope: !538, file: !538, line: 35, type: !539, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !551)
!551 = !{!552}
!552 = !DILocalVariable(name: "reg", arg: 1, scope: !550, file: !538, line: 35, type: !75)
!553 = !DILocation(line: 0, scope: !550)
!554 = !DILocation(line: 38, column: 12, scope: !550)
!555 = !DILocation(line: 38, column: 5, scope: !550)
!556 = distinct !DISubprogram(name: "__assert_func", scope: !557, file: !557, line: 13, type: !558, scopeLine: 14, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !560)
!557 = !DIFile(filename: "esp-idf/components/bootloader_support/src/bootloader_panic.c", directory: "/home/mjshen/RTOSExploration/esp")
!558 = !DISubroutineType(types: !559)
!559 = !{null, !81, !36, !81, !81}
!560 = !{!561, !562, !563, !564}
!561 = !DILocalVariable(name: "file", arg: 1, scope: !556, file: !557, line: 13, type: !81)
!562 = !DILocalVariable(name: "line", arg: 2, scope: !556, file: !557, line: 13, type: !36)
!563 = !DILocalVariable(name: "func", arg: 3, scope: !556, file: !557, line: 13, type: !81)
!564 = !DILocalVariable(name: "expr", arg: 4, scope: !556, file: !557, line: 13, type: !81)
!565 = !DILocation(line: 0, scope: !556)
!566 = !DILocation(line: 17, column: 5, scope: !556)
!567 = !DILocation(line: 20, column: 5, scope: !556)
!568 = distinct !{!568, !567, !569}
!569 = !DILocation(line: 21, column: 5, scope: !556)
!570 = !DISubprogram(name: "esp_rom_printf", scope: !571, file: !571, line: 24, type: !572, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !574)
!571 = !DIFile(filename: "esp-idf/components/esp_rom/include/esp_rom_sys.h", directory: "/home/mjshen/RTOSExploration/esp")
!572 = !DISubroutineType(types: !573)
!573 = !{!36, !81, null}
!574 = !{}
!575 = distinct !DISubprogram(name: "abort", scope: !557, file: !557, line: 24, type: !71, scopeLine: 25, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !574)
!576 = !DILocation(line: 27, column: 69, scope: !575)
!577 = !DILocation(line: 27, column: 59, scope: !575)
!578 = !DILocation(line: 27, column: 97, scope: !575)
!579 = !DILocation(line: 27, column: 5, scope: !575)
!580 = !DILocalVariable(name: "dcr", scope: !581, file: !582, line: 189, type: !280)
!581 = distinct !DISubprogram(name: "xt_utils_dbgr_is_attached", scope: !582, file: !582, line: 187, type: !583, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !585)
!582 = !DIFile(filename: "esp-idf/components/xtensa/include/xt_utils.h", directory: "/home/mjshen/RTOSExploration/esp")
!583 = !DISubroutineType(types: !584)
!584 = !{!84}
!585 = !{!580, !586}
!586 = !DILocalVariable(name: "reg", scope: !581, file: !582, line: 190, type: !280)
!587 = !DILocation(line: 0, scope: !581, inlinedAt: !588)
!588 = distinct !DILocation(line: 497, column: 12, scope: !589, inlinedAt: !590)
!589 = distinct !DISubprogram(name: "esp_cpu_dbgr_is_attached", scope: !262, file: !262, line: 494, type: !583, scopeLine: 495, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !574)
!590 = distinct !DILocation(line: 29, column: 9, scope: !591)
!591 = distinct !DILexicalBlock(scope: !575, file: !557, line: 29, column: 9)
!592 = !DILocation(line: 191, column: 5, scope: !581, inlinedAt: !588)
!593 = !{i64 2148037441}
!594 = !DILocation(line: 192, column: 23, scope: !581, inlinedAt: !588)
!595 = !DILocation(line: 192, column: 12, scope: !581, inlinedAt: !588)
!596 = !DILocation(line: 29, column: 9, scope: !575)
!597 = !DILocation(line: 197, column: 5, scope: !598, inlinedAt: !599)
!598 = distinct !DISubprogram(name: "xt_utils_dbgr_break", scope: !582, file: !582, line: 195, type: !71, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !574)
!599 = distinct !DILocation(line: 509, column: 5, scope: !600, inlinedAt: !601)
!600 = distinct !DISubprogram(name: "esp_cpu_dbgr_break", scope: !262, file: !262, line: 506, type: !71, scopeLine: 507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !574)
!601 = distinct !DILocation(line: 30, column: 9, scope: !602)
!602 = distinct !DILexicalBlock(scope: !591, file: !557, line: 29, column: 37)
!603 = !{i64 513294}
!604 = !DILocation(line: 31, column: 5, scope: !602)
!605 = !DILocation(line: 32, column: 5, scope: !575)
!606 = distinct !{!606, !605, !607}
!607 = !DILocation(line: 33, column: 5, scope: !575)
!608 = distinct !DISubprogram(name: "call_start_cpu0", scope: !362, file: !362, line: 24, type: !71, scopeLine: 25, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !609)
!609 = !{!610, !629}
!610 = !DILocalVariable(name: "bs", scope: !608, file: !362, line: 50, type: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !612, line: 32, baseType: !613)
!612 = !DIFile(filename: "esp-idf/components/bootloader_support/private_include/bootloader_config.h", directory: "/home/mjshen/RTOSExploration/esp")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !612, line: 25, size: 1280, elements: !614)
!614 = !{!615, !621, !622, !623, !627, !628}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !613, file: !612, line: 26, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !16, line: 71, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 68, size: 64, elements: !618)
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !617, file: !16, line: 69, baseType: !39, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !617, file: !16, line: 70, baseType: !39, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !613, file: !612, line: 27, baseType: !616, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !613, file: !612, line: 28, baseType: !616, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !613, file: !612, line: 29, baseType: !624, size: 1024, offset: 192)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 1024, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 16)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !613, file: !612, line: 30, baseType: !39, size: 32, offset: 1216)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !613, file: !612, line: 31, baseType: !39, size: 32, offset: 1248)
!629 = !DILocalVariable(name: "boot_index", scope: !608, file: !362, line: 51, type: !36)
!630 = !DILocation(line: 27, column: 9, scope: !608)
!631 = !DILocation(line: 28, column: 9, scope: !632)
!632 = distinct !DILexicalBlock(scope: !633, file: !362, line: 27, column: 33)
!633 = distinct !DILexicalBlock(scope: !608, file: !362, line: 27, column: 9)
!634 = !DILocation(line: 29, column: 5, scope: !632)
!635 = !DILocation(line: 32, column: 9, scope: !636)
!636 = distinct !DILexicalBlock(scope: !608, file: !362, line: 32, column: 9)
!637 = !DILocation(line: 32, column: 27, scope: !636)
!638 = !DILocation(line: 32, column: 9, scope: !608)
!639 = !DILocation(line: 33, column: 9, scope: !640)
!640 = distinct !DILexicalBlock(scope: !636, file: !362, line: 32, column: 38)
!641 = !DILocation(line: 37, column: 9, scope: !608)
!642 = !DILocation(line: 38, column: 9, scope: !643)
!643 = distinct !DILexicalBlock(scope: !644, file: !362, line: 37, column: 32)
!644 = distinct !DILexicalBlock(scope: !608, file: !362, line: 37, column: 9)
!645 = !DILocation(line: 39, column: 5, scope: !643)
!646 = !DILocation(line: 50, column: 5, scope: !608)
!647 = !DILocation(line: 50, column: 24, scope: !608)
!648 = !DILocation(line: 51, column: 22, scope: !608)
!649 = !DILocalVariable(name: "bs", arg: 1, scope: !650, file: !362, line: 61, type: !653)
!650 = distinct !DISubprogram(name: "select_partition_number", scope: !362, file: !362, line: 61, type: !651, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !654)
!651 = !DISubroutineType(types: !652)
!652 = !{!36, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!654 = !{!649}
!655 = !DILocation(line: 0, scope: !650, inlinedAt: !656)
!656 = distinct !DILocation(line: 51, column: 22, scope: !608)
!657 = !DILocation(line: 64, column: 10, scope: !658, inlinedAt: !656)
!658 = distinct !DILexicalBlock(scope: !650, file: !362, line: 64, column: 9)
!659 = !DILocation(line: 64, column: 9, scope: !650, inlinedAt: !656)
!660 = !DILocation(line: 65, column: 9, scope: !661, inlinedAt: !656)
!661 = distinct !DILexicalBlock(scope: !662, file: !362, line: 65, column: 9)
!662 = distinct !DILexicalBlock(scope: !663, file: !362, line: 65, column: 9)
!663 = distinct !DILexicalBlock(scope: !664, file: !362, line: 65, column: 9)
!664 = distinct !DILexicalBlock(scope: !658, file: !362, line: 64, column: 55)
!665 = !DILocation(line: 66, column: 9, scope: !664, inlinedAt: !656)
!666 = !DILocalVariable(name: "bs", arg: 1, scope: !667, file: !362, line: 77, type: !670)
!667 = distinct !DISubprogram(name: "selected_boot_partition", scope: !362, file: !362, line: 77, type: !668, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !672)
!668 = !DISubroutineType(types: !669)
!669 = !{!36, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!672 = !{!666, !673}
!673 = !DILocalVariable(name: "boot_index", scope: !667, file: !362, line: 79, type: !36)
!674 = !DILocation(line: 0, scope: !667, inlinedAt: !675)
!675 = distinct !DILocation(line: 70, column: 12, scope: !650, inlinedAt: !656)
!676 = !DILocation(line: 79, column: 22, scope: !667, inlinedAt: !675)
!677 = !DILocation(line: 80, column: 20, scope: !678, inlinedAt: !675)
!678 = distinct !DILexicalBlock(scope: !667, file: !362, line: 80, column: 9)
!679 = !DILocation(line: 80, column: 9, scope: !667, inlinedAt: !675)
!680 = !DILocation(line: 0, scope: !608)
!681 = !DILocation(line: 53, column: 9, scope: !682)
!682 = distinct !DILexicalBlock(scope: !683, file: !362, line: 52, column: 38)
!683 = distinct !DILexicalBlock(scope: !608, file: !362, line: 52, column: 9)
!684 = !DILocation(line: 83, column: 9, scope: !685, inlinedAt: !675)
!685 = distinct !DILexicalBlock(scope: !667, file: !362, line: 83, column: 9)
!686 = !DILocation(line: 57, column: 5, scope: !608)
!687 = !DISubprogram(name: "esp_rom_get_reset_reason", scope: !571, file: !571, line: 53, type: !688, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !574)
!688 = !DISubroutineType(types: !689)
!689 = !{!690, !36}
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "soc_reset_reason_t", file: !109, line: 54, baseType: !108)
!691 = distinct !DISubprogram(name: "__getreent", scope: !362, file: !362, line: 130, type: !692, scopeLine: 131, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !574)
!692 = !DISubroutineType(types: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !696, line: 377, size: 1920, elements: !697)
!696 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/reent.h", directory: "/home/mjshen/RTOSExploration/esp")
!697 = !{!698, !699, !777, !778, !779, !780, !781, !782, !783, !787, !808, !812, !813, !814, !815, !824, !837, !838, !843, !860, !861, !868, !869, !885}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !695, file: !696, line: 381, baseType: !36, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !695, file: !696, line: 386, baseType: !700, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !696, line: 292, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !696, line: 186, size: 832, elements: !703)
!703 = !{!704, !705, !706, !707, !709, !710, !715, !716, !717, !718, !722, !726, !732, !736, !737, !738, !739, !741, !745, !746, !747, !749, !761, !776}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !702, file: !696, line: 187, baseType: !396, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !702, file: !696, line: 188, baseType: !36, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !702, file: !696, line: 189, baseType: !36, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !702, file: !696, line: 190, baseType: !708, size: 16, offset: 96)
!708 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !702, file: !696, line: 191, baseType: !708, size: 16, offset: 112)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !702, file: !696, line: 192, baseType: !711, size: 64, offset: 128)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !696, line: 122, size: 64, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !711, file: !696, line: 123, baseType: !396, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !711, file: !696, line: 124, baseType: !36, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !702, file: !696, line: 193, baseType: !36, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !702, file: !696, line: 196, baseType: !694, size: 32, offset: 224)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !702, file: !696, line: 200, baseType: !35, size: 32, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !702, file: !696, line: 202, baseType: !719, size: 32, offset: 288)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DISubroutineType(types: !721)
!721 = !{!36, !694, !35, !422, !36}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !702, file: !696, line: 204, baseType: !723, size: 32, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DISubroutineType(types: !725)
!725 = !{!36, !694, !35, !81, !36}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !702, file: !696, line: 207, baseType: !727, size: 32, offset: 352)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DISubroutineType(types: !729)
!729 = !{!730, !694, !35, !730, !36}
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !160, line: 116, baseType: !731)
!731 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !702, file: !696, line: 208, baseType: !733, size: 32, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DISubroutineType(types: !735)
!735 = !{!36, !694, !35}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !702, file: !696, line: 211, baseType: !711, size: 64, offset: 416)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !702, file: !696, line: 212, baseType: !396, size: 32, offset: 480)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !702, file: !696, line: 213, baseType: !36, size: 32, offset: 512)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !702, file: !696, line: 216, baseType: !740, size: 24, offset: 544)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 24, elements: !246)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !702, file: !696, line: 217, baseType: !742, size: 8, offset: 568)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 1)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !702, file: !696, line: 220, baseType: !711, size: 64, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !702, file: !696, line: 223, baseType: !36, size: 32, offset: 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !702, file: !696, line: 224, baseType: !748, size: 32, offset: 672)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !160, line: 46, baseType: !731)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !702, file: !696, line: 231, baseType: !750, size: 32, offset: 704)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !696, line: 35, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !752, line: 34, baseType: !753)
!752 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !755, line: 23, size: 736, elements: !756)
!755 = !DIFile(filename: "esp-idf/components/newlib/platform_include/sys/lock.h", directory: "/home/mjshen/RTOSExploration/esp")
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !754, file: !755, line: 24, baseType: !758, size: 736)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 736, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 23)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !702, file: !696, line: 233, baseType: !762, size: 64, offset: 736)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !160, line: 170, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 162, size: 64, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !763, file: !160, line: 164, baseType: !36, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !763, file: !160, line: 169, baseType: !767, size: 32, offset: 32)
!767 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !763, file: !160, line: 165, size: 32, elements: !768)
!768 = !{!769, !772}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !767, file: !160, line: 167, baseType: !770, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !771, line: 116, baseType: !17)
!771 = !DIFile(filename: "xtensa-esp32-elf-clang/lib/clang/14.0.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/esp")
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !767, file: !160, line: 168, baseType: !773, size: 32)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 4)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !702, file: !696, line: 234, baseType: !36, size: 32, offset: 800)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !695, file: !696, line: 386, baseType: !700, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !695, file: !696, line: 386, baseType: !700, size: 32, offset: 96)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !695, file: !696, line: 388, baseType: !36, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !695, file: !696, line: 390, baseType: !422, size: 32, offset: 160)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !695, file: !696, line: 392, baseType: !36, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !695, file: !696, line: 394, baseType: !36, size: 32, offset: 224)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !695, file: !696, line: 395, baseType: !784, size: 32, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !786, line: 9, flags: DIFlagFwdDecl)
!786 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/sys/_locale.h", directory: "/home/mjshen/RTOSExploration/esp")
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !695, file: !696, line: 397, baseType: !788, size: 32, offset: 288)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !696, line: 349, size: 128, elements: !790)
!790 = !{!791, !804, !805, !806}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !789, file: !696, line: 352, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !696, line: 52, size: 192, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !793, file: !696, line: 54, baseType: !792, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !793, file: !696, line: 55, baseType: !36, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !793, file: !696, line: 55, baseType: !36, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !793, file: !696, line: 55, baseType: !36, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !793, file: !696, line: 55, baseType: !36, size: 32, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !793, file: !696, line: 56, baseType: !801, size: 32, offset: 160)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 32, elements: !743)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !696, line: 22, baseType: !803)
!803 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !789, file: !696, line: 353, baseType: !36, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !789, file: !696, line: 354, baseType: !792, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !789, file: !696, line: 355, baseType: !807, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !695, file: !696, line: 399, baseType: !809, size: 32, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !694}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !695, file: !696, line: 401, baseType: !36, size: 32, offset: 352)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !695, file: !696, line: 404, baseType: !36, size: 32, offset: 384)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !695, file: !696, line: 405, baseType: !422, size: 32, offset: 416)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !695, file: !696, line: 407, baseType: !816, size: 32, offset: 448)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !696, line: 324, size: 192, elements: !818)
!818 = !{!819, !821, !822, !823}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !817, file: !696, line: 325, baseType: !820, size: 48)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !246)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !817, file: !696, line: 326, baseType: !820, size: 48, offset: 48)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !817, file: !696, line: 327, baseType: !7, size: 16, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !817, file: !696, line: 330, baseType: !229, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !695, file: !696, line: 408, baseType: !825, size: 32, offset: 480)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !696, line: 60, size: 288, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !826, file: !696, line: 62, baseType: !36, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !826, file: !696, line: 63, baseType: !36, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !826, file: !696, line: 64, baseType: !36, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !826, file: !696, line: 65, baseType: !36, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !826, file: !696, line: 66, baseType: !36, size: 32, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !826, file: !696, line: 67, baseType: !36, size: 32, offset: 160)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !826, file: !696, line: 68, baseType: !36, size: 32, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !826, file: !696, line: 69, baseType: !36, size: 32, offset: 224)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !826, file: !696, line: 70, baseType: !36, size: 32, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !695, file: !696, line: 409, baseType: !422, size: 32, offset: 512)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !695, file: !696, line: 412, baseType: !839, size: 32, offset: 544)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !36}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !695, file: !696, line: 416, baseType: !844, size: 32, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !696, line: 90, size: 1120, elements: !846)
!846 = !{!847, !848, !849, !851}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !845, file: !696, line: 91, baseType: !844, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !845, file: !696, line: 92, baseType: !36, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !845, file: !696, line: 93, baseType: !850, size: 1024, offset: 64)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1024, elements: !292)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !845, file: !696, line: 94, baseType: !852, size: 32, offset: 1088)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !696, line: 79, size: 2112, elements: !854)
!854 = !{!855, !857, !858, !859}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !853, file: !696, line: 80, baseType: !856, size: 1024)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1024, elements: !292)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !853, file: !696, line: 81, baseType: !856, size: 1024, offset: 1024)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !853, file: !696, line: 83, baseType: !802, size: 32, offset: 2048)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !853, file: !696, line: 86, baseType: !802, size: 32, offset: 2080)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !695, file: !696, line: 417, baseType: !845, size: 1120, offset: 608)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !695, file: !696, line: 420, baseType: !862, size: 96, offset: 1728)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !696, line: 296, size: 96, elements: !863)
!863 = !{!864, !866, !867}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !862, file: !696, line: 298, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !862, file: !696, line: 299, baseType: !36, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !862, file: !696, line: 300, baseType: !700, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !695, file: !696, line: 421, baseType: !700, size: 32, offset: 1824)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !695, file: !696, line: 422, baseType: !870, size: 32, offset: 1856)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !696, line: 359, size: 640, elements: !872)
!872 = !{!873, !874, !875, !876, !877, !879, !880, !881, !882, !883, !884}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !871, file: !696, line: 362, baseType: !422, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !871, file: !696, line: 363, baseType: !762, size: 64, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !871, file: !696, line: 364, baseType: !762, size: 64, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !871, file: !696, line: 365, baseType: !762, size: 64, offset: 160)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !871, file: !696, line: 366, baseType: !878, size: 64, offset: 224)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !253)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !871, file: !696, line: 367, baseType: !36, size: 32, offset: 288)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !871, file: !696, line: 368, baseType: !762, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !871, file: !696, line: 369, baseType: !762, size: 64, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !871, file: !696, line: 370, baseType: !762, size: 64, offset: 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !871, file: !696, line: 371, baseType: !762, size: 64, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !871, file: !696, line: 372, baseType: !762, size: 64, offset: 576)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !695, file: !696, line: 423, baseType: !422, size: 32, offset: 1888)
!886 = !DILocation(line: 132, column: 12, scope: !691)
!887 = !{!888, !888, i64 0}
!888 = !{!"any pointer", !547, i64 0}
!889 = !DILocation(line: 132, column: 5, scope: !691)
!890 = distinct !DISubprogram(name: "bootloader_hooks_include", scope: !891, file: !891, line: 6, type: !71, scopeLine: 6, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !363, retainedNodes: !574)
!891 = !DIFile(filename: "esp-idf/examples/custom_bootloader/bootloader_hooks/bootloader_components/my_boot_hooks/hooks.c", directory: "/home/mjshen/RTOSExploration/esp")
!892 = !DILocation(line: 7, column: 1, scope: !890)
!893 = distinct !DISubprogram(name: "bootloader_before_init", scope: !891, file: !891, line: 10, type: !71, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !363, retainedNodes: !574)
!894 = !DILocation(line: 14, column: 5, scope: !895)
!895 = distinct !DILexicalBlock(scope: !896, file: !891, line: 14, column: 5)
!896 = distinct !DILexicalBlock(scope: !897, file: !891, line: 14, column: 5)
!897 = distinct !DILexicalBlock(scope: !893, file: !891, line: 14, column: 5)
!898 = !DILocation(line: 15, column: 1, scope: !893)
!899 = distinct !DISubprogram(name: "bootloader_after_init", scope: !891, file: !891, line: 17, type: !71, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !363, retainedNodes: !574)
!900 = !DILocation(line: 18, column: 5, scope: !901)
!901 = distinct !DILexicalBlock(scope: !902, file: !891, line: 18, column: 5)
!902 = distinct !DILexicalBlock(scope: !903, file: !891, line: 18, column: 5)
!903 = distinct !DILexicalBlock(scope: !899, file: !891, line: 18, column: 5)
!904 = !DILocation(line: 19, column: 1, scope: !899)
!905 = distinct !DISubprogram(name: "bootloader_common_get_partition_description", scope: !48, file: !48, line: 123, type: !906, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !938)
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !910, !917}
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_err_t", file: !909, line: 19, baseType: !36)
!909 = !DIFile(filename: "esp-idf/components/esp_common/include/esp_err.h", directory: "/home/mjshen/RTOSExploration/esp")
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_pos_t", file: !16, line: 71, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 68, size: 64, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !913, file: !16, line: 69, baseType: !39, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !913, file: !16, line: 70, baseType: !39, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_app_desc_t", file: !919, line: 35, baseType: !920)
!919 = !DIFile(filename: "esp-idf/components/esp_app_format/include/esp_app_desc.h", directory: "/home/mjshen/RTOSExploration/esp")
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !919, line: 24, size: 2048, elements: !921)
!921 = !{!922, !923, !924, !925, !927, !928, !930, !931, !932, !934}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "magic_word", scope: !920, file: !919, line: 25, baseType: !39, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "secure_version", scope: !920, file: !919, line: 26, baseType: !39, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "reserv1", scope: !920, file: !919, line: 27, baseType: !142, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !920, file: !919, line: 28, baseType: !926, size: 256, offset: 128)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, elements: !292)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "project_name", scope: !920, file: !919, line: 29, baseType: !926, size: 256, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !920, file: !919, line: 30, baseType: !929, size: 128, offset: 640)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, elements: !625)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !920, file: !919, line: 31, baseType: !929, size: 128, offset: 768)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "idf_ver", scope: !920, file: !919, line: 32, baseType: !926, size: 256, offset: 896)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "app_elf_sha256", scope: !920, file: !919, line: 33, baseType: !933, size: 256, offset: 1152)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 256, elements: !292)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "reserv2", scope: !920, file: !919, line: 34, baseType: !935, size: 640, offset: 1408)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 640, elements: !936)
!936 = !{!937}
!937 = !DISubrange(count: 20)
!938 = !{!939, !940, !941, !942, !943}
!939 = !DILocalVariable(name: "partition", arg: 1, scope: !905, file: !48, line: 123, type: !910)
!940 = !DILocalVariable(name: "app_desc", arg: 2, scope: !905, file: !48, line: 123, type: !917)
!941 = !DILocalVariable(name: "app_desc_offset", scope: !905, file: !48, line: 129, type: !137)
!942 = !DILocalVariable(name: "mmap_size", scope: !905, file: !48, line: 130, type: !137)
!943 = !DILocalVariable(name: "image", scope: !905, file: !48, line: 131, type: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!945 = !DILocation(line: 0, scope: !905)
!946 = !DILocation(line: 125, column: 19, scope: !947)
!947 = distinct !DILexicalBlock(scope: !905, file: !48, line: 125, column: 9)
!948 = !DILocation(line: 125, column: 27, scope: !947)
!949 = !DILocation(line: 125, column: 61, scope: !947)
!950 = !{!951, !546, i64 0}
!951 = !{!"", !546, i64 0, !546, i64 4}
!952 = !DILocation(line: 125, column: 68, scope: !947)
!953 = !DILocation(line: 125, column: 9, scope: !905)
!954 = !DILocation(line: 131, column: 28, scope: !905)
!955 = !DILocation(line: 132, column: 15, scope: !956)
!956 = distinct !DILexicalBlock(scope: !905, file: !48, line: 132, column: 9)
!957 = !DILocation(line: 132, column: 9, scope: !905)
!958 = !DILocation(line: 133, column: 9, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !48, line: 133, column: 9)
!960 = distinct !DILexicalBlock(scope: !961, file: !48, line: 133, column: 9)
!961 = distinct !DILexicalBlock(scope: !962, file: !48, line: 133, column: 9)
!962 = distinct !DILexicalBlock(scope: !956, file: !48, line: 132, column: 24)
!963 = !DILocation(line: 134, column: 9, scope: !962)
!964 = !DILocation(line: 137, column: 28, scope: !905)
!965 = !DILocation(line: 137, column: 5, scope: !905)
!966 = !DILocation(line: 138, column: 5, scope: !905)
!967 = !DILocation(line: 140, column: 19, scope: !968)
!968 = distinct !DILexicalBlock(scope: !905, file: !48, line: 140, column: 9)
!969 = !{!970, !546, i64 0}
!970 = !{!"", !546, i64 0, !546, i64 4, !547, i64 8, !547, i64 16, !547, i64 48, !547, i64 80, !547, i64 96, !547, i64 112, !547, i64 144, !547, i64 176}
!971 = !DILocation(line: 140, column: 30, scope: !968)
!972 = !DILocation(line: 145, column: 1, scope: !905)
!973 = !DISubprogram(name: "memcpy", scope: !974, file: !974, line: 31, type: !975, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !574)
!974 = !DIFile(filename: "xtensa-esp32-elf-clang/bin/../lib/gcc/xtensa-esp32-elf/8.4.0/../../../../xtensa-esp32-elf/sys-include/string.h", directory: "/home/mjshen/RTOSExploration/esp")
!975 = !DISubroutineType(types: !976)
!976 = !{!35, !977, !978, !157}
!977 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !35)
!978 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!981 = distinct !DISubprogram(name: "bootloader_utility_load_partition_table", scope: !48, file: !48, line: 148, type: !982, scopeLine: 149, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !995)
!982 = !DISubroutineType(types: !983)
!983 = !{!84, !984}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "bootloader_state_t", file: !612, line: 32, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !612, line: 25, size: 1280, elements: !987)
!987 = !{!988, !989, !990, !991, !993, !994}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ota_info", scope: !986, file: !612, line: 26, baseType: !912, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !986, file: !612, line: 27, baseType: !912, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !986, file: !612, line: 28, baseType: !912, size: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ota", scope: !986, file: !612, line: 29, baseType: !992, size: 1024, offset: 192)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 1024, elements: !625)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "app_count", scope: !986, file: !612, line: 30, baseType: !39, size: 32, offset: 1216)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "selected_subtype", scope: !986, file: !612, line: 31, baseType: !39, size: 32, offset: 1248)
!995 = !{!996, !997, !1012, !1013, !1014, !1015, !1017}
!996 = !DILocalVariable(name: "bs", arg: 1, scope: !981, file: !48, line: 148, type: !984)
!997 = !DILocalVariable(name: "partitions", scope: !981, file: !48, line: 150, type: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_partition_info_t", file: !16, line: 83, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 76, size: 256, elements: !1002)
!1002 = !{!1003, !1006, !1007, !1008, !1009, !1011}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1001, file: !16, line: 77, baseType: !1004, size: 16)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !40, line: 36, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !42, line: 57, baseType: !7)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1001, file: !16, line: 78, baseType: !44, size: 8, offset: 16)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1001, file: !16, line: 79, baseType: !44, size: 8, offset: 24)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1001, file: !16, line: 80, baseType: !912, size: 64, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1001, file: !16, line: 81, baseType: !1010, size: 128, offset: 96)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, elements: !625)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1001, file: !16, line: 82, baseType: !39, size: 32, offset: 224)
!1012 = !DILocalVariable(name: "partition_usage", scope: !981, file: !48, line: 151, type: !81)
!1013 = !DILocalVariable(name: "err", scope: !981, file: !48, line: 152, type: !908)
!1014 = !DILocalVariable(name: "num_partitions", scope: !981, file: !48, line: 153, type: !36)
!1015 = !DILocalVariable(name: "i", scope: !1016, file: !48, line: 171, type: !36)
!1016 = distinct !DILexicalBlock(scope: !981, file: !48, line: 171, column: 5)
!1017 = !DILocalVariable(name: "partition", scope: !1018, file: !48, line: 172, type: !998)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !48, line: 171, column: 46)
!1019 = distinct !DILexicalBlock(scope: !1016, file: !48, line: 171, column: 5)
!1020 = !DILocation(line: 0, scope: !981)
!1021 = !DILocation(line: 153, column: 5, scope: !981)
!1022 = !DILocation(line: 155, column: 18, scope: !981)
!1023 = !DILocation(line: 156, column: 10, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !981, file: !48, line: 156, column: 9)
!1025 = !DILocation(line: 156, column: 9, scope: !981)
!1026 = !DILocation(line: 157, column: 9, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !48, line: 157, column: 9)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !48, line: 157, column: 9)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !48, line: 157, column: 9)
!1030 = distinct !DILexicalBlock(scope: !1024, file: !48, line: 156, column: 22)
!1031 = !DILocation(line: 158, column: 9, scope: !1030)
!1032 = !DILocation(line: 162, column: 11, scope: !981)
!1033 = !DILocation(line: 163, column: 13, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !981, file: !48, line: 163, column: 9)
!1035 = !DILocation(line: 163, column: 9, scope: !981)
!1036 = !DILocation(line: 164, column: 9, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !48, line: 164, column: 9)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !48, line: 164, column: 9)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !48, line: 164, column: 9)
!1040 = distinct !DILexicalBlock(scope: !1034, file: !48, line: 163, column: 24)
!1041 = !DILocation(line: 165, column: 9, scope: !1040)
!1042 = !DILocation(line: 168, column: 5, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !48, line: 168, column: 5)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !48, line: 168, column: 5)
!1045 = distinct !DILexicalBlock(scope: !981, file: !48, line: 168, column: 5)
!1046 = !DILocation(line: 169, column: 5, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !48, line: 169, column: 5)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !48, line: 169, column: 5)
!1049 = distinct !DILexicalBlock(scope: !981, file: !48, line: 169, column: 5)
!1050 = !DILocation(line: 0, scope: !1016)
!1051 = !DILocation(line: 171, column: 25, scope: !1019)
!1052 = !DILocation(line: 171, column: 23, scope: !1019)
!1053 = !DILocation(line: 171, column: 5, scope: !1016)
!1054 = !DILocation(line: 237, column: 5, scope: !981)
!1055 = !DILocation(line: 239, column: 5, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !48, line: 239, column: 5)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !48, line: 239, column: 5)
!1058 = distinct !DILexicalBlock(scope: !981, file: !48, line: 239, column: 5)
!1059 = !DILocation(line: 240, column: 5, scope: !981)
!1060 = !DILocation(line: 0, scope: !1018)
!1061 = !DILocation(line: 178, column: 28, scope: !1018)
!1062 = !{!1063, !547, i64 2}
!1063 = !{!"", !1064, i64 0, !547, i64 2, !547, i64 3, !951, i64 4, !547, i64 12, !546, i64 28}
!1064 = !{!"short", !547, i64 0}
!1065 = !DILocation(line: 178, column: 9, scope: !1018)
!1066 = !DILocation(line: 180, column: 32, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1018, file: !48, line: 178, column: 34)
!1068 = !{!1063, !547, i64 3}
!1069 = !DILocation(line: 180, column: 21, scope: !1067)
!1070 = !DILocation(line: 180, column: 13, scope: !1067)
!1071 = !DILocation(line: 182, column: 42, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1067, file: !48, line: 180, column: 41)
!1073 = !DILocation(line: 184, column: 17, scope: !1072)
!1074 = !DILocation(line: 186, column: 39, scope: !1072)
!1075 = !DILocation(line: 188, column: 17, scope: !1072)
!1076 = !DILocation(line: 191, column: 41, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1072, file: !48, line: 191, column: 21)
!1078 = !DILocation(line: 191, column: 67, scope: !1077)
!1079 = !DILocation(line: 191, column: 21, scope: !1072)
!1080 = !DILocation(line: 192, column: 48, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1077, file: !48, line: 191, column: 93)
!1082 = !DILocation(line: 192, column: 21, scope: !1081)
!1083 = !DILocation(line: 192, column: 86, scope: !1081)
!1084 = !DILocation(line: 193, column: 21, scope: !1081)
!1085 = !{!1086, !546, i64 152}
!1086 = !{!"", !951, i64 0, !951, i64 8, !951, i64 16, !547, i64 24, !546, i64 152, !546, i64 156}
!1087 = !DILocation(line: 195, column: 17, scope: !1081)
!1088 = !DILocation(line: 202, column: 32, scope: !1067)
!1089 = !DILocation(line: 202, column: 13, scope: !1067)
!1090 = !DILocation(line: 204, column: 43, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1067, file: !48, line: 202, column: 41)
!1092 = !DILocation(line: 206, column: 17, scope: !1091)
!1093 = !DILocation(line: 212, column: 17, scope: !1091)
!1094 = !DILocation(line: 215, column: 17, scope: !1091)
!1095 = !DILocation(line: 221, column: 17, scope: !1091)
!1096 = !DILocation(line: 224, column: 17, scope: !1091)
!1097 = !DILocation(line: 232, column: 9, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !48, line: 232, column: 9)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !48, line: 232, column: 9)
!1100 = distinct !DILexicalBlock(scope: !1018, file: !48, line: 232, column: 9)
!1101 = !{!1063, !546, i64 4}
!1102 = !{!1063, !546, i64 8}
!1103 = !DILocation(line: 171, column: 42, scope: !1019)
!1104 = distinct !{!1104, !1053, !1105, !1106}
!1105 = !DILocation(line: 235, column: 5, scope: !1016)
!1106 = !{!"llvm.loop.mustprogress"}
!1107 = !DILocation(line: 241, column: 1, scope: !981)
!1108 = distinct !DISubprogram(name: "bootloader_utility_get_selected_boot_partition", scope: !48, file: !48, line: 347, type: !1109, scopeLine: 348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1113)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!36, !1111}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1113 = !{!1114, !1115, !1125, !1126, !1129}
!1114 = !DILocalVariable(name: "bs", arg: 1, scope: !1108, file: !48, line: 347, type: !1111)
!1115 = !DILocalVariable(name: "otadata", scope: !1108, file: !48, line: 349, type: !1116)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1117, size: 512, elements: !143)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "esp_ota_select_entry_t", file: !16, line: 65, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 60, size: 256, elements: !1119)
!1119 = !{!1120, !1121, !1123, !1124}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ota_seq", scope: !1118, file: !16, line: 61, baseType: !39, size: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "seq_label", scope: !1118, file: !16, line: 62, baseType: !1122, size: 160, offset: 32)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !936)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ota_state", scope: !1118, file: !16, line: 63, baseType: !39, size: 32, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !1118, file: !16, line: 64, baseType: !39, size: 32, offset: 224)
!1125 = !DILocalVariable(name: "boot_index", scope: !1108, file: !48, line: 350, type: !36)
!1126 = !DILocalVariable(name: "active_otadata", scope: !1127, file: !48, line: 395, type: !36)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !48, line: 394, column: 12)
!1128 = distinct !DILexicalBlock(scope: !1108, file: !48, line: 376, column: 9)
!1129 = !DILocalVariable(name: "ota_seq", scope: !1130, file: !48, line: 411, type: !39)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !48, line: 409, column: 35)
!1131 = distinct !DILexicalBlock(scope: !1127, file: !48, line: 409, column: 13)
!1132 = !DILocation(line: 0, scope: !1108)
!1133 = !DILocation(line: 349, column: 5, scope: !1108)
!1134 = !DILocation(line: 349, column: 28, scope: !1108)
!1135 = !DILocation(line: 352, column: 22, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1108, file: !48, line: 352, column: 9)
!1137 = !{!1086, !546, i64 0}
!1138 = !DILocation(line: 352, column: 29, scope: !1136)
!1139 = !DILocation(line: 352, column: 9, scope: !1108)
!1140 = !DILocation(line: 356, column: 9, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1108, file: !48, line: 356, column: 9)
!1142 = !DILocalVariable(name: "ota_info", arg: 1, scope: !1143, file: !48, line: 96, type: !910)
!1143 = distinct !DISubprogram(name: "read_otadata", scope: !48, file: !48, line: 96, type: !1144, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1147)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!908, !910, !1146}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 32)
!1147 = !{!1142, !1148, !1149}
!1148 = !DILocalVariable(name: "two_otadata", arg: 2, scope: !1143, file: !48, line: 96, type: !1146)
!1149 = !DILocalVariable(name: "ota_select_map", scope: !1143, file: !48, line: 98, type: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1152 = !DILocation(line: 0, scope: !1143, inlinedAt: !1153)
!1153 = distinct !DILocation(line: 356, column: 9, scope: !1141)
!1154 = !DILocation(line: 99, column: 19, scope: !1155, inlinedAt: !1153)
!1155 = distinct !DILexicalBlock(scope: !1143, file: !48, line: 99, column: 9)
!1156 = !DILocation(line: 99, column: 26, scope: !1155, inlinedAt: !1153)
!1157 = !DILocation(line: 99, column: 9, scope: !1143, inlinedAt: !1153)
!1158 = !DILocation(line: 104, column: 19, scope: !1159, inlinedAt: !1153)
!1159 = distinct !DILexicalBlock(scope: !1143, file: !48, line: 104, column: 9)
!1160 = !{!951, !546, i64 4}
!1161 = !DILocation(line: 104, column: 24, scope: !1159, inlinedAt: !1153)
!1162 = !DILocation(line: 104, column: 9, scope: !1143, inlinedAt: !1153)
!1163 = !DILocation(line: 105, column: 9, scope: !1164, inlinedAt: !1153)
!1164 = distinct !DILexicalBlock(scope: !1165, file: !48, line: 105, column: 9)
!1165 = distinct !DILexicalBlock(scope: !1166, file: !48, line: 105, column: 9)
!1166 = distinct !DILexicalBlock(scope: !1167, file: !48, line: 105, column: 9)
!1167 = distinct !DILexicalBlock(scope: !1159, file: !48, line: 104, column: 44)
!1168 = !DILocation(line: 106, column: 9, scope: !1167, inlinedAt: !1153)
!1169 = !DILocation(line: 110, column: 22, scope: !1143, inlinedAt: !1153)
!1170 = !DILocation(line: 111, column: 10, scope: !1171, inlinedAt: !1153)
!1171 = distinct !DILexicalBlock(scope: !1143, file: !48, line: 111, column: 9)
!1172 = !DILocation(line: 111, column: 9, scope: !1143, inlinedAt: !1153)
!1173 = !DILocation(line: 112, column: 9, scope: !1174, inlinedAt: !1153)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !48, line: 112, column: 9)
!1175 = distinct !DILexicalBlock(scope: !1176, file: !48, line: 112, column: 9)
!1176 = distinct !DILexicalBlock(scope: !1177, file: !48, line: 112, column: 9)
!1177 = distinct !DILexicalBlock(scope: !1171, file: !48, line: 111, column: 26)
!1178 = !DILocation(line: 113, column: 9, scope: !1177, inlinedAt: !1153)
!1179 = !DILocation(line: 116, column: 5, scope: !1143, inlinedAt: !1153)
!1180 = !DILocation(line: 117, column: 13, scope: !1143, inlinedAt: !1153)
!1181 = !DILocation(line: 117, column: 55, scope: !1143, inlinedAt: !1153)
!1182 = !DILocation(line: 117, column: 5, scope: !1143, inlinedAt: !1153)
!1183 = !DILocation(line: 118, column: 5, scope: !1143, inlinedAt: !1153)
!1184 = !DILocation(line: 359, column: 30, scope: !1108)
!1185 = !DILocation(line: 376, column: 10, scope: !1128)
!1186 = !DILocation(line: 376, column: 60, scope: !1128)
!1187 = !DILocation(line: 377, column: 13, scope: !1128)
!1188 = !DILocation(line: 377, column: 64, scope: !1128)
!1189 = !DILocation(line: 378, column: 17, scope: !1128)
!1190 = !DILocation(line: 378, column: 27, scope: !1128)
!1191 = !DILocation(line: 376, column: 9, scope: !1108)
!1192 = !DILocation(line: 380, column: 25, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !48, line: 380, column: 13)
!1194 = distinct !DILexicalBlock(scope: !1128, file: !48, line: 378, column: 33)
!1195 = !{!1086, !546, i64 8}
